[
  {
    "word": "Babble",
    "meaning": "to chatter about something in a typically foolish or excitable way",
    "examples_0": "The first time her crush talked to her, she was so excited that she was at a loss for words and began to babble about the weather.",
    "examples_1": "She talked to quickly that her words became a blur of indecipherable babble."
  },
  {
    "word": "Babel",
    "meaning": "a confused mixture of sounds and voices",
    "examples_0": "The children filled the classroom with babel, leaving the teacher overwhelmed at the sound of so many voices at once.",
    "examples_1": "The babel sounded to be coming from the train car, but too many people were on board to determine the source."
  },
  {
    "word": "Babelicious",
    "meaning": "very physically attractive or sexy",
    "examples_0": "The men continued to catcall the babelicious woman as she walked down the street in her short skirt.",
    "examples_1": "Men traveled to the club to the curvy and babelicious performer gyrate on the stage."
  },
  {
    "word": "Baccalaureate",
    "meaning": "a typical four-year degree from a college or university",
    "examples_0": "In order for the college student to receive her baccalaureate, she must pass another math class.",
    "examples_1": "Tiffany met the qualifications for the nursing job since her baccalaureate proved she had graduated from college."
  },
  {
    "word": "Bacchanal",
    "meaning": "a wild incident involving a drunken celebration",
    "examples_0": "The hotel ended the bachelor party after it turned into a noisy bacchanal.",
    "examples_1": "When my parents came home to a bacchanal of naked kids in the swimming pool, they were outraged."
  },
  {
    "word": "Bacchanalian",
    "meaning": "relating to or given to reveling and drunkenness",
    "examples_0": "By the time the bacchanalian party ended, everyone was vomiting up their alcohol.",
    "examples_1": "Everyone was giving each other high fives and downing shots at the bacchanalian extravaganza."
  },
  {
    "word": "Bachelor",
    "meaning": "a typically young, single man actively in search of a romantic relationship",
    "examples_0": "Many single men like to think of themselves as a bachelor, but if they aren?t trying to find a partner they?re just single men.",
    "examples_1": "As you might expect, the show ?The Bachelor? is all about a single man looking to start a relationship with one of many different women."
  },
  {
    "word": "Back-and-forth",
    "meaning": "moving first in one direction and then in another",
    "examples_0": "The back-and-forth movement of the ship caused those onboard to become seasick.",
    "examples_1": "On the playground, Nate and Sammy ran back-and-forth between the two different slides."
  },
  {
    "word": "Backache",
    "meaning": "a pain or ache in the area around one?s spine",
    "examples_0": "After bending over for several hours at work, the baggage claim worker began to suffer from a terrible backache.",
    "examples_1": "Sitting in a chair too long can cause a backache for those with spine issues."
  },
  {
    "word": "Backbite",
    "meaning": "to speak negatively or maliciously about someone who is not present to defend themselves",
    "examples_0": "The teenage girls tend to backbite each other and talk mess when they?re with their other friends.",
    "examples_1": "Because Jenn wasn?t there to defend herself, it was unfair for the other women to backbite and gossip about her."
  },
  {
    "word": "Backbite",
    "meaning": "to talk or gossip about someone in a way that is spiteful or mean",
    "examples_0": "Grace makes an effort not to backbite or discuss others negatively while at school.",
    "examples_1": "The spiteful social worker spent most of her day trying backbite others and making fun of those with disabilities."
  },
  {
    "word": "Backbone",
    "meaning": "the foundation or sturdiest part of something",
    "examples_0": "Because he was the backbone of the company, operations stopped after Jim died.",
    "examples_1": "Clarence realized that his wife was the backbone of his existence and hoped they could work out their troubled union."
  },
  {
    "word": "Backdoor",
    "meaning": "refers to an indirect or dishonest way of doing or achieving something",
    "examples_0": "The failing company?s backdoor bailout allowed them to get rid of their debt but left their shocked employees without jobs.",
    "examples_1": "The dishonest, backdoor election allowed the mayor to keep his job without having to answer to the people."
  },
  {
    "word": "Backdoor",
    "meaning": "an indirect and dishonest way of doing something",
    "examples_0": "Because of a shady backdoor deal, the politician lost support from someone he thought was a loyal backer.",
    "examples_1": "Although the backdoor sale was illegal and downright dishonest, the purchase of the land will help the downtown area grow."
  },
  {
    "word": "Backdrop",
    "meaning": "a painted piece of cloth that is used as the background for a performance picture",
    "examples_0": "The photographer used an airbrushed backdrop to make it look the photos were actually being taken in a field.",
    "examples_1": "During the intermission, the stagehands moved the backdropped and replaced it with a new scene."
  },
  {
    "word": "Backer",
    "meaning": "a supporter or follower of someone or something",
    "examples_0": "The anonymous backer is supporting the project by fully funding the activities for the students.",
    "examples_1": "With no backer to offer financial support, the restaurant was forced to shut down last Friday."
  },
  {
    "word": "Backfire",
    "meaning": "of a plan or scheme to have the opposite outcome of what was expected",
    "examples_0": "The celebrity thinks her racy Twitter comments help her gain fans, but I believe writing these kinds of statements might backfire.",
    "examples_1": "Afraid that her evil plan might backfire, the witch had to find another way to take over the city."
  },
  {
    "word": "Background",
    "meaning": "the area or scenery behind the main object of focus",
    "examples_0": "Although the current stage backdrop is beautiful, the director wants a background with more muted colors.",
    "examples_1": "The photographer looked for a background that had both color and shade to snap the couples pictures front of."
  },
  {
    "word": "Backhand",
    "meaning": "to strike someone with the upside of the hand",
    "examples_0": "In a fit of anger, the woman raised her hand to backhand the child but caught herself before she made contact.",
    "examples_1": "The student was removed from the classroom after decided to backhand another kid with the front side of his left hand."
  },
  {
    "word": "Backhoe",
    "meaning": "a mechanical tractor with a bucket on an extending arm that is used to dig things up",
    "examples_0": "The farmer will use a backhoe to dig up some of the stubborn dirt in several field rows.",
    "examples_1": "Because the backhoe has a bucket attached to an extended arm, it is different than your typical tractor."
  },
  {
    "word": "Backlash",
    "meaning": "a strong feeling among a group of people in reaction to a change or recent event",
    "examples_0": "The president received backlash from thousands of people who disagreed with his Twitter statements.",
    "examples_1": "By firing the beloved coach, the college risked backlash from community members who still support him."
  },
  {
    "word": "Backlog",
    "meaning": "work that has piled up",
    "examples_0": "The secretary had a backlog of a hundred documents that needed to be filed before the end of the day.",
    "examples_1": "The fashion designer?s handbags were so popular that the company had a backlog of over a thousand orders."
  },
  {
    "word": "Backpedal",
    "meaning": "to change one?s previously expressed opinions or statements",
    "examples_0": "After people became angry about the celebrity?s Twitter remarks, she began to backpedal on what she said.",
    "examples_1": "The news editor to backpedal or retract his statements, standing firm in his opinion."
  },
  {
    "word": "Backrest",
    "meaning": "a support used to brace the area around one?s spine",
    "examples_0": "After having surgery on his spine, the patient used a backrest for added support.",
    "examples_1": "While getting a message from the therapist, Claire relaxed her frame on a backrest."
  },
  {
    "word": "Backstab",
    "meaning": "to betray one?s friendship by acting in a deceitful way or speaking against someone when they?re not around",
    "examples_0": "Erin was upset that her very best friend would backstab her by having an affair with her husband.",
    "examples_1": "If you backstab your most loyal friends, don?t be surprised when no one trusts you anymore."
  },
  {
    "word": "Backup",
    "meaning": "a person or thing that assists or supports someone/something else",
    "examples_0": "The working mother is looking for a backup babysitter to watch her daughter on days her nanny cannot care for the child.",
    "examples_1": "For safety reasons, the accountant uses a backup drive to store extra copies of the important files saved on his computer."
  },
  {
    "word": "Backward",
    "meaning": "pertaining to the direction towards the back",
    "examples_0": "Timmy accidentally dropped the soccer ball, and it rolled backward all the way down the hill.",
    "examples_1": ""
  },
  {
    "word": "Bacteria",
    "meaning": "microscopic living organisms, some of which are dangerous and can cause illness",
    "examples_0": "The teacher taught her students the importance of washing their hands to kill off bad bacteria.",
    "examples_1": "Julie wiped her doorknobs with a cleaning cloth to reduce the spread of bacteria."
  },
  {
    "word": "Bacterium",
    "meaning": "once-celled microscopic living organisms that can cause infection",
    "examples_0": "The dirty slide was placed under the microscope so that the students could see all of the bacterium growing in the microbe-infested goop.",
    "examples_1": "Because of the dangerous bacterium found swimming in the water, several beachgoers became ill and infected with a disease."
  },
  {
    "word": "Bade",
    "meaning": "the past tense of bid; bade is used to express greetings and goodbyes",
    "examples_0": "As the cruise ship exited the harbor, the people bade farewell from the ship.",
    "examples_1": "The nieces and nephews bade Aunt Helen good-bye as she left for the airport."
  },
  {
    "word": "Badge",
    "meaning": "a small piece of metal or plastic worn to show that you are a part of some specific group or organization",
    "examples_0": "The officer?s shiny, star-shaped badge let the people know that he was part of the police force.",
    "examples_1": "Security requires all workers at the hospital to show a badge proving they are an employee before entering."
  },
  {
    "word": "Badger",
    "meaning": "to bother or pester",
    "examples_0": "My daughter will badger me until I explain to her how to tie her shoes.",
    "examples_1": "Because he would always badger me, I decided not to tutor my neighbor."
  },
  {
    "word": "Badinage",
    "meaning": "good-humored banter",
    "examples_0": "The humorous badinage between the coworkers made the long workday go faster.",
    "examples_1": "Although Jim often makes me laugh with his witty remarks, he needs to learn the appropriate times for engaging in badinage."
  },
  {
    "word": "Badly",
    "meaning": "severely or seriously",
    "examples_0": "With his head bashed in from hitting the windshield, the car crash victim was considered badly hurt.",
    "examples_1": "The bad student?s behavior of disrupting and being unfocused in class was badly affecting his grades since it seemed like he would fail this year."
  },
  {
    "word": "Baffled",
    "meaning": "totally confused or puzzled",
    "examples_0": "The complex puzzle baffled me for several hours before I could connect all the pieces.",
    "examples_1": "Baffled by her son?s hostile behavior, Jane scheduled an appointment with a family therapist."
  },
  {
    "word": "Bafflement",
    "meaning": "a state of confusion or disarray",
    "examples_0": "The man was left in bafflement when he witnessed something he couldn?t explain occur on the side of the road.",
    "examples_1": "You may be left in a state of bafflement if someone says something nonsensical and ridiculous to you."
  },
  {
    "word": "Bail",
    "meaning": "an amount of money that a person who has been accused of a crime pays to a law court so that they can leave jail temporarily",
    "examples_0": "Bail money was requested before the arrested could be released to his family.",
    "examples_1": "In order to get out of jail temporary, the accused tax evader had to pay a hefty bail bond."
  },
  {
    "word": "Bailiff",
    "meaning": "a legal officer who maintains order in a courtroom during a trial",
    "examples_0": "As the defendant?s witness stood in the witness box, the bailiff held the Bible out to swear her in.",
    "examples_1": "The courthouse in Greene County has an unusual situation regarding the bailiff because he is over 80 years old, and his main responsibility is to keep hardened criminals in line."
  },
  {
    "word": "Bailiwick",
    "meaning": "the district within which a bailie or bailiff has jurisdiction",
    "examples_0": "The bailiwick was quiet as the bailiff patrolled.",
    "examples_1": "Each section of the city was separated into a bailiwick."
  },
  {
    "word": "Bait-And-Switch",
    "meaning": "the action of advertising a product with the intent of selling inferior goods",
    "examples_0": "It does not happen much in America, but in less regulated countries many customers fall victim to the bait-and-switch tactic, buying something shoddy that was advertised as being superior.",
    "examples_1": "You run the risk of bait-and-switch scams when buying things online, as the seller can post any kind of picture yet sell you something far worse than what was shown."
  },
  {
    "word": "Balance",
    "meaning": "remainder",
    "examples_0": "We put a deposit down on our vacation, with the remaining balance being due by June.",
    "examples_1": "Since there was no balance on the original account, the borrower was able to take out another loan."
  },
  {
    "word": "Balderdash",
    "meaning": "ridiculous thoughts or words",
    "examples_0": "Every word that came out of the drunk man?s mouth was balderdash.",
    "examples_1": "Since the politician has no proof of his opponent?s wrongdoings, his claims are viewed as balderdash."
  },
  {
    "word": "Bale",
    "meaning": "a bundle of something (paper, hay, etc.) tightly bound together",
    "examples_0": "The first little pig needed another compressed bale of straw to finish building his house.",
    "examples_1": "Because the horse is still hungry, another bale of hay will need to be delivered to the farm with the other rolls."
  },
  {
    "word": "Baleful",
    "meaning": "hinting at possible harm or danger",
    "examples_0": "With a baleful stare, the gang member pointed his gun at the unarmed police officer.",
    "examples_1": "The witness was frightened when the defendant gave her a baleful glance filled with hatred."
  },
  {
    "word": "Balk",
    "meaning": "refuse to comply",
    "examples_0": "While my dog loves to go for walks in good weather, he will always balk if he gets the slightest whiff of rain in the air.",
    "examples_1": "Although Martin is pretty dependable about following the prescribed routine, he tends to balk at any tasks that call for extra effort."
  },
  {
    "word": "Balkanization",
    "meaning": "typically as the result of or end of a war, when large land areas are broken down into smaller states",
    "examples_0": "The balkanization of Yugoslavia happened after civil wars broke out on the country and several areas broke away to form their own states.",
    "examples_1": "The balkanization of the Ottoman Empire resulted in several small countries that had a deep hate for their neighbors and inspired many wars over the years."
  },
  {
    "word": "Ballad",
    "meaning": "a slow tune that usually focuses on love",
    "examples_0": "My husband and I ended date night by dancing to a romantic ballad.",
    "examples_1": "As the ballad began to play, the couple stepped on the floor for their first wedding date."
  },
  {
    "word": "Ballistic",
    "meaning": "suddenly angry, sad, or otherwise overcome with emotion",
    "examples_0": "After failing the test, the ballistic student began to scream and bang her head against the classroom wall.",
    "examples_1": "The enraged husband was arrested after he went ballistic and shot his cheating wife and her lover."
  },
  {
    "word": "Ballistics",
    "meaning": "the scientific study of the motion of objects that are thrown or shot through the air",
    "examples_0": "Using the science of ballistics, I created a Frisbee that spins back toward the thrower.",
    "examples_1": "The army uses missiles that are governed by the science of ballistics so that the rocket will reach the desired destination."
  },
  {
    "word": "Ballot",
    "meaning": "a piece of paper or sheet on which a voter marks his or her choice",
    "examples_0": "Because the election fell on his 18th birthday, Aiden was finally able to cast a ballot for president of the United States.",
    "examples_1": "Jessie cast her ballot for Clinton while her husband voted for Trump."
  },
  {
    "word": "Ballyhoo",
    "meaning": "a fuss or excessive publicity",
    "examples_0": "A ballyhoo was made over the silly video.",
    "examples_1": "The ballyhoo was overdone to drum up publicity."
  },
  {
    "word": "Balm",
    "meaning": "similar to a lotion that is used to soothe dry skin",
    "examples_0": "Since I was going to a place with a cold dry climate, I decided to get some balm to prevent my hands from getting dry.",
    "examples_1": "After shaking his dry cracking hand, I realized that the old man needed to rub some balm on his hands."
  },
  {
    "word": "Balmy",
    "meaning": "enjoyable and gentle",
    "examples_0": "The balmy climate immediately improved my spirits.",
    "examples_1": "On a balmy day, teenagers usually flock to the beach."
  },
  {
    "word": "Baloney",
    "meaning": "nonsense",
    "examples_0": "I saw you take the money with my own eyes, that?s baloney.",
    "examples_1": ""
  },
  {
    "word": "Balustrade",
    "meaning": "an attachment to the side of a wall near a set of stairs or a waist-level wall used to prevent people from falling down or over something",
    "examples_0": "Anna firmly held on to the balustrade as she climbed the hundreds of steps to the top of the Eiffel Tower.",
    "examples_1": "Most ships have a steel-enforced balustrade to protect people from falling overboard when they lean over the side to see the water."
  },
  {
    "word": "Bamboozle",
    "meaning": "to cheat or deceive another person",
    "examples_0": "The waiter tried to bamboozle me into giving him extra money by saying the tip had not been included in the check.",
    "examples_1": "If you try and bamboozle the buyer by hiding important details about the property, the real estate contract will become invalid."
  },
  {
    "word": "Ban",
    "meaning": "a ban means to exclude something or someone from a place",
    "examples_0": "There is a ban on cell phone use during the standardized test administered at the university.",
    "examples_1": "Because a tobacco ban is in place, smokers must walk across the street to smoke."
  },
  {
    "word": "Banal",
    "meaning": "boring because it contains nothing new and lacks originality",
    "examples_0": "Because the movie?s plot was banal, we knew exactly how the film would end.",
    "examples_1": "At nearly every meeting, he made that same banal speech."
  },
  {
    "word": "Banausic",
    "meaning": "relating to jobs or workers that require/have technical skills rather than higher education",
    "examples_0": "Mike prefers a banausic job where he can use his hands and get dirty.",
    "examples_1": "My parents wanted me to go to college, but I would rather get a banausic job where I can use my technical skills."
  },
  {
    "word": "Bandwagon",
    "meaning": "a cause or thing that has become trendy or fashionable",
    "examples_0": "Many city residents jumped on the football bandwagon after our local professional team won the national championship.",
    "examples_1": "Before I jump on the politician?s bandwagon, I need to learn more about his views on national affairs."
  },
  {
    "word": "Bandy",
    "meaning": "to exchange words back and forth",
    "examples_0": "The political candidates will bandy during the debate tonight.",
    "examples_1": "In the gym, the two weightlifters bandy about which of them is the stronger athlete."
  },
  {
    "word": "Bane",
    "meaning": "something causing misery or death",
    "examples_0": "Distraction is the bane of productivity when I?m trying to get anything done.",
    "examples_1": "Since loneliness can be the bane of old age, it?s important to maintain friendships and family connections as we grow older."
  },
  {
    "word": "Baneful",
    "meaning": "destructive or harmful",
    "examples_0": "If not cooked properly, the fish can be baneful to humans.",
    "examples_1": "The brutal winds of the tornado are sure to have a baneful effect on the tiny beach homes."
  },
  {
    "word": "Banish",
    "meaning": "to cast out or away",
    "examples_0": "The ghost hunters tried to banish the ghosts from the house.",
    "examples_1": "After the war is over, the king will banish the rebels from his kingdom."
  },
  {
    "word": "Banished",
    "meaning": "sent one away or forced one to leave a place",
    "examples_0": "Since they didn?t support the regime, the family was banished from their country and forced to leave.",
    "examples_1": "Sean banished his sister from his bedroom and refused to let her come inside."
  },
  {
    "word": "Bankrupt",
    "meaning": "declared in law unable to pay debts owed; financially ruined",
    "examples_0": "Even though the woman was bankrupt, she still shopped as if she had plenty of money.",
    "examples_1": "Heavy medical costs from a car accident would bankrupt the injured parties."
  },
  {
    "word": "Banquet",
    "meaning": "a large celebratory meal; a feast",
    "examples_0": "At the end of the football season, the Mavericks held a banquet to recognize the players on the team.",
    "examples_1": "Only mothers and daughters could attend the annual Beautiful Rose banquet held in honor of mothers."
  },
  {
    "word": "Bantam",
    "meaning": "petite-sized chickens; a short and aggressive individual",
    "examples_0": "As the small-statured bantam was quick to grow angry at the site of his flock of bantam roaming outside of his farm, he quickly shooed them into their small pen clucking the whole way.",
    "examples_1": "Looking down at the young bantam quarreling with me again about taking his parking space at work, I realized that I had better move my car."
  },
  {
    "word": "Banter",
    "meaning": "good humored conversation",
    "examples_0": "We need to help shy Sarah perfect her banter with the opposite sex.",
    "examples_1": "After the comedian ended his easy-going banter with the crowd, he thanked everyone for coming to his show."
  },
  {
    "word": "Barb",
    "meaning": "a sharp pointy wire that projects out from a longer wire or hook",
    "examples_0": "When my shirt got snagged on the barb of the wire, it ripped a hole in it as I pulled away from the fence.",
    "examples_1": "As the harmless fish took the worm from the fishing line, the barb stuck the fish in the mouth before being yanked out of the water."
  },
  {
    "word": "Barbarian",
    "meaning": "refers to a person who is considered uncivilized or with no manners",
    "examples_0": "Slopping up his soup and grunting while he ate, the barbarian finished his meal in minutes.",
    "examples_1": "The barbarian warrior led his group of brutes into battle against the other uncivilized nation."
  },
  {
    "word": "Barbaric",
    "meaning": "uncivilized; rude",
    "examples_0": "Because the barbaric moviegoer shouted and threw popcorn at other guests, he was asked to leave.",
    "examples_1": "He did not have many friends because he treated others with a barbaric disdain."
  },
  {
    "word": "Barbarous",
    "meaning": "cruel, brutal",
    "examples_0": "The killer?s barbarous acts disgusted the jury and landed him a lengthy prison sentence.",
    "examples_1": "Although most people supported the soldiers, they couldn?t fathom the cruel and barbarous events that took place during the war."
  },
  {
    "word": "Barbed",
    "meaning": "having sharp pointy wires stick out from a longer wire or hooks",
    "examples_0": "In order to keep the prisoners from escaping, a dangerous barbed wire fence was installed so that the prisoner?s skin would get ripped if an escape attempt was made.",
    "examples_1": "With the barbed crown on her head, people were especially careful when removing it so they would not get injured."
  },
  {
    "word": "Bare",
    "meaning": "naked, uncovered",
    "examples_0": "Jason made a bare handed catch deep in the outfield, which made him cry out in pain.",
    "examples_1": "I walked around the downtown with a red sock on one foot and the other foot bare, creating a funny spectacle."
  },
  {
    "word": "Barefoot",
    "meaning": "without socks or shoes",
    "examples_0": "While on the beach, the couple took off their shoes and went barefoot.",
    "examples_1": "Ariel can?t stand to be barefoot in the house since all of the dirt on the floor tends to stick to her feet."
  },
  {
    "word": "Barely",
    "meaning": "hardly ever; rarely",
    "examples_0": "Although they barely see each other anymore, Bert and Ernie still consider each other best friends.",
    "examples_1": "Beth barely ate any of her pizza but was full off of the few bites she did have."
  },
  {
    "word": "Bargain",
    "meaning": "good deal; surprisingly cheap",
    "examples_0": "I will only shop at the mall when I believe that I can find a bargain deal.",
    "examples_1": "Jack considers himself to be a bargain hunter who knows how to find a good deal."
  },
  {
    "word": "Barge",
    "meaning": "to move in a rough or forceful way",
    "examples_0": "The cops waited in ambush outside Kevin?s door, ready to barge into his home as soon as they received the signal.",
    "examples_1": "I know that Mom will barge into my room when it?s time for dinner and order me to get off of the computer."
  },
  {
    "word": "Barker",
    "meaning": "a person who calls out to passersby to attract customers to a theater or sideshow",
    "examples_0": "The barker stood outside of the carnival entrance, calling out to passersby and inviting them inside.",
    "examples_1": "A persuasive carnival barker is needed to bring in reporters in to cover the show."
  },
  {
    "word": "Barometer",
    "meaning": "something used as an indicator",
    "examples_0": "The unemployment rate has long been considered a barometer of a country?s economic status.",
    "examples_1": "According to the barometer on the kitchen wall, the temperature is below freezing today."
  },
  {
    "word": "Baron",
    "meaning": "a male member of the lowest rank of English nobility",
    "examples_0": "Most of the barons and lords that went up against Arthur, and lost, ended up as his knights and governing heads.",
    "examples_1": ""
  },
  {
    "word": "Baroque",
    "meaning": "having a great deal of decorative embellishment; also referring to a time period in which heavy ornamentation was used in design, music, and art",
    "examples_0": "The elaborate architecture of the baroque dwelling seemed out of place in the neighborhood of simply-designed homes.",
    "examples_1": "Looking through the camera lens, I was captivated by the highly crafted adornments that were a part of the church?s baroque architecture."
  },
  {
    "word": "Barracks",
    "meaning": "lodging quarters in a structure for military troops",
    "examples_0": "After the mission, the soldiers went back to their barracks to get some rest in their bunks and put away their gear.",
    "examples_1": "Once the drill sergeant walked into the barracks, he starting barking commands to his troops to stand at attention."
  },
  {
    "word": "Barrage",
    "meaning": "a large volume of something, or a large quantity of things happening all at once",
    "examples_0": "Even though Mrs. Anderson knew that her students would probably barrage her with whines and complaints, she assigned fifty pages of reading to be done over the holidays.",
    "examples_1": "The attorney asked the reporters not to barrage his client with questions until he had made a statement."
  },
  {
    "word": "Barren",
    "meaning": "(of land) a place with little or no vegetation",
    "examples_0": "Looking out the window of the airplane, I realized that some deserts are actually more barren than others.",
    "examples_1": "After the bomb blast, the land around the area was completely barren."
  },
  {
    "word": "Barren",
    "meaning": "unable to reproduce or grow something",
    "examples_0": "The barren woman could never get over the fact that she couldn?t have children.",
    "examples_1": "After years without any rain, the once flourishing farmland became barren and infertile."
  },
  {
    "word": "Barrette",
    "meaning": "a typically bar-shaped clip or ornament for the hair",
    "examples_0": "She popped open the barrette and tried to clip it around her hair, but it was too thick.",
    "examples_1": "She used the barrette to pin her unruly hair back."
  },
  {
    "word": "Barricade",
    "meaning": "a barrier used to close or block a road",
    "examples_0": "The police set up a barricade to keep the public from entering a crime scene.",
    "examples_1": ""
  },
  {
    "word": "Barrier",
    "meaning": "an obstacle that blocks access",
    "examples_0": "Not having transportation was a barrier to the girl enrolling in college courses.",
    "examples_1": "A fence served as a barrier around the lion?s habitat."
  },
  {
    "word": "Barring",
    "meaning": "excluding a person or something",
    "examples_0": "Barring an injury, the star quarterback will be able to play in Sunday?s big game.",
    "examples_1": "The artist?s exhibit includes all of his works, barring a few pieces on loan to the national museum."
  },
  {
    "word": "Barrister",
    "meaning": "a British lawyer who is allowed to argue cases in the higher law courts",
    "examples_0": "While presenting his case in front of a judge, the barrister explained his client?s position.",
    "examples_1": "Even the barrister did not believe the innocence of his client, but he had to defend him anyway."
  },
  {
    "word": "Barter",
    "meaning": "to make an exchange using something other than a from of currency",
    "examples_0": "Since I do not have any money, I?m hoping I can barter my maid services in exchange for much-needed lawn care.",
    "examples_1": "The homeless man held a sign that suggested he would barter his handyman services for a good meal."
  },
  {
    "word": "Base",
    "meaning": "the bottom section that sustains a bigger item or thing",
    "examples_0": "Below the Statue of Liberty on its base is an inscription welcoming and calling for any immigrants who want to make the United States their home.",
    "examples_1": "While standing at the base of the Washington Monument, the little boy looked high into the sky to see the top of the structure."
  },
  {
    "word": "Baseline",
    "meaning": "a minimum starting point",
    "examples_0": "The children will take a baseline test to determine which skills they have and which are missing.",
    "examples_1": "Although the doctor?s baseline recommendation is 20 minutes of exercise a day, he encouraged the patient to do more than the minimum."
  },
  {
    "word": "Baseness",
    "meaning": "a shortage of positive qualities",
    "examples_0": "The political candidate?s election hopes were dashed when a book was published that detailed the baseness of his college days.",
    "examples_1": "As a teenager, Bill?s baseness was seen in the numerous ways in which he bullied his peers."
  },
  {
    "word": "Bash",
    "meaning": "to strike someone or something with extreme force",
    "examples_0": "I wear protective face gear so that the baseball does not bash me in the face.",
    "examples_1": "The firefighters had to bash the door down to save the trapped elderly man."
  },
  {
    "word": "Bashful",
    "meaning": "shy or easily embarrassed",
    "examples_0": "The bashful student turned red with embarrassment.",
    "examples_1": "I am so bashful that I won?t even leave my house."
  },
  {
    "word": "Basic",
    "meaning": "simple and not complicated",
    "examples_0": "We choose a basic phone package, but may need to upgrade to a better plan.",
    "examples_1": "In basic training, the soldiers learned some of the simplest military tasks."
  },
  {
    "word": "Basin",
    "meaning": "a kitchen sink",
    "examples_0": "My grandparents told us to wash up in the basin before suppertime.",
    "examples_1": "When designing a kitchen for their new home, the couple chose a farmhouse-style basin."
  },
  {
    "word": "Basis",
    "meaning": "foundation, base",
    "examples_0": "The research study had a scientific basis, but also included religious topics.",
    "examples_1": "Making her claim on the basis of fraud, the angered wife hoped to have her husband deported."
  },
  {
    "word": "Bask",
    "meaning": "to obtain joy from receiving praise or attention",
    "examples_0": "After a performance, the singer remains onstage for five minutes to bask in the audience?s adoration.",
    "examples_1": "The author will bask in the attention of his many devotees waiting outside the bookstore."
  },
  {
    "word": "Bass",
    "meaning": "low in pitch, such as a male voice or an instrument",
    "examples_0": "The blues singer let out a low, deep tone with his bass guitar.",
    "examples_1": "Bass instruments are known not for high pitches, but for the deep sounds they produce."
  },
  {
    "word": "Bastion",
    "meaning": "an individual or object dedicated to a belief or idea",
    "examples_0": "In the film, the princess believed the wise old man was her last bastion of hope.",
    "examples_1": "While the library was once a bastion of knowledge through reading, today many libraries spend the majority of their funds on electronic resources."
  },
  {
    "word": "Batch",
    "meaning": "collection, group, or quantity of something made at one time",
    "examples_0": "The homemaker baked a batch of homemade chocolate chip cookies for her family.",
    "examples_1": "Every fruit stand has a batch of apples and several watermelons on display."
  },
  {
    "word": "Bate",
    "meaning": "the action of a hawk beating its wings to attempt a takeoff from its perch",
    "examples_0": "A baby hawk will have to bate furiously to lift its tiny body out of its nest and into the air for the first time.",
    "examples_1": "In falconry, a hawk will bate to take off from the arm of its trainer only when it is commanded to do so."
  },
  {
    "word": "Bathe",
    "meaning": "to clean oneself immersion in water or using water",
    "examples_0": "Bathe with soap and water to wash off dirt and dead skin cells.",
    "examples_1": ""
  },
  {
    "word": "Bathos",
    "meaning": "a sudden change in a style of writing or speech that involves going from a complex or elaborate form to a trivial one, either in topic or wording",
    "examples_0": "With a great deal of bathos, Lenny went from proclaiming his innocence to confessing he'd eaten the last slice of pumpkin pie.",
    "examples_1": "It was pure bathos onstage when the singer switched from singing a classic aria to crooning nursery rhymes."
  },
  {
    "word": "Battalion",
    "meaning": "a military unit that is usually 300 to 800 soldiers, comprised of several companies",
    "examples_0": "A battalion of troops is comprised of many smaller companies, so that they can be divided and deployed around the battlefield as needed.",
    "examples_1": "A general is likely to be in charge of more than one battalion, as he had a very large battlefield to manage and command."
  },
  {
    "word": "Battle",
    "meaning": "a fight or confrontation in which two sides face off",
    "examples_0": "Losing their final battle, the Indians agreed to give up their land and move west.",
    "examples_1": "The audience cheered as the lion and the brave fighter continued their battle."
  },
  {
    "word": "Battlement",
    "meaning": "a wall around the top of a fortress with spaces in it through which the people inside the castle shoot weapons",
    "examples_0": "Behind the castle battlement, the king?s men prepared to fire their arrows at the intruders down below.",
    "examples_1": "The castle tower top has a tooth-shaped battlement that was used as a soldier hideout for centuries."
  },
  {
    "word": "Batty",
    "meaning": "crazy and out of one?s mind",
    "examples_0": "The batty woman walked the streets yelling ?ca-caw? and flapping her arms as if she were a bird.",
    "examples_1": "Although she isn?t really batty, Lucy pretends that she is out of her mind so that she can get a crazy check from the state."
  },
  {
    "word": "Bauble",
    "meaning": "a cheap showy ornament or piece of jewelry",
    "examples_0": "At first I thought that the trinkets sold on the island had value, but I then realized that they were nothing other than worthless bauble.",
    "examples_1": "The haughty Russian tour guide spoke of the Constitution as if it were merely bauble, irritating the Americans in the crowd."
  },
  {
    "word": "Bawdy",
    "meaning": "indecent; obscene",
    "examples_0": "The church is certainly not the place for your bawdy remarks.",
    "examples_1": "With such bawdy language, it is not surprising the novel is not being carried in religious bookstores."
  },
  {
    "word": "Bawl",
    "meaning": "to cry extremely loudly",
    "examples_0": "Even as the spoiled rich girl put on her diamond bracelets, she would bawl about how her parents didn?t love her.",
    "examples_1": "The man didn?t want to sit next to the woman with the baby because he was certain the infant would bawl the entire flight."
  },
  {
    "word": "Bay",
    "meaning": "an inlet by the sea where the land curves inward",
    "examples_0": "Otis Redding was sitting on the dock of the bay, watching the tide roll away.",
    "examples_1": "A bay is smaller and more enclosed than a gulf, but the mouth where It meets the ocean is wider."
  },
  {
    "word": "Bayonet",
    "meaning": "a long knife attached to the end of a rifle",
    "examples_0": "He removed his bayonet from his rifle, and was using it as a combat knife now, since a rifle would be too cumbersome.",
    "examples_1": ""
  },
  {
    "word": "Bayou",
    "meaning": "slow-moving creek or swamp",
    "examples_0": "My cousin wanted to swim in the bayou until I mentioned that there were alligators in the water.",
    "examples_1": "After collecting crawfish from the bayou, my grandmother would boil them for dinner."
  },
  {
    "word": "Bazaar",
    "meaning": "a market (frequently seen in the Middle East) that offers an assortment of items for purchase",
    "examples_0": "While shopping at the bazaar, I found a number of international foods.",
    "examples_1": "The open-air bazaar in Cairo is one of the few places where I can buy my husband?s favorite fish."
  },
  {
    "word": "Beacon",
    "meaning": "a thing or person that provides guidance to people",
    "examples_0": "The lighthouse is a beacon for ships lost in the night.",
    "examples_1": "To many, the church is a beacon that offers hope to lost individuals."
  },
  {
    "word": "Beadle",
    "meaning": "a British term used to refer to a leader of a church who assists the minister or priest in his duties",
    "examples_0": "When Mr. Peterson worked as the church?s beadle, he ran most of the fundraising events for the minister.",
    "examples_1": "The minister asked his beadle to lend a hand during the communion."
  },
  {
    "word": "Beak",
    "meaning": "the hard, pointed part of a bird?s mouth",
    "examples_0": "Tapping the bark with his hard beak, the woodpecker tried to use his bill to break through.",
    "examples_1": "The bird?s long beak was slender enough to reach into the hole and grab the bug."
  },
  {
    "word": "Beam",
    "meaning": "to smile very happily",
    "examples_0": "Once the baby was born, the mother would beam with pride while gazing at the newest member of her family.",
    "examples_1": "When the photographer told the child to say ?cheese,? the girl decided to beam so that you could see almost every single tooth in her mouth."
  },
  {
    "word": "Beamed",
    "meaning": "shined brightly",
    "examples_0": "During the hottest part of the day, the sun beamed down on the garden and scorched the plants with its bright light.",
    "examples_1": "Bright rays beamed from the strobe lights and lit up areas of the dance floor that was once dark."
  },
  {
    "word": "Bear",
    "meaning": "to tolerate or accept something",
    "examples_0": "Michelle couldn?t bear to see her ex-husband with someone else, even years after their divorce.",
    "examples_1": "I couldn?t bear watching my friend get bullied and had to step up to help him."
  },
  {
    "word": "Bearable",
    "meaning": "capable of being endured",
    "examples_0": "The window in my cell made my time in prison bearable.",
    "examples_1": "Without proper hydration, the scorching heat wouldn?t be bearable."
  },
  {
    "word": "Bearing",
    "meaning": "carrying; having; withstanding",
    "examples_0": "Bearing a dark secret, the young girl finally confided in a guidance counselor about the abuse she suffered from her family.",
    "examples_1": "Even though it was over 100 degrees outside, many athletes were bearing the heat in order to complete the race."
  },
  {
    "word": "Beast",
    "meaning": "a large, dangerous animal",
    "examples_0": "The giant beast appeared from behind the cliff and growled a fearsome snarl at the children looking for berries.",
    "examples_1": "Because the massive beast was so hairy and frightening, it scared many hikers out of the woods."
  },
  {
    "word": "Beatific",
    "meaning": "heavenly or blessed",
    "examples_0": "The bride looked angelic and wore a beatific expression as she walked down the aisle.",
    "examples_1": "Because the shrine is considered beatific, locals are very concerned about tourists destroying the purity of the site."
  },
  {
    "word": "Beatitude",
    "meaning": "utmost bliss and happiness",
    "examples_0": "Her beatitude was sparked when her boyfriend proposed.",
    "examples_1": "She expressed her beatitude to her parents for the trip by thanking them ecstatically."
  },
  {
    "word": "Beau",
    "meaning": "a wealthy gentlemen",
    "examples_0": "The dapper beau always dressed in his fine silk shirt, high-quality suit and a red carnation stuck in his lapel before walking outside.",
    "examples_1": "The young beau walked with his cane as a symbol of upper class and would periodically look at his pocket watch for the time."
  },
  {
    "word": "Beaucoup",
    "meaning": "many; a great number",
    "examples_0": "The successful salesman made beaucoup money hawking thousands of cheap vehicles to unsuspecting customers.",
    "examples_1": "You can tell by the woman?s catlike face that she has undergone beaucoup plastic surgery procedures over the years."
  },
  {
    "word": "Beauteous",
    "meaning": "beautiful",
    "examples_0": "My beauteous bride glimmered in her stunning white gown, as she stood under our wedding canopy.",
    "examples_1": "Spot is a beauteous dog that is always admired for his intensely blue eyes."
  },
  {
    "word": "Beautify",
    "meaning": "to make beautiful, or to increase the beauty of",
    "examples_0": "To beautify the earth, citizens need to keep the grounds clean.",
    "examples_1": "I enjoy flipping a house for both the money and the fact that I get to beautify a house."
  },
  {
    "word": "Beauty",
    "meaning": "the quality of being pleasing to look at because of shape, color, sound or other sensory aspects",
    "examples_0": "Impressed by her beauty, the man knew that he had to marry the gorgeous woman at first sight.",
    "examples_1": "Impressed by her beauty, the man knew that he had to marry the gorgeous woman at first sight."
  },
  {
    "word": "Beck",
    "meaning": "a stream that moves from a mountain",
    "examples_0": "Water flowed swiftly over the stony bed of the beck and emptied into a larger stream at the mountain?s edge.",
    "examples_1": "The flow of the beck isn?t as strong as the river, but the fast-moving stream is robust enough to move small things."
  },
  {
    "word": "Beckon",
    "meaning": "to motion for an individual to come closer",
    "examples_0": "Because I was hungry, the restaurant seemed to beckon to me.",
    "examples_1": "The woman at the bar will beckon you over if she?s interested in getting to know you better."
  },
  {
    "word": "Bedfellow",
    "meaning": "an ally or associate connected to a person through a particular activity",
    "examples_0": "Anthony became a bedfellow of Jared when they both joined the same fraternity.",
    "examples_1": "As the soldiers? bedfellow, the close ally depended on his other troop members for support."
  },
  {
    "word": "Bedizen",
    "meaning": "to be adorned in tawdry or loud clothing",
    "examples_0": "Due to the girl wanting attention, she decided to be bedizen herself with her brightly colored rhinestone jacket.",
    "examples_1": "Since the mother didn?t have any taste in fashion, she would frequently bedizen her young daughter in red and blue plaid pants with a yellow polka dot shirt."
  },
  {
    "word": "Bedlam",
    "meaning": "a condition of chaos",
    "examples_0": "Bedlam appeared to reign in the overcrowded school cafeteria.",
    "examples_1": "When the team won the championship the fans ran onto the court, and bedlam ensued."
  },
  {
    "word": "Bedraggled",
    "meaning": "messy and filthy",
    "examples_0": "The neglected puppy was bedraggled and near-death.",
    "examples_1": "Once the bedraggled homeless man gets a hot shower and a warm meal, he will be a new man."
  },
  {
    "word": "Bedrock",
    "meaning": "solid rock that is under the soil",
    "examples_0": "In areas where soil is scarce, solid bedrock lies right under the surface.",
    "examples_1": "Large stretches of bedrock stop plants from taking root in the front yard."
  },
  {
    "word": "Befall",
    "meaning": "to occur or happen to a person",
    "examples_0": "If anything bad should befall me, I leave all my possessions to my loving husband.",
    "examples_1": "Ted could not conquer his paranoia and constantly waited for something bad to befall him."
  },
  {
    "word": "Befitting",
    "meaning": "suitable",
    "examples_0": "Many people do not believe short dresses are befitting for women over the age of forty.",
    "examples_1": "In my opinion, there is no cheeseburger befitting a fifty-dollar price tag."
  },
  {
    "word": "Beforehand",
    "meaning": "earlier or previously",
    "examples_0": "Without looking down the road beforehand, the young boy quickly darted out into the street getting hit by a car.",
    "examples_1": "Preparing for the flood beforehand by placing sandbags around the lake allowed the citizens and their homes to be safe when the rains started to fall."
  },
  {
    "word": "Befriend",
    "meaning": "to become a person?s pal or friend",
    "examples_0": "In an effort to befriend me, my rival offered to treat me to lunch.",
    "examples_1": "The reporter is willing to befriend the actor in order to get an interview."
  },
  {
    "word": "Befuddled",
    "meaning": "puzzled; baffled",
    "examples_0": "Even with my professor?s help, I was still befuddled by the complicated chemistry formula.",
    "examples_1": "The befuddled old man could not remember where he lived."
  },
  {
    "word": "Beget",
    "meaning": "to cause (something) to happen or exist",
    "examples_0": "In my dysfunctional family, fighting never failed to beget more fighting.",
    "examples_1": "High levels of unemployment often beget high levels of crime."
  },
  {
    "word": "Beggar",
    "meaning": "a person who begs for money or food due to extreme poverty",
    "examples_0": "The homeless beggar stands outside of stores in hopes of receiving money from patrons.",
    "examples_1": ""
  },
  {
    "word": "Beginner",
    "meaning": "a person just learning a skill or activity",
    "examples_0": "The beginner bowler only knocked a couple of pins down during his first few games.",
    "examples_1": "Though she is just a beginner, Khloe is a great Italian cook."
  },
  {
    "word": "Begrudge",
    "meaning": "to be envious of what one feels another does not deserve",
    "examples_0": "It is impossible for me to not begrudge my neighbor of the ten million dollars he won in the lottery.",
    "examples_1": "Although Jane did not complete enough work to earn the bonus, she still had the nerve to begrudge Heather?s reward."
  },
  {
    "word": "Beguile",
    "meaning": "to attract or interest someone",
    "examples_0": "The car salesman tried to beguile the customer with an offer of free gas for a year.",
    "examples_1": "Because Sarah knows she is beautiful, she often tries to beguile wealthy men with her looks."
  },
  {
    "word": "Begun",
    "meaning": "started",
    "examples_0": "Right after the baby begun to cry, her mother came running into her room.",
    "examples_1": "The donut shop had just begun making another batch of donuts when the breakfast rush came through."
  },
  {
    "word": "Behalf",
    "meaning": "representative of",
    "examples_0": "The director accepted the award on behalf of the entire cast.",
    "examples_1": "Appearing on behalf of his client, the attorney asked the judge for a continuance."
  },
  {
    "word": "Behavior",
    "meaning": "conduct",
    "examples_0": "Explaining that his behavior was unacceptable, the teacher corrected the misbehaving student and placed him in time out.",
    "examples_1": "Rewards for good behavior helped the wayward child begin to make better decisions."
  },
  {
    "word": "Behemoth",
    "meaning": "gigantic and very powerful",
    "examples_0": "The monster truck rally showcased a behemoth whose tires were twice as tall as I am.",
    "examples_1": "Because he is a very large dog, people like to call my Great Dane a behemoth."
  },
  {
    "word": "Behest",
    "meaning": "a request of great importance",
    "examples_0": "At the president?s behest, the prisoner will be pardoned for his crimes.",
    "examples_1": "The low calorie version of the beer was developed at the behest of weight conscious individuals."
  },
  {
    "word": "Behold",
    "meaning": "to see, or to look at",
    "examples_0": "Watching the fight at the arena was a sight to behold.",
    "examples_1": "When I arrived home early, I was shocked to behold a thief attempting to break into my house."
  },
  {
    "word": "Beholden",
    "meaning": "owing something in return for service or help",
    "examples_0": "Stan refused to accept a college loan because he didn?t want to feel beholden to anyone.",
    "examples_1": "Since Kevin is the company?s president, he feels beholden to his employees and works hard to ensure they are treated fairly."
  },
  {
    "word": "Behoof",
    "meaning": "benefit or advantage",
    "examples_0": "A parent forces their child to eat the vegetables they don?t like to behoof them, so they can grow up strong and healthy.",
    "examples_1": "For the behoof of the entire community, the mayor is looking to pave that road on the outskirts of town that is in poor repair."
  },
  {
    "word": "Behoove",
    "meaning": "in an individual?s interest",
    "examples_0": "If you seriously want to get your driving permit, it would behoove you to start studying for the computer test.",
    "examples_1": "It would behoove my husband to take his medication as his doctor instructed."
  },
  {
    "word": "Belabor",
    "meaning": "to emphasize an idea or suggestion too much in a way that becomes boring or annoying; to go on and on about something",
    "examples_0": "If you?re just going to continue to belabor the point, I?m going home.",
    "examples_1": "If the author hadn?t taken up so much space to belabor his viewpoint on the politics of the time, the novel would have been shorter and easier to read."
  },
  {
    "word": "Belated",
    "meaning": "occurring past the regular time period",
    "examples_0": "Since I forgot about Jim?s birthday last week, I will send him a belated greeting today.",
    "examples_1": "Mark and Janet will have a belated honeymoon when Mark finishes his tour of duty in Afghanistan."
  },
  {
    "word": "Belay",
    "meaning": "tying a rope to an object to to keep it steady or down. occassionally used to reference climbers who tie ropes to rocks to belay down the mountainside",
    "examples_0": "The teenagers belay their surfboards to the top of the car with bungee cords before heading to the beach.",
    "examples_1": "People are instructed to belay any heavy objects that could fly off of the back of their truck with rope."
  },
  {
    "word": "Beleaguer",
    "meaning": "to cause constant or repeated trouble for",
    "examples_0": "On Halloween, I know the little trick-or-treaters are going to beleaguer me all night long.",
    "examples_1": "Jane?s ex-husband tries to beleaguer her by intentionally mailing her child support payments late."
  },
  {
    "word": "Belfry",
    "meaning": "a bell tower attached to the top of a church or other building",
    "examples_0": "The Hunchback of Notre Dame lived at the top of the belfry, preferring to be with bats and bells.",
    "examples_1": "After climbing to the top of the monastery?s belfry, the monk rang the prayer bell twice."
  },
  {
    "word": "Belie",
    "meaning": "to give a false impression of",
    "examples_0": "Jason tried to belie the fact he was a lousy worker by showing up early at the office.",
    "examples_1": "In an attempt to belie the vehicle?s high mileage, the car salesman turned back the speedometer on the car."
  },
  {
    "word": "Belief",
    "meaning": "the feeling of being certain that something exists or is true",
    "examples_0": "It was the police officer?s belief that a serial killer was in the area, mainly because the murders kept happening.",
    "examples_1": "The young girl held on to her belief in unicorn?s, even when everyone else told her they didn?t exist."
  },
  {
    "word": "Believe",
    "meaning": "to consider something to be true; to have confidence or trust in something",
    "examples_0": "The boy doesn?t believe in monsters, but his little brother thinks that they are real.",
    "examples_1": "Mike?s teacher didn?t believe him when he said his dog ate his homework for the fourth time this month."
  },
  {
    "word": "Belittle",
    "meaning": "to speak of something or someone in unflattering terms",
    "examples_0": "Even though John?s project was awful, I did not want to belittle his efforts so I went out of my way to pay him a compliment on his work.",
    "examples_1": "Rick is so conceited he tries to belittle his wife when she offers an opinion that differs from his viewpoint."
  },
  {
    "word": "Bell curve",
    "meaning": "a graph that represents the distribution of probabilities of a set of data in a bell-shaped pattern",
    "examples_0": "The student plugged all of the data into a bell curve and used the graph to display his findings.",
    "examples_1": "Because the manager needed a way to organize all of the probabilities, he created a bell curve with the information."
  },
  {
    "word": "Bellhop",
    "meaning": "a hotel worker who performs tasks like carrying luggage for guests",
    "examples_0": "The bellhop stood at the entrance of the hotel and opened the door for all incoming guests.",
    "examples_1": "After the lodgers arrived at the inn, the bellhop helped carry all of their luggage to room 212."
  },
  {
    "word": "Bellicose",
    "meaning": "demonstrating aggression and willingness to fight; eager for war",
    "examples_0": "Don't cop that bellicose attitude with your mother!",
    "examples_1": "John had a bellicose personality which made him a fierce competitor during wrestling competitions."
  },
  {
    "word": "Belligerent",
    "meaning": "hostile; ready to fight",
    "examples_0": "My brother was always belligerent and ready to fight.",
    "examples_1": "While the members of the president?s cabinet wanted him to take a belligerent stance against a neighboring country, the president sought a peaceful compromise."
  },
  {
    "word": "Bellow",
    "meaning": "a low and roaring sound",
    "examples_0": "Since the medic did not have anesthesia, he expected to hear a loud bellow as he removed the bullet from the soldier.",
    "examples_1": "The man gave a fierce bellow before he lunged at his opponent."
  },
  {
    "word": "Bellwether",
    "meaning": "something or someone that points out upcoming trends",
    "examples_0": "At his brokerage firm, Ted is known as the bellwether because he always knows which stocks will become profitable.",
    "examples_1": "The critic?s movie picks win many awards, and as such, are seen as a bellwether for the Academy Awards? ?Best Picture? nominations."
  },
  {
    "word": "Belong",
    "meaning": "be the property of",
    "examples_0": "The dogs wear tags that show what families they belong to.",
    "examples_1": "There are several things that belong to people who visited the airport in the lost and found bin."
  },
  {
    "word": "Beloved",
    "meaning": "describing someone who is much loved",
    "examples_0": "When the beloved actor died, his passing was mourned by millions of people.",
    "examples_1": "People came out in droves to protest the demolition of one of the city?s most beloved churches."
  },
  {
    "word": "Below",
    "meaning": "underneath; on a lower level",
    "examples_0": "The descending ship began to sink below the surface after running into the side of the shore.",
    "examples_1": "Girls who attend the school must wear dresses that fall right below the knee."
  },
  {
    "word": "Bemoan",
    "meaning": "to express displeasure",
    "examples_0": "As a military wife, I bemoan our country?s involvement in yet another war.",
    "examples_1": "Jack started to bemoan his daughter?s unusual behavior."
  },
  {
    "word": "Bemused",
    "meaning": "preoccupied or lost in thought",
    "examples_0": "After listening to the confusing lecture, the college girl was bemused.",
    "examples_1": "When reading, the librarian usually wore a bemused expression on her face."
  },
  {
    "word": "Bench",
    "meaning": "to take a player out of a game",
    "examples_0": "Kevin knew that his basketball coach would bench him after the physical altercation with the rival?s top player.",
    "examples_1": "After Coach Finley decided to bench his star player, the coach wiped his forehead and sent in his rookie as a substitute."
  },
  {
    "word": "Benchmark",
    "meaning": "a standard or target",
    "examples_0": "Setting a testing benchmark for all students, administration insisted that teachers push their children towards this target.",
    "examples_1": "The talented athlete was able to blow past every benchmark set by his coach."
  },
  {
    "word": "Benedict",
    "meaning": "a man who was a bachelor for an extended period of time, but has recently married",
    "examples_0": "After living years as a single man, the benedict has now settled into married life with his new bride.",
    "examples_1": "Most people thought Benji would never marry and was surprised when the benedict showed with his new bride."
  },
  {
    "word": "Benediction",
    "meaning": "a brief prayer asking for a blessing or help",
    "examples_0": "In the hospital chapel, we said a benediction asking God to heal our mother.",
    "examples_1": "The priest made a benediction of blessings for the newly baptized infant."
  },
  {
    "word": "Benefaction",
    "meaning": "a distributed donation",
    "examples_0": "The billionaire?s generous donation will allow us to build a new homeless shelter.",
    "examples_1": "Because of a benefaction from a local church, the hardworking graduate can now attend college."
  },
  {
    "word": "Benefactor",
    "meaning": "someone who helps another person, group, etc., by giving money",
    "examples_0": "The anonymous benefactor did not want his church donation made public.",
    "examples_1": "After the university received ten million dollars from a benefactor, it was able to add a new branch to the library."
  },
  {
    "word": "Beneficent",
    "meaning": "prone to doing kind and generous things",
    "examples_0": "My beneficent neighbor gives out meals to the poor every Sunday.",
    "examples_1": "In an attempt to look beneficent, the selfish millionaire hired a photographer to take pictures of him standing outside a homeless shelter."
  },
  {
    "word": "Beneficial",
    "meaning": "helpful or good to something or someone",
    "examples_0": "The vitamins he took were beneficial to his health.",
    "examples_1": "Ultimately, it helps if the agreement you make is beneficial to both parties."
  },
  {
    "word": "Beneficiary",
    "meaning": "a group or individual that gains something",
    "examples_0": "As the billionaire?s only beneficiary, Cheryl will receive the entire estate.",
    "examples_1": "My husband has listed me as the beneficiary of his life insurance policy."
  },
  {
    "word": "Benefit",
    "meaning": "a payment, advantage, or gift",
    "examples_0": "Since I get sick a lot, my health insurance is one work-related benefit I really appreciate.",
    "examples_1": "A healthy skin tone is a benefit that comes from exposure to sunlight."
  },
  {
    "word": "Benevolence",
    "meaning": "kindness; generous giving",
    "examples_0": "Because of the benevolence of their neighbors, the poor family was able to eat a homecooked meal every night.",
    "examples_1": "The homeless man depended on the benevolence of the good and gave souls that he met in the street."
  },
  {
    "word": "Benevolent",
    "meaning": "willing to help, do good, and be generous towards people",
    "examples_0": "Holding the door open for Marie was very benevolent of you.",
    "examples_1": "She was a benevolent woman, volunteering all of her free time to charitable organizations."
  },
  {
    "word": "Benighted",
    "meaning": "lacking knowledge",
    "examples_0": "Plantation owners viewed slaves as benighted animals who had to be told what to do at every moment.",
    "examples_1": "In today?s world, high school dropouts are seen as benighted individuals fit only for menial jobs."
  },
  {
    "word": "Benign",
    "meaning": "having no significant effect; harmless",
    "examples_0": "When the doctor said my tumor was benign, I was so happy.",
    "examples_1": "The medicine is benign in its effects and will cause you no harm."
  },
  {
    "word": "Benignant",
    "meaning": "kind and goodhearted",
    "examples_0": "The benignant teacher volunteered her time, spreading kindness to everyone she met.",
    "examples_1": "Our benignant and charitable vet volunteers his time caring for animals free of charge."
  },
  {
    "word": "Benignity",
    "meaning": "the trait of being gentle and nice",
    "examples_0": "Jared?s benignity makes him too nice and allows him to be an easy target for con artists.",
    "examples_1": "While some people doubt the billionaire?s benignity, others know of his generous acts to people in need."
  },
  {
    "word": "Benison",
    "meaning": "a blessing",
    "examples_0": "Karen asked her friend to say a benison while standing over the Thanksgiving dinner with her large family.",
    "examples_1": "Every minister of each church said a benison in memory of the victims of a tragic train accident."
  },
  {
    "word": "Bent",
    "meaning": "the state of being curved, crooked, or inclined from a straight line",
    "examples_0": "Molly was bent over, drinking from the water fountain.",
    "examples_1": ""
  },
  {
    "word": "Bequeath",
    "meaning": "to give or leave by will",
    "examples_0": "Since my father and I had often worked together on his classic car, I was not surprised to learn his will included his desire to bequeath me the vehicle.",
    "examples_1": "The billionaire?s will states that he plans to bequeath all of his fortune to his butler."
  },
  {
    "word": "Bequest",
    "meaning": "property or money gifted after an individual?s death",
    "examples_0": "With the bequest from the deceased billionaire, the school was able to build a new dormitory.",
    "examples_1": "In her will, my aunt left me a bequest of a valuable painting."
  },
  {
    "word": "Berate",
    "meaning": "to yell at; to criticize or scold someone in a loud and angry way",
    "examples_0": "Shamefaced, the students sat quietly as Mrs. Garcia continued to berate them for the way they had treated the substitute.",
    "examples_1": "Because the bailiff had brought the message that the jury could not reach a decision, the judge called them into the courtroom to berate them about how a hung jury was a waste of taxpayers? money."
  },
  {
    "word": "Bereave",
    "meaning": "to take away something",
    "examples_0": "My grandfather?s death is sure to bereave my grandmother of her happiness.",
    "examples_1": "Because Ted was severely depressed, he chose to bereave himself of companionship so no one would comment upon his misery."
  },
  {
    "word": "Bereaved",
    "meaning": "depressed as a result of a loved one?s death",
    "examples_0": "The bereaved mother did not leave her home for several months.",
    "examples_1": "When Cheryl committed suicide, her husband was so bereaved he thought about taking his own life."
  },
  {
    "word": "Bereavement",
    "meaning": "the mental state which occurs after someone has suffered a loss, usually a death",
    "examples_0": "When the principal died suddenly, the school district hired a bereavement counselor to help the students deal with their emotions.",
    "examples_1": "Ann endured a long period of bereavement after her husband died."
  },
  {
    "word": "Bereft",
    "meaning": "deprived",
    "examples_0": "When my husband died, I felt bereft of love and hope.",
    "examples_1": "The car accident left Jeremiah bereft of the ability to move because of a spinal cord injury."
  },
  {
    "word": "Beret",
    "meaning": "a type of round brimless cap; headgear",
    "examples_0": "The green beret is a symbol of commitment and sacrifice to the brave men who challenged themselves to be the best of the best in the U.S. Army Special Forces.",
    "examples_1": ""
  },
  {
    "word": "Berry",
    "meaning": "a small succulent fruit; of any one of many varieties",
    "examples_0": "Every summer we'd pluck berries from a berry tree and make jam.",
    "examples_1": ""
  },
  {
    "word": "Berserk",
    "meaning": "out of control with high emotions; wild",
    "examples_0": "Jimmy went totally berserk when Sandra told him that she was breaking off their engagement.",
    "examples_1": "The berserk animal began running around our yard, slamming itself against the windows."
  },
  {
    "word": "Beseech",
    "meaning": "to ask someone for something in an urgent and sincere way",
    "examples_0": "As soon as I reach the driving age, I will beseech my parents to buy me a car.",
    "examples_1": "Because we were trying to sleep, my husband went out of his way to beseech our neighbor to turn down his loud music."
  },
  {
    "word": "Beset",
    "meaning": "to surround or attack from all sides",
    "examples_0": "The expectant mother was beset with a new set of anxieties every time she heard some of her friends? stories about childbirth.",
    "examples_1": "The company was beset by a flood of lawsuits after their new invention led to injuries among hundreds of their customers."
  },
  {
    "word": "Besiege",
    "meaning": "to approach with an excessive number of requests or questions",
    "examples_0": "The journalists will besiege the police chief with questions about the prisoner?s escape.",
    "examples_1": "On Black Friday, customers will besiege store employees with thousands of product requests."
  },
  {
    "word": "Besmirch",
    "meaning": "to smear an individual?s reputation or character",
    "examples_0": "The woman?s adultery accusation is sure to besmirch the married politician?s reputation.",
    "examples_1": "Because Gail wanted her supervisor?s job, she did everything in her power to besmirch the woman?s character."
  },
  {
    "word": "Besot",
    "meaning": "to cause someone look silly or foolish, especially by drinking",
    "examples_0": "The huge glass of liquor besot the drunkard, causing him to dance on the bar and make stupid jokes.",
    "examples_1": "Because the alcoholic concoction was strong enough to besot those who consumed it, several partygoers began to make fools of themselves."
  },
  {
    "word": "Besotted",
    "meaning": "strongly infatuated or obsessed",
    "examples_0": "The besotted mother treated her child like a princess, despite the fact that she risked spoiling her.",
    "examples_1": "Tim is a besotted basketball fan who dreams of playing for the Knicks."
  },
  {
    "word": "Bespeak",
    "meaning": "suggest; indicate",
    "examples_0": "Thousands of homeless old-timers in the city might bespeak a larger scale problem with our national veteran services.",
    "examples_1": "The whimsical objects displayed at the gallery bespeak an up and coming artist with a lot of talent."
  },
  {
    "word": "Bespoke",
    "meaning": "individually or custom made",
    "examples_0": "Jack is a master tailor who creates bespoke suits.",
    "examples_1": "Our company produces its bespoke jeans from Japanese denim."
  },
  {
    "word": "Bestial",
    "meaning": "like a wild animal or beast, exceptionally violent and cruel",
    "examples_0": "At the movie?s conclusion, there was a bestial scene that ended with the beheading of the bad guy.",
    "examples_1": "The boy who was raised by wolves displays bestial behavior."
  },
  {
    "word": "Bestow",
    "meaning": "to give as a tribute or gift",
    "examples_0": "During the ceremony, the prime minister will bestow medals of honor to the brave soldiers who rescued their comrades.",
    "examples_1": "The king will bestow a title and land to the man who saved the princess."
  },
  {
    "word": "Bestowal",
    "meaning": "to freely give something as a gift",
    "examples_0": "Mr. Markham?s bestowal of such high dowries to his 10 daughters was a surprise to everyone because for years they believed him penniless.",
    "examples_1": "The bestowal of food, shelter, and clothing to the homeless took place everyday Sunday at the local church."
  },
  {
    "word": "Bestowed",
    "meaning": "presented with",
    "examples_0": "The queen bestowed a title upon the man who saved her life.",
    "examples_1": "During last night?s film ceremony, the Academy bestowed an honorary Oscar to the deceased composer."
  },
  {
    "word": "Bestride",
    "meaning": "to sit with legs on both sides of something",
    "examples_0": "After mounting, the children over six years old would bestride the horse.",
    "examples_1": "Cowboys bestride the fence looking down the rail and out over the land."
  },
  {
    "word": "Bet",
    "meaning": "to risk something against another person on the outcome of a future event",
    "examples_0": "I am going to bet fifty dollars against my friend that it is going to snow today, while he is betting fifty that it will not.",
    "examples_1": "It is considered risky to bet money on anything unless you are sure that what you are betting on is guaranteed to pass."
  },
  {
    "word": "Betide",
    "meaning": "to occur or happen to; befall",
    "examples_0": "Because Kurt and I love each other we know our marriage will last, whatever may betide while he is stationed overseas in the military.",
    "examples_1": "Woe betide the student who stole Mrs. Pitts? laptop because she will not rest until she finds the culprit."
  },
  {
    "word": "Betoken",
    "meaning": "indicate or specify",
    "examples_0": "In college, a sock wrapped around the door knob serves to betoken a roommate has a guest and does not wish to be disturbed.",
    "examples_1": "The flashing of the buttons on the console does indeed betoken the need for new batteries in the unit."
  },
  {
    "word": "Betray",
    "meaning": "expose (one's country, a group, or a person) to danger by treacherously giving information to an enemy",
    "examples_0": "Harry decided to betray his country and spy for the enemy, despite all that America had done for him.",
    "examples_1": "The soldiers dismissed the idea that their commander would betray them to the enemy."
  },
  {
    "word": "Betrothed",
    "meaning": "the person to whom one is engaged",
    "examples_0": "I must remain faithful to my betrothed and ignore the flirtations of the handsome man at the bar.",
    "examples_1": "Since my betrothed was killed in the war, I have no marital prospects."
  },
  {
    "word": "Betterment",
    "meaning": "the process of improving something and making it better",
    "examples_0": "The teacher put in long hours of after school tutoring for the betterment of her students.",
    "examples_1": "Focusing on the betterment of her son?s life, the mother worked two jobs to send him to private school."
  },
  {
    "word": "Between",
    "meaning": "at, into, or across the space separating two objects or regions",
    "examples_0": "She hid her love letters between the pages of her favorite book.",
    "examples_1": "The ketchup was wedged on the bottom shelf between the mustard and the mayonnaise."
  },
  {
    "word": "Betwixt",
    "meaning": "between, specifically between two objects",
    "examples_0": "Steven shaved off the hair betwixt his nose and upper lip, otherwise known as the mustache.",
    "examples_1": "Caught betwixt and between adulthood and childhood, the adolescence years can be quite confusing."
  },
  {
    "word": "Bevel",
    "meaning": "to create a sloping surface or edge",
    "examples_0": "The carpenter will bevel the roof so that it slopes down slightly on both sides.",
    "examples_1": "If you bevel the sides of the frame, the sloping surface will stop rain from pooling on top."
  },
  {
    "word": "Bevy",
    "meaning": "a sizable group of things or individuals",
    "examples_0": "In hopes of receiving a bevy of presents, Hank invited a lot of people to his birthday party.",
    "examples_1": "My essay grade was low because I had a bevy of mistakes in my paper."
  },
  {
    "word": "Bewail",
    "meaning": "expressing extreme sorrow by crying or complaining",
    "examples_0": "During lunch Matt took the opportunity to bewail the incompetence of his office mates.",
    "examples_1": "The employees are sure to bewail the extended Sunday business hours."
  },
  {
    "word": "Beware",
    "meaning": "to use caution, pay attention to",
    "examples_0": "Beware of falling rocks from the top of the mountain.",
    "examples_1": ""
  },
  {
    "word": "Bewildered",
    "meaning": "puzzled or confused",
    "examples_0": "Jason was bewildered by the strange noises coming from his neighbor?s house.",
    "examples_1": "When the soldier woke up after being frozen for sixty years, he was bewildered by all the changes in the world."
  },
  {
    "word": "Bewilderment",
    "meaning": "the circumstance of being in a puzzled state",
    "examples_0": "I stared in bewilderment at the cat and dog dancing together.",
    "examples_1": "To the bewilderment of her parents, Ann wanted to have a sex change operation."
  },
  {
    "word": "Bewitched",
    "meaning": "to cast a magical spell on someone",
    "examples_0": "Evil witches bewitched the children and ate them for lunch once they were under their spell.",
    "examples_1": "The wicked siren bewitched the sailor with her song and lured him into the sea."
  },
  {
    "word": "Beyond",
    "meaning": "past a specified point",
    "examples_0": "The prisoners couldn't see beyond the barbed wire fence that surrounded their compound.",
    "examples_1": "Scientists estimate that there are entire galaxies and alien life forms light years beyond our solar system, but we don't yet have the technology to prove it."
  },
  {
    "word": "Bias",
    "meaning": "prejudice favoring a person, thing or group, most often in a way thought to be unfair",
    "examples_0": "After a long court battle, the firm was found guilty of showing bias against females in its promotion practices.",
    "examples_1": "Your bias against male nannies is causing you to ignore the best caregiving option for your infant."
  },
  {
    "word": "Bib",
    "meaning": "a piece of cloth or plastic fitted around the neck of a person to prevent food from getting on their clothes while they eat, typically used for babies",
    "examples_0": "Because babies are such messy eaters, we often tie a bib around their neck to catch any of the food they drop form their mouths or hands.",
    "examples_1": "We often imagine babies wearing a bib around their neck when they eat, but kids that young usually make a mess anyway."
  },
  {
    "word": "Bibliography",
    "meaning": "a list of the works referred to in a scholarly piece, usually at the end in the form of an appendix",
    "examples_0": "Most English teachers require you to have a bibliography with your research paper, giving proof of where you got all of your information.",
    "examples_1": "When you create a bibliography for an academic paper, you have to list every book you used in your research."
  },
  {
    "word": "Bibliophile",
    "meaning": "an individual with a huge passion for books",
    "examples_0": "Jason is a bibliophile who reads at least four books every day.",
    "examples_1": "Because Amanda is a known bibliophile, she did not surprise anyone when she chose library science as her major."
  },
  {
    "word": "Bibulous",
    "meaning": "related to alcohol consumption",
    "examples_0": "After a bibulous night of barhopping, Gail wasn?t in a condition to drive home.",
    "examples_1": "The bibulous teenager tried to hide his drinking problem from his parents."
  },
  {
    "word": "Bicameral",
    "meaning": "having two distinct compartments or chambers",
    "examples_0": "The legislative portion of the United Sates government is bicameral and consists of two bodies of lawmakers, senators and representatives.",
    "examples_1": "In order to get this bill passed, it will require bicameral approval from both houses of Congress."
  },
  {
    "word": "Bicentennial",
    "meaning": "taking place every two hundred years",
    "examples_0": "The bicentennial of the war marks two hundred years since the conflict.",
    "examples_1": "During the bicentennial event, the country will celebrate two hundred years of independence."
  },
  {
    "word": "Bicker",
    "meaning": "to argue about inconsequential or unimportant things",
    "examples_0": "Young children are more likely to bicker about things that really don?t matter, such as who gets to play with a certain toy or who gets to ride in the front seat of the car.",
    "examples_1": "Even adults are prone to bicker about petty things, especially over the internet where there is no one to truly reprimand them for it."
  },
  {
    "word": "Bid",
    "meaning": "to put in an offer to buy something, especially at an auction",
    "examples_0": "At the auction, the dealer bid on several different vehicles that were for sale.",
    "examples_1": "Buyers were allowed to bid on the storage units for several minutes before a final offer was accepted."
  },
  {
    "word": "Bidet",
    "meaning": "a low oval basin used for washing one's genital",
    "examples_0": "The restroom had a toilet as well as a bidet that was used to clean oneself after using the bathroom.",
    "examples_1": "Because the low-lying basin resembled a bidet, many people mistakenly thought it was used to wash off one?s private parts."
  },
  {
    "word": "Biennial",
    "meaning": "taking place in two year intervals",
    "examples_0": "The biennial picnic is scheduled to be held in two years.",
    "examples_1": "Every two years, the scholarship fund receives a biennial donation from the local plant."
  },
  {
    "word": "Bier",
    "meaning": "a frame on which a dead body or a coffin is carried before a funeral",
    "examples_0": "The funeral director placed the corpse on the bier and had the burial frame moved to the cemetery.",
    "examples_1": "Before the coffin can be put into the ground, it must be carried to the graveyard using a wooden bier."
  },
  {
    "word": "Bifurcate",
    "meaning": "divided or forked into two",
    "examples_0": "If citizens are worried about a government having too much power, a bifurcate government would allow one branch to check the other branch",
    "examples_1": "The bifurcate system limited the control for the company so that both departments helped control each other."
  },
  {
    "word": "Big",
    "meaning": "of considerable size, extent, or intensity",
    "examples_0": "Sometimes the world felt so big and she was just a tiny speck on the surface of the planet.",
    "examples_1": "The extra large pizza was so big that it nearly covered the entire table."
  },
  {
    "word": "Bigamy",
    "meaning": "the practice of having two spouses at the same time",
    "examples_0": "Alan was charged with bigamy after the police discovered he was married to two women.",
    "examples_1": "In the movie, the main character must deal with the consequences of bigamy when his two wives become best friends."
  },
  {
    "word": "Bigly",
    "meaning": "with great force, strongly",
    "examples_0": "Attacking bigly, David was able to defeat Goliath with a single shot.",
    "examples_1": "The chief protested his firing bigly and refused to go down without a fight."
  },
  {
    "word": "Bigot",
    "meaning": "a person who is obstinately or intolerantly devoted to his or her own opinions and prejudices",
    "examples_0": "The bigot was a lonely old man who thought everyone was inferior to him.",
    "examples_1": "Because Helen is very close-minded, many people consider her to be a bigot."
  },
  {
    "word": "Bilateral",
    "meaning": "relating to both sides",
    "examples_0": "When Angie learned about her family history of breast cancer, she decided to have both her breasts removed in a bilateral mastectomy.",
    "examples_1": "The treaty will not be signed if the two countries cannot reach a bilateral agreement."
  },
  {
    "word": "Bilingual",
    "meaning": "having the ability to speak two languages",
    "examples_0": "Because Debra is a bilingual, she is often chosen to translate between English and Spanish speakers.",
    "examples_1": "As a bilingual, Fred hopes that his children will also master a second language."
  },
  {
    "word": "Bilious",
    "meaning": "annoyed; bad-tempered",
    "examples_0": "Our bilious neighbor is known for his bad attitude.",
    "examples_1": "Because the dog was afraid of its bilious owner, it often hid when it was called."
  },
  {
    "word": "Bilk",
    "meaning": "defraud, cheat",
    "examples_0": "Because he has always been so anti-government, he constantly accuses the President and Congress of trying to bilk tax-payers out of their hard-earned cash.",
    "examples_1": "Be careful with your inheritance because there are a lot of schemes designed to bilk novice investors with claims of easy money."
  },
  {
    "word": "Bill of Rights",
    "meaning": "the first ten amendments of the Constitution that guarantee the rights of the people of the United States",
    "examples_0": "The Bill of Rights was added to the U.S. Constitution to insure certain freedoms and rights to the citizens of America.",
    "examples_1": "As the first ten changes, the Bill of Rights was written by founding father James Madison to improve the original document."
  },
  {
    "word": "Billet",
    "meaning": "a private nonmilitary house where soldiers were assigned to lodge",
    "examples_0": "During the Second World War the building became a billet for soldiers.",
    "examples_1": ""
  },
  {
    "word": "Billfold",
    "meaning": "a wallet typically made of leather that is thin enough to fold on itself several times",
    "examples_0": "I prefer a billfold for my wallet, since it folds the bills inside of it for easy distribution when I have to pay someone in cash.",
    "examples_1": "Most wallets these days can fold at least once, but my billfold wallet is so thin that it can fold twice just fine."
  },
  {
    "word": "Billingsgate",
    "meaning": "harshly offensive and rude talking",
    "examples_0": "Due to the billingsgate coming from the mouth of the disrespectful student to his teacher, the boy was suspended for a few days.",
    "examples_1": "As the restaurant customer?s anger grew due to the rookie server?s mistakes, the customer began to release the billingsgate of insults in the direction of the server."
  },
  {
    "word": "Billowing",
    "meaning": "swelling out or bulging",
    "examples_0": "As soon as the window was opened, the billowing curtains announced a cool breeze that was much needed on a hot day.",
    "examples_1": "The shoplifter tried to hide several goods under her billowing skirt."
  },
  {
    "word": "Bin",
    "meaning": "a container that is used to store things",
    "examples_0": "The teacher stored glue, scissors, and other school supplies in a small bin.",
    "examples_1": "Inside our fridge, we only keep fruit and vegetables in the bottom bin."
  },
  {
    "word": "Binary",
    "meaning": "associated with two elements or items",
    "examples_0": "In a game of chess, the results are binary, one winner and one loser.",
    "examples_1": "The form listed binary options for an individual?s gender as either male or female."
  },
  {
    "word": "Bind",
    "meaning": "to tie or fasten",
    "examples_0": "Family are the ties that bind us to our history and remind us where we come from.",
    "examples_1": "The camper used a bandana to bind her wound until help arrived."
  },
  {
    "word": "Binge watch",
    "meaning": "to watch multiple episodes of a television show back to back",
    "examples_0": "The lonely woman stays up all night and will binge watch episodes of the interesting series to pass the time.",
    "examples_1": "My sister is coming over to binge watch Netflix shows and eat popcorn for the rest of the night."
  },
  {
    "word": "Binge",
    "meaning": "a short period of excessive consumption",
    "examples_0": "If I continue to binge on junk food I will become obese.",
    "examples_1": "Adam?s drug binge ruined his marriage and his health."
  },
  {
    "word": "Biodegradable",
    "meaning": "having the ability to decompose organically without leaving an imprint on its surroundings",
    "examples_0": "We avoid using foam plates because they aren?t biodegradable and as such will remain at the dump for hundreds of years.",
    "examples_1": "Because the object will break down naturally into the environment, it is considered biodegradable."
  },
  {
    "word": "Biodiversity",
    "meaning": "refers to the level of variety in living creatures and plants within a particular area",
    "examples_0": "The biodiversity of this lake is extremely high, with several dozen species of fish and birds living in or near it.",
    "examples_1": "Of all the different environments on Earth, the ocean has the highest level of biodiversity, with the widest array of species calling it home."
  },
  {
    "word": "Biography",
    "meaning": "a person?s life story as told by another person",
    "examples_0": "It took me years to shape the president?s life story into an engaging biography.",
    "examples_1": "Since the actress never asked you to write about her rise to stardom, your book isn?t an authorized biography."
  },
  {
    "word": "Biology",
    "meaning": "study of living matter",
    "examples_0": "In biology class, we studied the human body and how it works.",
    "examples_1": "Using a microscope in biology class, I was able to view the cells of a plant."
  },
  {
    "word": "Biomass",
    "meaning": "plant life used as a source of energy or fuel",
    "examples_0": "The biomass that fuels the bus comes from processed vegetation.",
    "examples_1": "Since the biomass is made from plant life, it?s a source of energy that can be recreated."
  },
  {
    "word": "Biome",
    "meaning": "a large naturally occurring community of flora and fauna occupying a major habitat, e.g., forest or tundra",
    "examples_0": "The tundra biome consists of icy landscapes, heavily furred woodland animals, and cool to freezing temperatures.",
    "examples_1": "The marine biome is composed of all the world?s oceans and has the most diverse group of plants, animals, and temperatures."
  },
  {
    "word": "Biopsy",
    "meaning": "the act of removing and examining cells, fluids, or tissue to identify medical conditions",
    "examples_0": "The doctor is going to perform a tissue biopsy to see if cancer is present in my lungs.",
    "examples_1": "When my father has his follow-up with his doctor, he?ll learn the results of the biopsy and discover whether or not he has a serious disease."
  },
  {
    "word": "Biosphere",
    "meaning": "the combined regions of a planet that make it habitable and sustainable for living organisms",
    "examples_0": "Earth?s biosphere is made up of all living things, from the oceans to plants to the very atmosphere.",
    "examples_1": "All of the elements of the biosphere work together so that life is sustainable on Earth."
  },
  {
    "word": "Biotic",
    "meaning": "associated with living creatures",
    "examples_0": "Any living part of an environment is a biotic element.",
    "examples_1": "Since man exists, man is a biotic factor."
  },
  {
    "word": "Bipartisan",
    "meaning": "relating to supporters of two unlike groups",
    "examples_0": "It will take a bipartisan effort to turn the bill into a law.",
    "examples_1": "Because the president hasn?t been amiable to the congressional Republicans, it?s unlikely his healthcare plan will receive bipartisan support."
  },
  {
    "word": "Biped",
    "meaning": "an animal that walks on two feet",
    "examples_0": "Because my cat has four feet and not two, it is definitely not a biped.",
    "examples_1": "The audience enjoys watching the lion stand like a biped using its two rearmost feet."
  },
  {
    "word": "Bipolar",
    "meaning": "a mental health disorder causing severe mood swings",
    "examples_0": "Bipolar moods may shift from depressed to manic and back to depressed again.",
    "examples_1": ""
  },
  {
    "word": "Birch",
    "meaning": "a slender and smooth tree that has a wood covering that is usually white",
    "examples_0": "The woman picked a bundle of thin switches from the birch tree to create a broom.",
    "examples_1": "Because of it?s tall and slender white trunk, the botanist recognized the sapling as a birch tree."
  },
  {
    "word": "Birdbath",
    "meaning": "a small basin filled with water that birds can bathe in",
    "examples_0": "Inside the garden, a rainwater-filled basin served as a birdbath for the bluebirds.",
    "examples_1": "A stone birdbath was filled with water so that the neighborhood birds would have a place to splash around in."
  },
  {
    "word": "Birther",
    "meaning": "a person who believes former President Barack Obama was not born in the United States and should have been disqualified from being president",
    "examples_0": "The birther is adamant that President Obama was born in Kenya and not the United States.",
    "examples_1": "As one of the leader?s of the birther movement, Donald Trump tried to convince people that Barack Obama was not born on US soil."
  },
  {
    "word": "Bisect",
    "meaning": "to separate into two even or nearly even sections",
    "examples_0": "With the skill of a surgeon, the chef will use a knife to bisect the pie into two equal slices.",
    "examples_1": "I have to perfectly bisect the cookie or my kids will complain about one of them receiving a larger portion."
  },
  {
    "word": "Bitten",
    "meaning": "having been wounded when a person or animal?s teeth were pushed down into the skin",
    "examples_0": "After being bitten by a poisonous snake, the injured hiker was rushed to the hospital.",
    "examples_1": "Because it had teeth marks in it, the bitten apple was thrown in the trash can."
  },
  {
    "word": "Bitter end",
    "meaning": "the end or conclusion of a very difficult situation",
    "examples_0": "As the battle came to the bitter end, people on both sides were upset by all of the destruction.",
    "examples_1": "The lawyer?s career came to a bitter end when he was arrested and thrown in jail for fraud."
  },
  {
    "word": "Bitter",
    "meaning": "agitated, disgruntled, or angry about something",
    "examples_0": "My wife was bitter towards me after she found out that I had been hanging around an old girlfriend from school, even though we didn?t do anything.",
    "examples_1": "A dog will become bitter towards its owner if that owner does not feed him or take good care of him in general."
  },
  {
    "word": "Bittersweet",
    "meaning": "something that offers both joy and pain or the tastes of sweet and bitter together",
    "examples_0": "Saying goodbye to my husband was such a bittersweet experience for me.",
    "examples_1": "Because the movie was bittersweet, I found myself laughing and crying in the theater."
  },
  {
    "word": "Bivouac",
    "meaning": "a makeshift shelter that is generally used only for a night",
    "examples_0": "When the storm started, the soldier built a bivouac for shelter.",
    "examples_1": "We will use the tree branches as a bivouac if it rains."
  },
  {
    "word": "Biweekly",
    "meaning": "once every two weeks",
    "examples_0": "Being paid biweekly means that I have to manage my paycheck wisely for two weeks.",
    "examples_1": "Although the had biweekly printings, the magazine editor felt that cutting edge stories needed to be released sooner than every two weeks."
  },
  {
    "word": "Bizarre",
    "meaning": "highly unusual",
    "examples_0": "Everyone stared at the student who wore the bizarre outfit to school.",
    "examples_1": "Because I am not a fan of bizarre imagery, I have no interest in seeing Peter?s unusual sculptures."
  },
  {
    "word": "Blab",
    "meaning": "to talk or gossip too much",
    "examples_0": "At recess, the mouthy students continued to blab about why they hated their teacher.",
    "examples_1": "My talkative aunt loves to blab on the phone for hours at a time."
  },
  {
    "word": "Black",
    "meaning": "of the darkest color, like coal or the sky at midnight",
    "examples_0": "As the fire raged on, black clouds of smoke made the white clouds look dark.",
    "examples_1": "The woman?s jet black hair was as dark as coal."
  },
  {
    "word": "Blacklist",
    "meaning": "to put a person or company?s name on a list of things that are not acceptable and should be boycotted",
    "examples_0": "The producer threatened to blacklist the actor and stop him from ever working in Hollywood again.",
    "examples_1": "When the people of Montgomery decided to blacklist the bussing system, people stopped riding the buses."
  },
  {
    "word": "Blackmail",
    "meaning": "to extort money from another by means of intimidation to not release damaging information",
    "examples_0": "The strange man tried to blackmail the clerk into helping him draw the money, but he failed.",
    "examples_1": ""
  },
  {
    "word": "Blade",
    "meaning": "the flat edge of a knife, saw, or a weapon",
    "examples_0": "Using the blade of the knife, the mailman was able to slice the tape holding the box together.",
    "examples_1": "The solider used a special too to sharpen the metal blade of his sword before heading into battle."
  },
  {
    "word": "Blame",
    "meaning": "to assign fault or responsibility",
    "examples_0": "Although I no longer blame my father for my parent?s divorce, my mother is still holding a grudge.",
    "examples_1": "The news outlets continued to blame the young woman for her daughter?s death even though she was found not guilty."
  },
  {
    "word": "Blameless",
    "meaning": "free of blame or innocent of wrongdoing",
    "examples_0": "Many blameless individuals have been wrongly imprisoned or punished due to an improper trial or coincidental evidence.",
    "examples_1": "Even though he was blameless, the older brother told his parents that he was the one who broke the lamp so his little sister wouldn?t get in trouble."
  },
  {
    "word": "Blanch",
    "meaning": "to grow fairer or paler as a result of fright or amazement",
    "examples_0": "The snake?s presence made the normally dark Gail blanch in fear.",
    "examples_1": "When my tightfisted father saw the huge dinner bill, he seemed to blanch so much he soon resembled white chalk."
  },
  {
    "word": "Bland",
    "meaning": "wanting in quality, taste, or seasonings",
    "examples_0": "The bland salad will taste better if you add salt and pepper to it.",
    "examples_1": "When I looked at the bland paint colors available, I decided to go to another store to find more vibrant options."
  },
  {
    "word": "Blandish",
    "meaning": "to persuade or influence someone by using flattery",
    "examples_0": "Because he wanted to go to the game so badly, Joe tried to blandish his mother by complimenting her hair.",
    "examples_1": "It is impossible to blandish my boss since she isn?t persuaded by flattery or compliments."
  },
  {
    "word": "Blandishment",
    "meaning": "the use of flattery (sweet-talk) and enticements to persuade somebody gently to do something",
    "examples_0": "Even though the salesman produced every blandishment he could think of from his bag of tricks, his prospect wouldn?t be budged by his flattery.",
    "examples_1": "As Derek waited for Missy to come to the phone, he tried to think of a suitable blandishment to provide before he asked her to go out with him."
  },
  {
    "word": "Blaring",
    "meaning": "to make or cause sound to play loudly",
    "examples_0": "With siren blaring, the fire truck raced off noisily into the night",
    "examples_1": "The irritated parents kept asking their son to turn down his blaring radio."
  },
  {
    "word": "Blase",
    "meaning": "indifferent because of frequent exposure",
    "examples_0": "After going on eight cruises, I am blas?about the whole cruising experience.",
    "examples_1": "The actor was so frequently in front of the camera that he simply looked upon his paparazzi followers with a blas?attitude."
  },
  {
    "word": "Blasphemy",
    "meaning": "great disrespect shown to God or something holy",
    "examples_0": "My grandmother is very religious and will kick you out of her house if you display blasphemy in any form.",
    "examples_1": "When Jake made a joke in church, his mother accused him of blasphemy."
  },
  {
    "word": "Blast",
    "meaning": "an explosion",
    "examples_0": "Each blast of dynamite seemed to rock and shake the city to its core.",
    "examples_1": "Police officers released a strong blast of water from the hoses, knocking down protesters who were picketing in the streets."
  },
  {
    "word": "Blatant",
    "meaning": "completely obvious, especially in an offensive manner",
    "examples_0": "When the judge heard the defendant?s blatant lie, he became very angry.",
    "examples_1": "The drunk driver?s blatant disregard for the lives of others earned him seven years in prison."
  },
  {
    "word": "Blather",
    "meaning": "to ramble on for a long period of time",
    "examples_0": "I didn?t want to listen to my teacher blather on about his sister?s wedding in math class.",
    "examples_1": "Unless I walk towards my grandmother?s front door, she will blather about every president during her lifetime and keep me for hours."
  },
  {
    "word": "Blatherskite",
    "meaning": "a person who constantly talks, usually about nothing important",
    "examples_0": "My aunt is a blatherskite who talks constantly.",
    "examples_1": "Because the event host is a blatherskite, he had to be reminded to limit his remarks."
  },
  {
    "word": "Blaze",
    "meaning": "a fire that is burning intensely",
    "examples_0": "Last night firefighters worked tirelessly to control the blaze that consumed the old train station.",
    "examples_1": "The troubled lad used gasoline to start the blaze that produced a catastrophic fire."
  },
  {
    "word": "Blazon",
    "meaning": "to exhibit in a vivid manner",
    "examples_0": "To blazon his wealth, the king wore a crown adorned with hundreds of jewels.",
    "examples_1": "After the championship game, the players will blazon their victory by running through the stands with the trophy."
  },
  {
    "word": "Bleak",
    "meaning": "devoid of enthusiasm or life",
    "examples_0": "At the funeral, the widow looked bleak and lost.",
    "examples_1": "Jim has been drinking a lot of beer lately because of his bleak job situation."
  },
  {
    "word": "Bleary",
    "meaning": "blurred eyes from being tired, upset, or as a result of old age",
    "examples_0": "She wiped the sleep from her bleary eyes and yawned.",
    "examples_1": "He blinked rapidly to clear his bleary eyes."
  },
  {
    "word": "Blemish",
    "meaning": "a small flaw or imperfection that ruins the appearance of something",
    "examples_0": "Oliver was worried that the small blemish on the tip of his nose would stand out in the wedding photographs.",
    "examples_1": "George is a picky eater who throws away any fruit or vegetable that has the slightest blemish."
  },
  {
    "word": "Blend",
    "meaning": "a mixture of two or more things",
    "examples_0": "I plan on breaking up with my girlfriend because our views on important issues do not blend well together.",
    "examples_1": "Alexis arranged the furniture of her apartment so that it would blend in with the color and pattern of her carpet."
  },
  {
    "word": "Bless",
    "meaning": "to express gratitude or thank someone",
    "examples_0": "The old woman that I helped across the street said ?bless you for your kindness? as a means of gratitude.",
    "examples_1": "You may bless someone if you are thanking them for doing something especially noble or selfless."
  },
  {
    "word": "Blessed",
    "meaning": "to have made something holy",
    "examples_0": "The newlywed?s marriage was blessed by the local pastor as a holy union.",
    "examples_1": "Ever since I was small, we have blessed the food and gave thanks to God before we eat."
  },
  {
    "word": "Blest",
    "meaning": "an archaic term meaning blessed and made holy",
    "examples_0": "The priest came to the house and blest the family, ridding it from anything unholy.",
    "examples_1": "God has blest the family and provided everything they need."
  },
  {
    "word": "Blight",
    "meaning": "",
    "examples_0": "I was looking forward to bushels of fresh, home-grown tomatoes, but a blight killed all my plants just before they became ripe.",
    "examples_1": "The coach blames the negative attitudes that several members of the team have been displaying on the field for the blight on their winning record."
  },
  {
    "word": "Blimp",
    "meaning": "an large, balloon-shaped aircraft with no wings that stays afloat by pressure from contained gas",
    "examples_0": "The Goodyear blimp flew slowly about the football stadium and advertised for the company on its balloon-shaped body.",
    "examples_1": "While at the beach, the couple saw a gas powered aircraft that looked like a blimp sailing overhead."
  },
  {
    "word": "Blind",
    "meaning": "not able to see or failing to understand",
    "examples_0": "Jack?s eyesight continued to get worse, making him fear that he would go blind.",
    "examples_1": "My mother warned me that if I stared into the sun for long periods of time, I would go blind."
  },
  {
    "word": "Blindly",
    "meaning": "doing something in an unaware manner, without thinking about the conditions or without protest",
    "examples_0": "Molly blindly trusted the smooth-talking car salesman since she really wanted the car to run well even though the engine?s noise was loud.",
    "examples_1": "Since the mother blindly believed her son?s lies, many teachers believed she would never admit that her son did anything wrong even if she witnessed his bad behavior."
  },
  {
    "word": "Blip",
    "meaning": "an unexpected and minor deviation from the norm",
    "examples_0": "We usually ride to school with our mom, but there was a blip in the routine the day we had to take the bus instead.",
    "examples_1": "For people that like to stick to a well-planned routine, encountering a blip that ruins that routine in even a small way usually irritates them."
  },
  {
    "word": "Bliss",
    "meaning": "total happiness",
    "examples_0": "People who suffer from severe depression rarely experience days of bliss.",
    "examples_1": "As a chocolate lover, I see bliss as an endless supply of chocolate bars."
  },
  {
    "word": "Blissful",
    "meaning": "extremely happy; full of joy",
    "examples_0": "The couple was very blissful on their wedding day.",
    "examples_1": "When the children were at school, there was a blissful silence throughout the house."
  },
  {
    "word": "Blister",
    "meaning": "a raised place or bubble on the skin or the surface of an object",
    "examples_0": "After walking in uncomfortable shoes all day, Tia felt a small blister rising up on her foot.",
    "examples_1": "A blister appeared on the surfer?s nose after a day spent in the sweltering sun."
  },
  {
    "word": "Blithe",
    "meaning": "carefree and unconcerned",
    "examples_0": "The rebellious teenager was blithe about her failing grades.",
    "examples_1": "Although Marcia seems to have a blithe attitude about her job, she is really concerned about moving up at her firm."
  },
  {
    "word": "Blithesome",
    "meaning": "cheerful and lighthearted",
    "examples_0": "The magician practices blithesome magic that is lighthearted enough to make almost anyone smile.",
    "examples_1": "Skipping through the woods, the blithesome girl sang her song with cheer."
  },
  {
    "word": "Blitz",
    "meaning": "a sudden or intensive effort, often referring to a military attack",
    "examples_0": "The blitz bombing caught their adversaries by surprise, allowing them to win the war.",
    "examples_1": "In a blitz effort, the team was able to come back from a six point disadvantage."
  },
  {
    "word": "Blitzkrieg",
    "meaning": "a ruthless attack designed to quickly defeat or stun another",
    "examples_0": "Although the Japanese might have planned dropping bombs on Pearl Harbor as a blitzkrieg attack, the United States did not surrender.",
    "examples_1": "Some argue that Russia used a blitzkrieg battle tactic when they deployed thousands of soldiers to Syria and dropped bombs until they surrendered."
  },
  {
    "word": "Blizzard",
    "meaning": "a severe snowstorm with strong winds and reduced visibility",
    "examples_0": "The weather forecaster upgraded the simple snow showers to a blizzard due to expectant high 40 mph winds and at least 12 feet of snow.",
    "examples_1": "Due to the blizzard, the heavy weight of the snow triggered an avalanche which left massive destruction in its path for the small village."
  },
  {
    "word": "Bloat",
    "meaning": "to make or become swollen with fluid",
    "examples_0": "Eating too much salt causes the patient?s legs and feet to bloat to 2x their original size.",
    "examples_1": "When she is retaining fluid, the woman?s belly seems to bloat up like a basketball."
  },
  {
    "word": "Bloated",
    "meaning": "swollen with fluid",
    "examples_0": "The puppy?s belly seems bloated, but we aren?t sure if it is extra fluid or puppies.",
    "examples_1": "After eating a diet high in sodium, Marc?s face became bloated from built up fluid."
  },
  {
    "word": "Blob",
    "meaning": "thick or sticky liquid is a small, often round",
    "examples_0": "A blob of snot hung down from the sick toddler?s wet nose.",
    "examples_1": "The student placed a big blob of glue on the paper so that the project could be pieced together."
  },
  {
    "word": "Bloc",
    "meaning": "an alliance of countries or people that work together for a goal",
    "examples_0": "A powerful military bloc was formed between the three countries to stop their enemies from invading the alliance territory.",
    "examples_1": "Though they used to be in a bloc with France, the nation has now joined a new alliance with a neighboring country."
  },
  {
    "word": "Blockade",
    "meaning": "something used to block access to a certain area",
    "examples_0": "The bank robbers used furniture as a blockade to prevent the police from quietly entering the building.",
    "examples_1": "During the battle, the soldiers created a blockade to keep the enemy from entering through the castle gate."
  },
  {
    "word": "Bloke",
    "meaning": "slang term for a man",
    "examples_0": "I went to the club where this bloke was the doorman.",
    "examples_1": "He wanted me to think he was an innocent, ordinary bloke, but I wasn't going to fall for that trick."
  },
  {
    "word": "Blossom",
    "meaning": "to thrive or develop",
    "examples_0": "Your ice cream business will blossom during the summer months.",
    "examples_1": "Do you think our relationship will blossom into something romantic?"
  },
  {
    "word": "Blot",
    "meaning": "to dab at a spot or stain in order to remove it",
    "examples_0": "After dripping spaghetti sauce on her dress, the woman took a napkin and began to blot the stain.",
    "examples_1": "Suggestions included using club soda and taking a cloth to blot the stain instead of rubbing it."
  },
  {
    "word": "Bloviate",
    "meaning": "to talk for a long time, typically about nothing important",
    "examples_0": "I hate talking to Ricky because he likes to bloviate so much in our conversations, going on for twenty minutes about anything and everything.",
    "examples_1": "Many acquaintances, when they see each other after some time, will bloviate for several minutes, talking about miscellaneous topics in an effort to be polite."
  },
  {
    "word": "Blow",
    "meaning": "a setback or misfortune",
    "examples_0": "The loss of her job during layoffs came as huge blow to the seasoned employee.",
    "examples_1": "Not sure which was the biggest blow, the widow couldn?t stop grieving the loss of both her husband and her father."
  },
  {
    "word": "Bludgeon",
    "meaning": "to strike over and over again with a weighty object",
    "examples_0": "The witness saw the suspect bludgeon the victim with a baseball bat.",
    "examples_1": "During the conflict, the soldier tried to bludgeon his enemy with his weapon."
  },
  {
    "word": "Blueprint",
    "meaning": "a design plan or a detailed technical drawing",
    "examples_0": "Because the blueprint seemed to be missing some details, the builders were concerned.",
    "examples_1": "The architect?s blueprint was ready for building a new library."
  },
  {
    "word": "Bluestocking",
    "meaning": "an educated, intellectual woman who is interested in books and ideas usually refers to a specific group of women in the 18th century",
    "examples_0": "Elizabeth was a 18th century bluestocking who was much more interested in books than men.",
    "examples_1": "Although women of her time were excluded from formal education, the bluestocking could read as well as any man."
  },
  {
    "word": "Bluff",
    "meaning": "to display a fake expression of power or control",
    "examples_0": "Rick is a good poker player because he knows how to bluff.",
    "examples_1": "Because the hostage did not bluff well, the kidnapper never believed the police were on their way."
  },
  {
    "word": "Blunder",
    "meaning": "a clumsy or embarrassing mistake",
    "examples_0": "Because he was not paying close attention, the driver made a blunder by hitting a stop sign.",
    "examples_1": "The groom made a blunder when he called the bride the wrong name."
  },
  {
    "word": "Blunderbuss",
    "meaning": "an awkward individual",
    "examples_0": "Jared is a blunderbuss who cannot walk in a straight line even when he is sober.",
    "examples_1": "Being the blunderbuss he is my husband has broken nearly every glass in our house."
  },
  {
    "word": "Blunt",
    "meaning": "very direct in one's words, usually in a negative manner and in a rude way",
    "examples_0": "My aunt is quite blunt so it was no surprise when she gave her opinions on the unsightly dor.",
    "examples_1": "I?ve lost friends due to being a very blunt person and speaking my mind."
  },
  {
    "word": "Blurry",
    "meaning": "Not clear, crisp, or focused",
    "examples_0": "Due to the excessive rain, the windshield became a blurry screen that made it impossible to see through.",
    "examples_1": "After spraying a mist in my eyes, the doctor asked me to open my blurry eyes."
  },
  {
    "word": "Blush",
    "meaning": "for a person?s face to redden in color due to awkwardness or shame",
    "examples_0": "As the teenager?s friends would tease him about his love interest, he would blush with embarrassment.",
    "examples_1": "At first, her friends thought she was suffering from a sunburn but then realized she would blush every time her boyfriend would walk by."
  },
  {
    "word": "Blustery",
    "meaning": "blowing in loud and abrupt bursts",
    "examples_0": "During the blizzard, the blustery wind echoed eerily throughout the house.",
    "examples_1": "The meteorologist told us to ?hold on to our hats,? because it was going to be a blustery day."
  },
  {
    "word": "Board",
    "meaning": "a panel or plank",
    "examples_0": "A wooden board was placed across each window to keep neighborhood hooligans from breaking the windows out.",
    "examples_1": "A new board is needed for the worn ladder that leads up to the treehouse."
  },
  {
    "word": "Boast",
    "meaning": "brag",
    "examples_0": "I didn?t want to boast, but I did exceptionally well on my college entrance exam.",
    "examples_1": "It was difficult to listen to her boast about her new job when I had just been laid off."
  },
  {
    "word": "Boastful",
    "meaning": "bragging",
    "examples_0": "No one liked my rich friend?s boastful attitude about his money.",
    "examples_1": "My grandmother told me that it was rude to be boastful about your finances."
  },
  {
    "word": "Bobble",
    "meaning": "to move about up and down or side to side in a jerky motion",
    "examples_0": "The fisherman?s string began to bobble up and down, letting him know that a fish was on the line.",
    "examples_1": "Barely able to hold it up, the sleepy baby?s head began to bobble back and forth."
  },
  {
    "word": "Bodacious",
    "meaning": "extraordinary or amazing",
    "examples_0": "Surfers will frequently ride the most bodacious wave that is over 20 feet tall without wiping out.",
    "examples_1": "Growing a bodacious beard on the average man that reached the ground took a lot of skill and care in order for this to happen."
  },
  {
    "word": "Bode",
    "meaning": "being a predictor of a specific result or outcome",
    "examples_0": "The harsh reviews do not bode kindly on the playwright?s latest stage production.",
    "examples_1": "Because I am a light sleeper, the dog?s barking does not bode well for my desire to take a nap."
  },
  {
    "word": "Bodice",
    "meaning": "the part of a woman?s dress that is above the waist, but doesn?t include the sleeves",
    "examples_0": "The dress?s bodice needs to be taken in since its wearer has lost weight in her top half over the last few months.",
    "examples_1": "The designer will add jewels to the bodice of the dress so that the bride will have a few rolls of jewels across her chest."
  },
  {
    "word": "Bog",
    "meaning": "similar to a swamp but it is a collection of large stagnant water that is usually located on a higher level than what is around it",
    "examples_0": "Scientists put on their wading boots so that they could march up the incline to test the plant life in the bog.",
    "examples_1": "The mother would prefer her son to swim in the bog instead of the swamp since dangerous marine life could find their way from the ocean into the swamp."
  },
  {
    "word": "Boggle",
    "meaning": "to baffle or confuse someone?s mind",
    "examples_0": "Difficult math equations and tricky logic questions were enough to boggle the minds of the students.",
    "examples_1": "Her mother?s crazy behavior would always boggle the mind of the confused girl."
  },
  {
    "word": "Bogus",
    "meaning": "not real; fake",
    "examples_0": "The jewelry store owner was arrested for selling bogus diamonds as genuine gems.",
    "examples_1": "Because Ted filed a bogus claim with his insurance company, he is being prosecuted for fraud."
  },
  {
    "word": "Bohemian",
    "meaning": "",
    "examples_0": "Elizabeth was quite nervous to introduce her boyfriend dressed in bohemian clothing to her grandmother.",
    "examples_1": "The free spirit of the young girl allowed her to fit in with the other people in her community due to her bohemian lifestyle."
  },
  {
    "word": "Boisterous",
    "meaning": "Noisy, energetic, and rowdy",
    "examples_0": "Your boisterous actions at church cannot be tolerated.",
    "examples_1": "The boisterous crowd rose to its feet, stamping their feet and loudly cheering for the NFL star after he scored a game-winning touchdown."
  },
  {
    "word": "Bold",
    "meaning": "courageous, not afraid",
    "examples_0": "Because I was bold, my friends pushed me into the haunted house ahead of them.",
    "examples_1": "When my friend broke up with her boyfriend, she was bold enough to do it in front of the entire school."
  },
  {
    "word": "Boldness",
    "meaning": "being courageous or daring",
    "examples_0": "Attempting to answer every question in front of his snickering peers even though the teenage boy was wrong some of the time revealed his boldness to the class.",
    "examples_1": "To enter the burning building that was about to collapse, the firefighter?s boldness was evident and respected when he went to retrieve the two children inside."
  },
  {
    "word": "Bolster",
    "meaning": "to make something stronger or bolder",
    "examples_0": "Free tickets were given away to bolster attendance at the game.",
    "examples_1": "If I want to feel better about myself, I need to bolster my self-esteem."
  },
  {
    "word": "Bombard",
    "meaning": "to attack continually, either physically or verbally",
    "examples_0": "When people discover you won the big lottery, they?re going to bombard you with requests for money.",
    "examples_1": "The reporters will bombard the disgraced politician with questions as soon as he leaves his home."
  },
  {
    "word": "Bombastic",
    "meaning": "one who is full of himself; a self absorbed person; giving oneself high self-esteem or exaggerated dignity",
    "examples_0": "Because he is a bit too bombastic for me, I will not be voting for that politician again!",
    "examples_1": "His bombastic rant made her rethink her decision to go on a date with him."
  },
  {
    "word": "Bombinate",
    "meaning": "to make a buzzing or humming noise",
    "examples_0": "After the maid plugged in the vacuum cleaner, it began to bombinate loudly.",
    "examples_1": "The bees are known to bombinate so noisily that not much can be heard over their incessant buzzing."
  },
  {
    "word": "Bon mot",
    "meaning": "a clever or witty remark",
    "examples_0": "Elise laughed at her husband?s bon mot as she did all of his clever jokes.",
    "examples_1": "The witty comedian is known for responding with a bon mot or two while on the stage."
  },
  {
    "word": "Bon Voyage",
    "meaning": "a phrase used to wish a traveler a pleasant journey",
    "examples_0": "?Bon voyage,? Elizabeth called as her neighbor?s bored the ship for America.",
    "examples_1": "The traveler?s cheerful going-away party had a sign that read ?Bon Voyage? and was decorated with Hawaiian dor."
  },
  {
    "word": "Bona Fide",
    "meaning": "real or done honestly",
    "examples_0": "The jeweler stated the large diamond was bona fide and valuable.",
    "examples_1": "Because the man had lied about having a medical degree, he was not a bona fide doctor."
  },
  {
    "word": "Bonanza",
    "meaning": "a large amount of a thing that is viewed as desirable",
    "examples_0": "Once I was a lonely girl, but social media has changed that by providing me with a bonanza of friends.",
    "examples_1": "Valentine?s Day produces a bonanza of wealth for candy companies."
  },
  {
    "word": "Bond",
    "meaning": "to attach or stick",
    "examples_0": "In order for the wooden planks to bond to the subflooring, a strong adhesive designed for sturdy wood would have to be applied to each plank.",
    "examples_1": "If you bond your fingers together with superglue, it will take a lot of time, energy and cleaning products to get your fingers apart."
  },
  {
    "word": "Bondage",
    "meaning": "the condition of being restrained",
    "examples_0": "The prisoner?s bondage will prevent him from attacking people in court.",
    "examples_1": "When Ted learned his wife was interested in bondage, he purchased materials that could be used to restrain her."
  },
  {
    "word": "Bonhomie",
    "meaning": "friendliness; a pleasant, good-natured manner",
    "examples_0": "The life-long friends experienced a sense of bonhomie whenever they got together.",
    "examples_1": "The group leader wanted to facilitate bonhomie among the new members."
  },
  {
    "word": "Bonkers",
    "meaning": "crazy; insane",
    "examples_0": "Even though she acts bonkers on the television show, the skilled actress isn?t crazy in real life.",
    "examples_1": "The loud humming sound coming from the radio was irritating enough to drive the man bonkers."
  },
  {
    "word": "Bonnet",
    "meaning": "a woman's or child's hat tied under the chin, typically with a brim framing the face",
    "examples_0": "The young mother placed the bonnet on her daughter?s head and tied the ribbon beneath her chin.",
    "examples_1": "In the 17th and 18th centuries, the bonnet was used to protect women?s hair from harsh weather conditions and as a fashion statement."
  },
  {
    "word": "Bonus",
    "meaning": "something extra or more that is added",
    "examples_0": "When Christmas arrives, you will receive a large cash bonus for all your hard work.",
    "examples_1": ""
  },
  {
    "word": "Book",
    "meaning": "to reserve or purchase something ahead of time",
    "examples_0": "The manager tried to book a meeting room at the office building, but none were empty.",
    "examples_1": "We tried to book our flights online, but the system was down and we couldn?t make our purchase."
  },
  {
    "word": "Bookkeeping",
    "meaning": "the recording of financial transactions on a daily basis",
    "examples_0": "Only one accountant is responsible for the bookkeeping while the other deal with other financial transactions.",
    "examples_1": "A bookkeeping class taught the woman how to record the finances of her shop."
  },
  {
    "word": "Booklore",
    "meaning": "knowledge gained from reading books",
    "examples_0": "Because he is an avid reader, the boy?s head is filled with imaginative booklore.",
    "examples_1": "Marian has no need for booklore and believes that knowledge gained from reading is useless."
  },
  {
    "word": "Bookworm",
    "meaning": "someone who spends an inordinate amount of time studying or reading",
    "examples_0": "Hermione Granger is a bookworm who would much rather spend her time in the library reading than socializing.",
    "examples_1": "The librarian was a known bookworm who read an average of 200 books a year."
  },
  {
    "word": "Boom",
    "meaning": "a sound that is loud and deep",
    "examples_0": "A loud boom could be heard across the city as the thunderstorm raged on throughout the evening.",
    "examples_1": "The firework display let off a thunderous boom as it lit up the night sky with light and sound waves."
  },
  {
    "word": "Boomerang",
    "meaning": "(of a plan) to backfire or reverse with negative consequences",
    "examples_0": "Freda warned her husband that his shady business deals could boomerang back and cost him a lot of money.",
    "examples_1": "Brian?s cheating ways seemed to boomerang back when he found out that his wife was seeing another man."
  },
  {
    "word": "Boon",
    "meaning": "a benefit or blessing for which one should be grateful",
    "examples_0": "The donation from the billionaire was a nice boon for the homeless charity.",
    "examples_1": "When controversy broke out about the author?s upbringing, it was a welcome boon for his book sales."
  },
  {
    "word": "Boondoggle",
    "meaning": "a simple craft-like creation usually made by a pioneer or outdoorsy person",
    "examples_0": "The troop leader had his scouts make a boondoggle with the yarn and plastic loops in order to be used as a keychain.",
    "examples_1": "With the simple instructions, the children were able to do the easy weave of the plastic cord which they showed their parents the boondoggle they made at summer camp."
  },
  {
    "word": "Boor",
    "meaning": "an insensitive or inconsiderate individual",
    "examples_0": "Jack was such a boor he would not even hold a door for his mother.",
    "examples_1": "Because Frank is so rude, I tend to think of him as a boor."
  },
  {
    "word": "Boorish",
    "meaning": "bad-mannered, rude, or insensitive",
    "examples_0": "The comedian?s jokes were so vulgar and boorish that the only ones left in the audience were those who were too drunk to be offended.",
    "examples_1": "Even though the pirate captain was brutal and boorish with his men, he was always courteous to the female captives."
  },
  {
    "word": "Boost",
    "meaning": "to help, stimulate, or encourage something to improve",
    "examples_0": "My kind words encouraged my sister to continue doing her best, and that boost really helped her improve.",
    "examples_1": "We often take medication and receive vaccinations to boost our immune system, making it stronger than it is by itself."
  },
  {
    "word": "Boozy",
    "meaning": "intoxicated; drunk from consuming alcohol",
    "examples_0": "Boozy from the beer, the barfly stumbled around the bar asking everyone to buy him another round.",
    "examples_1": "Although she swore she wouldn?t get drunk, the boozy bachelor was totally wasted the night before his wedding."
  },
  {
    "word": "Border",
    "meaning": "the outer edge of something",
    "examples_0": "A square picture is mounted on a larger rectangular sheet of paper leaving a border around the picture.",
    "examples_1": ""
  },
  {
    "word": "Bore",
    "meaning": "a person or thing that is dull and wearisome",
    "examples_0": "My teacher is such a bore she puts most of the class to sleep.",
    "examples_1": "Because the teenager felt the road trip with her grandparents would be a bore, she played sick in order to stay home."
  },
  {
    "word": "Bored",
    "meaning": "having nothing of interest to do",
    "examples_0": "Because he was so bored and had nothing to do, Jeff ended up falling asleep on the couch.",
    "examples_1": "A lack of fun activities left the campers bored and wishing they were at home."
  },
  {
    "word": "Boredom",
    "meaning": "the state of feeling dull and uninterested because you have nothing to do",
    "examples_0": "With nothing to do in the summer, the kids were suffering from boredom.",
    "examples_1": "My job at the library comes with a lot of perks, but the dull environment does bring on boredom."
  },
  {
    "word": "Borked",
    "meaning": "to obstruct someone from achieving a position of political power through defamation",
    "examples_0": "The would-be senator was borked by his rival when the latter dug up some unflattering evidence of a not so honorable past.",
    "examples_1": "I had a comfortable lead in the campaign for student council president, but I was borked at the last second when my competitor reminded everyone of my embarrassing middle school years."
  },
  {
    "word": "Borne",
    "meaning": "carried or spread by",
    "examples_0": "The illness was borne through undercooked food.",
    "examples_1": "The Zika virus is thought to be borne through mosquitoes that carry the disease."
  },
  {
    "word": "Borough",
    "meaning": "a town that has its own government",
    "examples_0": "Bronx and Manhattan are both a part of New York City, but each is also an independent borough.",
    "examples_1": "The town recently reached borough status and now has its own government."
  },
  {
    "word": "Borrow",
    "meaning": "to receive something temporarily",
    "examples_0": "Can I borrow your car for the weekend? I promise to return it Sunday night.",
    "examples_1": ""
  },
  {
    "word": "Bossy",
    "meaning": "characteristic of a person who prefers to be in charge and give orders",
    "examples_0": "Monica?s sister was always so bossy and telling her what to do.",
    "examples_1": "The bossy toddler liked to order her playmates around and force them to play dolls with her."
  },
  {
    "word": "Botanical",
    "meaning": "related to plants",
    "examples_0": "Botanical gardens, full of beautiful flowers and plants, surrounded the zoo.",
    "examples_1": "A botanical gardening course was offered to residents wanting to gain a green thumb."
  },
  {
    "word": "Botany",
    "meaning": "the scientific study of plants",
    "examples_0": "Studying botany was a way for George Washington Carver to enjoy doing what he loved while figuring out ways to help the world through peanut plants.",
    "examples_1": "A botany course in college opened my eyes to the endless amounts of uses for plants."
  },
  {
    "word": "Botch",
    "meaning": "to mess up or ruin",
    "examples_0": "You will botch the recipe if you leave the chicken in the marinade for too long.",
    "examples_1": "Since Timmy wrote his answers on the wrong spaces, he would botch the test."
  },
  {
    "word": "Bothersome",
    "meaning": "causing bother or irritability",
    "examples_0": "Living close to the airport, the constant aircraft noise is particularly bothersome when I'm trying to sleep.",
    "examples_1": ""
  },
  {
    "word": "Bottleneck",
    "meaning": "a point where something large is forced into a narrower space",
    "examples_0": "In a bottle of water, there is a literal bottleneck at the top where the large space of the bottle narrows to fit someone?s mouth.",
    "examples_1": "The four lanes of traffic became a major bottleneck when the highway changed to just two, slowing down everyone."
  },
  {
    "word": "Bottomless",
    "meaning": "limitless; having an unlimited supply",
    "examples_0": "The waitress brought a bottomless supply of chips and salsa to our table all night long.",
    "examples_1": "Seeing his grandfather as a bottomless pit of money, the selfish teenager kept asking for more cash."
  },
  {
    "word": "Bough",
    "meaning": "a large tree branch",
    "examples_0": "Mulberries sprouted in each direction off of the main bough of the tree.",
    "examples_1": "One squirrel ran up the bough of the oak tree, and the other squirrel grabbed for the acorn."
  },
  {
    "word": "Bought",
    "meaning": "purchased",
    "examples_0": "The customer bought several different beauty products from the department store, but the concealer was by far her favorite purchase.",
    "examples_1": "After he bought his wife a bouquet, the husband had the florist deliver them to her work."
  },
  {
    "word": "Boulder",
    "meaning": "a large rock typically made smooth by erosion",
    "examples_0": "A large boulder fell from the cliffs above during the storm, blocking the road with its smooth surface.",
    "examples_1": "The only difference in a rock and a boulder is how large it is, though most boulders tend to have a smoother surface."
  },
  {
    "word": "Bounce",
    "meaning": "to move quickly up and down",
    "examples_0": "My children aren?t allowed to bounce on the bed when they play in their room.",
    "examples_1": ""
  },
  {
    "word": "Bound",
    "meaning": "tied up",
    "examples_0": "As the robber bound his hands together, the store clerk prayed that he would only be tied up and not killed.",
    "examples_1": "The student?s grouped desks were bound together with zip ties so that they would not move during class."
  },
  {
    "word": "Boundary",
    "meaning": "a line that marks the limits of an area",
    "examples_0": "The boundary between North and South Korea is marked by a barrier that functions as a demilitarized zone.",
    "examples_1": "The boundary between Mexico and Texas is guarded by customs agents and checkpoints."
  },
  {
    "word": "Boundless",
    "meaning": "unlimited; endless",
    "examples_0": "Technological advances seem boundless as we continue to invent new, high-tech devices every day.",
    "examples_1": "The nurse?s passion was boundless, as she loved to help her patients and never waivered from her caring profession."
  },
  {
    "word": "Bounteous",
    "meaning": "ample; lavish",
    "examples_0": "The bounteous buffet could probably feed thousands of people.",
    "examples_1": "Because the woman wore a dress that was cut quite low, it was hard to miss her bounteous bosom."
  },
  {
    "word": "Bountiful",
    "meaning": "having a generous amount",
    "examples_0": "Since we had a bountiful harvest this year, we were able to donate a good portion of our crops to a local soup kitchen.",
    "examples_1": "Men were trying to kill each other to gain access to the bountiful gold mine."
  },
  {
    "word": "Bounty",
    "meaning": "an abundance",
    "examples_0": "A bounty of sheep filled the field, causing the entire area to look white like snow.",
    "examples_1": "Placing a bounty of flowers in her basket, the girl struggled to keep them all inside the carrier."
  },
  {
    "word": "Bouquet",
    "meaning": "a creative arrangement of flowers",
    "examples_0": "Our local florist created a lovely bridal bouquet of red and white flowers for my daughter?s wedding.",
    "examples_1": ""
  },
  {
    "word": "Bourgeois",
    "meaning": "characteristic of the social middle class or relating to one who likes to put on airs",
    "examples_0": "After surviving the plane crash, Eric gave up his bourgeois life and joined the priesthood.",
    "examples_1": "Kate?s bourgeois ideas led her to think she was better than most people."
  },
  {
    "word": "Bout",
    "meaning": "a period of something, usually painful or unpleasant",
    "examples_0": "After missing four days of school due to a bout of flu, Emily struggled to make up her missing work.",
    "examples_1": "One bout of chicken pox may lead to shingles because both illnesses are related."
  },
  {
    "word": "Boutique",
    "meaning": "a small store that sells fashionable items",
    "examples_0": "The boutique specializes in plus size clothing and caters to women with curvier figures.",
    "examples_1": "Every Saturday, the boutique has a sale where accessories and jewelry are half off."
  },
  {
    "word": "Bovine",
    "meaning": "uninteresting and sluggish",
    "examples_0": "When my daughter does not want to do something, she always completes the task in a bovine manner.",
    "examples_1": "Jason was completely bored on his blind date and made bovine statements throughout the meal."
  },
  {
    "word": "Bow",
    "meaning": "a looped knot that is tied into something",
    "examples_0": "The small girl was taught how to make a two-looped bow out of her shoestring.",
    "examples_1": "Ribbon was tied into a knotted bow and looped around the toddler?s ponytail."
  },
  {
    "word": "Bowdlerize",
    "meaning": "to delete or change the parts of a text that are viewed as offensive",
    "examples_0": "If you do not want to offend your teacher with that profane language, you should bowdlerize the story before handing it in for a grade.",
    "examples_1": "The writer has to bowdlerize his offensive article if he wants it published in the Christian magazine."
  },
  {
    "word": "Boycott",
    "meaning": "",
    "examples_0": "A group of Hispanic men are holding a boycott by refusing to work in establishments that will not pay them legal wages.",
    "examples_1": "Frustrated with their low salaries, the workers have started a boycott and will not return to work until they are given a raise."
  },
  {
    "word": "Boyhood",
    "meaning": "the state or period of being a boy",
    "examples_0": "The man was going to buy his boyhood home so he could recapture his childhood memories.",
    "examples_1": "My grandpa says that boyhood is a time of having fun before you have to grow up."
  },
  {
    "word": "Bracken",
    "meaning": "any of several coarse ferns",
    "examples_0": "The leaves of the western bracken fern are normally 1 to 10 feet long.",
    "examples_1": ""
  },
  {
    "word": "Bracket",
    "meaning": "a category or group that people or things are placed in",
    "examples_0": "Only teams were left in the lower bracket and had to face off for the division championship.",
    "examples_1": "The school system is proposing that three out of six city schools be grouped in an Eastern bracket that would link them together."
  },
  {
    "word": "Brackish",
    "meaning": "unappealing in taste",
    "examples_0": "Since the water on the island tasted brackish, I decided not to drink it.",
    "examples_1": "Few people enjoy eating my mother-in-law?s brackish cooking."
  },
  {
    "word": "Brackish",
    "meaning": "slightly salty",
    "examples_0": "The diner complained that his meal was too brackish to consume.",
    "examples_1": "The brackish water of the ocean got in the surfer?s eyes and mouth."
  },
  {
    "word": "Brag",
    "meaning": "boastful talk",
    "examples_0": "Kevin would often brag about his many girlfriends when he was in the company of friends.",
    "examples_1": ""
  },
  {
    "word": "Braggadocio",
    "meaning": "the boasting or bragging about something that is not true",
    "examples_0": "The bully?s braggadocio allowed him to hide his low self-esteem.",
    "examples_1": "When my husband?s braggadocio gets to be too much for me, I tell him to stop making up stories."
  },
  {
    "word": "Braggart",
    "meaning": "an individual who brags a great deal",
    "examples_0": "My rich uncle is a braggart who constantly boasts about his possessions.",
    "examples_1": "Since Jim does not want to be seen as a braggart, he never talks about the expensive gifts he receives from his father."
  },
  {
    "word": "Braille",
    "meaning": "a writing system consisting of raised dots used to help people who are blind read material",
    "examples_0": "Running her fingers along the raised dots, the blind woman read the book written in braille.",
    "examples_1": "As a braille teacher, Helen is in charge of teaching the blind students in her class how to read tactile material."
  },
  {
    "word": "Brainstorm",
    "meaning": "the pondering of ideas by one or more individuals as a way to come up with a plan or solution to a problem",
    "examples_0": "Writers often brainstorm ideas for their stories before actually beginning to draft their books.",
    "examples_1": "Before the group dove into the group project, the leader had the other members brainstorm their end goals."
  },
  {
    "word": "Brandish",
    "meaning": "to gesture while holding a weapon or other item as a threat",
    "examples_0": "When the crazed man decided to brandish a gun in the airport, he was immediately shot by a security guard.",
    "examples_1": "The dictator would often go on television and brandish the heads of his enemies so his people would know the consequences of opposing him."
  },
  {
    "word": "Brash",
    "meaning": "assertive in an aggressive way that often comes across as unpleasant",
    "examples_0": "Because Anna is so brash at work, she often offends people with her aggressive personality.",
    "examples_1": "The brash reporter offended the celebrity with his insistent manner and lost out on an amazing interview."
  },
  {
    "word": "Brashness",
    "meaning": "bold assertiveness",
    "examples_0": "The aggressive racecar driver is known for his brashness when zooming down the track.",
    "examples_1": "Though he was known for his brashness, the bold and assertive Robinhood actually had a caring heart."
  },
  {
    "word": "Brassy",
    "meaning": "looking like brass",
    "examples_0": "The brassy jewelry shined with a golden twinkle in the sunlight.",
    "examples_1": "During the fall, the red and brassy gold leaves of the trees are a beautiful sight to see."
  },
  {
    "word": "Bravado",
    "meaning": "a show of defiance or courage",
    "examples_0": "Compared to the other contestants on the reality show, Monica wasn?t able to adopt a show of bravado and eat the bowl of squirming insects.",
    "examples_1": "Your show of bravado is misplaced because you should be thinking more about how you got into the situation in the first place."
  },
  {
    "word": "Brave",
    "meaning": "courageous, willing to take action",
    "examples_0": "The brave woman served as a spy in the army, putting herself at risk while helping her country.",
    "examples_1": "Trying to be brave, the scared boy climbed to the top of the diving board and pushed himself to jump."
  },
  {
    "word": "Bravery",
    "meaning": "courage; coldness",
    "examples_0": "Demonstrating bravery and courage, the private prepared to engage in battle with the enemy.",
    "examples_1": "Although her bravery shined through as she spoke out for others who were enslaved, there were times that Harriet was afraid as well."
  },
  {
    "word": "Breadth",
    "meaning": "the extent or measure of how broad or wide something is",
    "examples_0": "The gossip quickly spanned the breadth of the school building.",
    "examples_1": "Because of the baseball, the entire breadth of the window was cracked."
  },
  {
    "word": "Break down",
    "meaning": "the act of taking something apart to make it smaller and easier to transport of put away",
    "examples_0": "A team of workers began to break down the movie set for the next scene.",
    "examples_1": "The movers unpack and break down the shipping boxes and store them in the garage."
  },
  {
    "word": "Breakthrough",
    "meaning": "a sudden discovery or overcoming of an obstacle",
    "examples_0": "A medical breakthrough suddenly allowed doctors to cure a disease that once killed thousands of people.",
    "examples_1": "Because of a breakthrough in technology, people in areas with little water or land can grow crops in urban gardens."
  },
  {
    "word": "Breath",
    "meaning": "the air that you take in or send out of your lungs",
    "examples_0": "After a ten mile trek, the exhausted hiker was panting and out of breath.",
    "examples_1": "The performer needed to pace every breath so that she didn?t sound like she was winded while singing."
  },
  {
    "word": "Breathe",
    "meaning": "the intake and release of air",
    "examples_0": "Because we cannot breathe under water, swimmers can only stay under for a short amount of time.",
    "examples_1": "After running several miles, the out of shape woman found it very difficult to breathe."
  },
  {
    "word": "Breathless",
    "meaning": "panting or gasping for breath",
    "examples_0": "On the other end of the phone, Phyllis heard a breathless voice gasping as it spoke.",
    "examples_1": "After running several flights of stairs, the out of shape exerciser burst into a breathless pant."
  },
  {
    "word": "Breathtaking",
    "meaning": "something so dazzling it leaves you speechless or unable to move",
    "examples_0": "Aphrodite was a breathtaking goddess whose beauty stunned men into silence.",
    "examples_1": "The couple took in the breathtaking view from the top of the Eiffel Tower."
  },
  {
    "word": "Breed",
    "meaning": "a class of animals within a species that have similar physical characteristics",
    "examples_0": "My dog is part of a very small breed that originated in Spain.",
    "examples_1": "Each breed of sheep can have different hair lengths, with some having long wool and others short."
  },
  {
    "word": "Breeze",
    "meaning": "gentle, blowing wind",
    "examples_0": "Rocking back and forth, the hammock was moved by a gentle breeze.",
    "examples_1": "With the window open, a breeze blew through the curtains and cooled the room."
  },
  {
    "word": "Brethren",
    "meaning": "the body of members, especially of a fraternal, religious or military order",
    "examples_0": "Exhausted by the days? events, the brethren trudged towards the enemy ready to fight until the bitter end.",
    "examples_1": "Acting as brethren, the cult followers ate, worked and were housed all together."
  },
  {
    "word": "Brevity",
    "meaning": "the quality of expressing something in very few words; briefness",
    "examples_0": "I hope the minister exercises brevity in his sermon today.",
    "examples_1": "Because she does not understand what the word ?brevity? means, my mother has never had a short phone conversation."
  },
  {
    "word": "Brew",
    "meaning": "to prepare a hot drink",
    "examples_0": "At Starbucks, the employees brew a wide range of coffees and teas for their customers.",
    "examples_1": "I was able to brew enough tea for everyone who would be visiting the Edwardian Tea Festival."
  },
  {
    "word": "Bribe",
    "meaning": "money or something valuable given to tempt someone to do what you want",
    "examples_0": "When we went grocery store shopping, Mom would bribe me to behave by giving me candy.",
    "examples_1": "Even historical figures are guilty of accepting a bribe in order to gain support or achieve their mission."
  },
  {
    "word": "Bridal",
    "meaning": "Relating to a woman who is getting married (a bride)",
    "examples_0": "The woman?s bridal dress was too tight for her wedding day and had to be let out by a seamstress.",
    "examples_1": "Flowers were arranged in a bridal bouquet that the bride will carry down the aisle on her big day."
  },
  {
    "word": "Bridle",
    "meaning": "the strap located around the head and neck of a horse that the rider holds onto",
    "examples_0": "With the bridle attached to the reins, the girl tugged the reins pulling the horse?s head to its chest.",
    "examples_1": "As the bridle was placed around the stallion?s head, the rider took hold of them."
  },
  {
    "word": "Briefly",
    "meaning": "for a moment",
    "examples_0": "The instructor briefly summarized the previous lesson before moving on to the next chapter.",
    "examples_1": "The student briefly thought about majoring in biology but after a day of class, she quickly changed her mind."
  },
  {
    "word": "Brigand",
    "meaning": "a thief or fugitive",
    "examples_0": "When the brigand climbed through the broken window, he cut his wrist on the glass.",
    "examples_1": "Jake was a brigand who stole from his own family."
  },
  {
    "word": "Bright",
    "meaning": "shining or giving off a lot of light",
    "examples_0": "Letting off bright light, the sun beamed down on the sweaty construction workers.",
    "examples_1": "The children used bright paper and shiny tin foil to create their projects in art class."
  },
  {
    "word": "Bright",
    "meaning": "very smart; intelligent",
    "examples_0": "The bright child is much smarter than the other children in her classroom.",
    "examples_1": "Because he is so bright, Brandon is able to pass every test without studying."
  },
  {
    "word": "Brilliance",
    "meaning": "exceptional intelligence or talent",
    "examples_0": "The genius?s brilliance allowed him to come up with some life-changing surgical techniques.",
    "examples_1": "Thought to be the brightest boy in school, the senior?s brilliance earned him several college scholarships."
  },
  {
    "word": "Brilliant",
    "meaning": "very wise or skilled",
    "examples_0": "The only thing that seemed to anger the teacher was when a student with a brilliant mind would waste it by refusing to work.",
    "examples_1": "The genius showed how brilliant he was by working every math problem in his mind within a matter of seconds."
  },
  {
    "word": "Brimming",
    "meaning": "fill or be full to the point of overflowing",
    "examples_0": "Her eyes were brimming with so many tears that they threatened to overflow.",
    "examples_1": "The young girl filled her coffee cup so full that it was brimming and almost spilled onto the table."
  },
  {
    "word": "Brink",
    "meaning": "the very edge or border",
    "examples_0": "A few years ago, the economy was on the brink of collapse due to inflation and several other factors.",
    "examples_1": "Donald?s calculus grade drifted to the brink of failure by his low test scores."
  },
  {
    "word": "Brinkmanship",
    "meaning": "the habit of following a path to the point of danger before turning back or stopping, normally seen in political affairs",
    "examples_0": "The Asian dictator is caught up in his brinksmanship and insists on making nuclear threats.",
    "examples_1": "In a show of brinkmanship, the party chairman refused to listen to the president?s terms until budget concessions were made."
  },
  {
    "word": "Brisk",
    "meaning": "very active and quick",
    "examples_0": "My grandmother?s exercise regime is to walk the mall at a brisk pace.",
    "examples_1": "Because he was nervous during the interview, his speaking rate was very brisk."
  },
  {
    "word": "Bristle",
    "meaning": "to display indications of being angry",
    "examples_0": "An honest man will bristle at the suggestion of taking something that doesn?t belong to him.",
    "examples_1": "Although Jim was angry, he didn't bristle in a manner that anyone would notice."
  },
  {
    "word": "Brittle",
    "meaning": "easy to break",
    "examples_0": "Margaret uses tons of products to stop her brittle hair from breaking.",
    "examples_1": "Because elderly people have brittle bones, they frequently injure themselves."
  },
  {
    "word": "Broach",
    "meaning": "to mention a topic for debate or discussion",
    "examples_0": "Candace was afraid to broach the subject of divorce to her abusive husband.",
    "examples_1": "As a father, it was difficult for me to broach the topic of birth control to my daughter."
  },
  {
    "word": "Broad",
    "meaning": "wide in extent or scope",
    "examples_0": "There was broad agreement on the issue of equal pay for women.",
    "examples_1": ""
  },
  {
    "word": "Broadcast",
    "meaning": "a radio or television program",
    "examples_0": "My favorite broadcast usually comes on at eight, but to my dismay, it was replaced by a special program tonight.",
    "examples_1": "Few people listen to a specific radio broadcast these days, but my great grandfather still listens to the radio instead of watching TV."
  },
  {
    "word": "Broaden",
    "meaning": "to widen or become larger",
    "examples_0": "The road crew is working to broaden the roadway so that more cars can drive through at one time.",
    "examples_1": "When he?s trying to look more muscular, Cliff will broaden his shoulders and flex from side to side."
  },
  {
    "word": "Brobdingnagian",
    "meaning": "gigantic; huge",
    "examples_0": "The brobdingnagian hamburger was so large that it would not fit inside my mouth for a bite.",
    "examples_1": "They called her ring brobdingnagian because the large diamond covered three fingers."
  },
  {
    "word": "Brocade",
    "meaning": "a thick patterned material sometimes made with gold coloring",
    "examples_0": "Making my dress from brocade may cause discomfort for me since it will feel so weighted down as I walk.",
    "examples_1": "Mansions require heavy drapes typically made from brocade so that substantial fabric can withstand the draft from the windows."
  },
  {
    "word": "Brochure",
    "meaning": "a folded page or couple of pages created to inform or promote something that usually contains text and/or pictures",
    "examples_0": "While at the doctor?s office, Dr. Murphy handed me a brochure to read so that I would know how to handle and maintain my fibromyalgia.",
    "examples_1": "As the woman skimmed through the brochure left on her doorstep, she realized that a new church was built in the area and it was trying to get new members to join."
  },
  {
    "word": "Broil",
    "meaning": "to cook with strong, direct heat",
    "examples_0": "We had a bonfire and decided to broil the marshmallows for s?mores.",
    "examples_1": "Because we were in the Caribbean, I put on extra sunscreen so I wouldn?t broil in the sun."
  },
  {
    "word": "Broken",
    "meaning": "fragmented, in separate pieces",
    "examples_0": "The broken plate lay in pieces on the floor.",
    "examples_1": ""
  },
  {
    "word": "Broker",
    "meaning": "a person who buys and sells assets for others",
    "examples_0": "The mortgage broker was able to negotiate a favorable loan for the potential buyers.",
    "examples_1": "On Wall Street, the broker buys and sells stocks for various clients around the city."
  },
  {
    "word": "Bronze",
    "meaning": "mixture of metal and tin that is yellowish brown",
    "examples_0": "The penny is the only bronze colored coined regularly used in the US.",
    "examples_1": "Because of its bronze color, the brownish colored statue stood out amongst the figures."
  },
  {
    "word": "Brood",
    "meaning": "the offspring or youngsters in a household unit",
    "examples_0": "Because my wife is pregnant, our brood will be increasing in February.",
    "examples_1": "Janet homeschools her brood so she can know what they are learning."
  },
  {
    "word": "Brooding",
    "meaning": "appearing to worry about something",
    "examples_0": "When my father is quiet and in a brooding mood, it is best not to disturb him.",
    "examples_1": "Many girls are drawn to brooding young men who appear to carry the world on their shoulders."
  },
  {
    "word": "Brook",
    "meaning": "a body of running water smaller than a river; a small stream",
    "examples_0": "Oscar and I prefer to fish at the quiet brook because it is less crowded than the beach.",
    "examples_1": "I tried to swim in the brook, but it was impossible because of how shallow the water was."
  },
  {
    "word": "Brotherhood",
    "meaning": "a friendship bond between two men or a group of men",
    "examples_0": "A bond of brotherhood held the soldiers together even after they left the military.",
    "examples_1": "Baseball brotherhood tied the boys in my neighborhood together regardless of their age or race."
  },
  {
    "word": "Brought",
    "meaning": "transported; carried",
    "examples_0": "Most immigrants arriving on Ellis Island only brought the clothes on their backs and few necessities.",
    "examples_1": "Airline officials continue to make announcements reminding passengers about banned items that cannot be brought onboard aircrafts."
  },
  {
    "word": "Brouhaha",
    "meaning": "an uproar about something insignificant",
    "examples_0": "My sister, the drama queen, made a huge brouhaha over her broken nail.",
    "examples_1": "The spoiled child causes a brouhaha when she doesn?t get her way."
  },
  {
    "word": "Browbeat",
    "meaning": "to bully in an intimidating way",
    "examples_0": "The con man browbeat James into giving him the keys to the vault.",
    "examples_1": "Zack browbeat his girlfriend, threatening to call the police."
  },
  {
    "word": "Browse",
    "meaning": "to casually look at something, usually when reading or considering a purchase",
    "examples_0": "My mother likes to shop for shoes in town, while I prefer to browse online.",
    "examples_1": "You might find a good deal if you browse the sale section long enough."
  },
  {
    "word": "Bruise",
    "meaning": "a blue and black mark on the skin that is an injury",
    "examples_0": "After falling down the wooden stairs, the boy had a noticeable dark bruise on his leg when it hit one of the railings.",
    "examples_1": "The dark navy blemish on her face stood out as a bruise to her cheek due to her husband hitting her."
  },
  {
    "word": "Bruit",
    "meaning": "a report or a rumor",
    "examples_0": "The soldier delivered a bruit to his commander, detailing the events of the mission his soldiers had been dispatched on.",
    "examples_1": "My rival spread a bruit about me to the rest of the class, trying to make me look bad with idle gossip."
  },
  {
    "word": "Brunt",
    "meaning": "the most unpleasant part of something",
    "examples_0": "As the task manager, my husband will bear the brunt of the client?s anger when the project is not finished on time.",
    "examples_1": "The children bear the brunt of the emotional trauma when parents divorce."
  },
  {
    "word": "Brusque",
    "meaning": "blunt in manner or speech to the point of harshness",
    "examples_0": "What did I do to make you so brusque with me?",
    "examples_1": "The salesgirl?s brusque manner made me change my mind about shopping in the store."
  },
  {
    "word": "Brutal",
    "meaning": "violently cruel and inhumane",
    "examples_0": "A rise in violent and brutal crimes is plaguing the once peaceful city.",
    "examples_1": "The brutal beating given by the boxer left his opponent clinging to the ropes."
  },
  {
    "word": "Brutality",
    "meaning": "the act of causing or executing cruelty to someone or something",
    "examples_0": "The ASPCA joined forces with the local police to stop the brutality imposed on innocent dogs run by an abusive and neglectful owner of a puppy mill.",
    "examples_1": "Due to the brutality suffered by the slaves at the hands of their masters, many would take the life-threatening risks of escaping."
  },
  {
    "word": "Brute",
    "meaning": "a bully or mean person",
    "examples_0": "Acting as a brute, everyone avoided him at work so they wouldn?t hear his cruel words.",
    "examples_1": "Every hockey team has a brute who fights and takes cheap shots more than playing the game."
  },
  {
    "word": "Brutish",
    "meaning": "cruel",
    "examples_0": "Brutish by nature, the dictator even treated his own family members cruelly.",
    "examples_1": "The brutish general was ruthless in battle and never gave in to feelings of pity for his enemies."
  },
  {
    "word": "Bubbly",
    "meaning": "describes a person who is cheerful and animated in personality",
    "examples_0": "The bubbly cheerleader was able to hype the crowd into a victory cheer.",
    "examples_1": "Bubbly and outgoing, Jenna is known for her cheerful attitude at work."
  },
  {
    "word": "Bucolic",
    "meaning": "relating to the countryside",
    "examples_0": "The postcard image was beautiful and featured a bucolic white house in a dark green pasture.",
    "examples_1": "My husband and I chose a peaceful bucolic town in the country for our summer retreat."
  },
  {
    "word": "Buddhism",
    "meaning": "a religion based on Gautama Buddha?s teachings that suffering is a part of life but can be ended through spiritual development",
    "examples_0": "The founder of Buddhism renounced his title as a prince and spent his life developing his spiritual core.",
    "examples_1": "Witnessing suffering in others? lives lead the founder of Buddhism to becoming a religious teacher."
  },
  {
    "word": "Budding",
    "meaning": "becoming larger as part of a natural growing process",
    "examples_0": "The tree?s branches are slowly budding, growing ever larger as the tree gets older and older.",
    "examples_1": "The sexual organs of a human?s body start out small, but they begin their budding process during puberty as we grow into adulthood."
  },
  {
    "word": "Budge",
    "meaning": "move; shift",
    "examples_0": "Try as she might, the trapped hiker could not budge the boulder off of her foot.",
    "examples_1": "My father insisted that I be home by curfew and would not budge even when I whined and cried."
  },
  {
    "word": "Budget",
    "meaning": "inexpensive; cheap",
    "examples_0": "Staying in a budget hotel came with a price, mainly in the form of smelly sheets and cockroaches.",
    "examples_1": "Choosing to purchase cheap, budget plane tickets, the traveler swapped comfort for financial savings."
  },
  {
    "word": "Buffer",
    "meaning": "a person or thing that protects somebody or something from being harmed by another",
    "examples_0": "The wine glasses came with a cardboard around them to buffer any shock from shipping.",
    "examples_1": "A buffer of security personnel protected the celebrity as they walked the red carpet."
  },
  {
    "word": "Buffet",
    "meaning": "food laid out in this way, to which diners serve themselves",
    "examples_0": "We enforce a policy that diners may return to the buffet up to three times to refill their plates.",
    "examples_1": "Mark told me about a bar that serves up drinks buffet style so that they don?t have to pay for a bartender."
  },
  {
    "word": "Buffeted",
    "meaning": "afflicted/harmed over and over for a long period of time",
    "examples_0": "The football team was buffeted over the season, being beaten by every single team they played.",
    "examples_1": "Dropping stock markets were being buffeted by forces that seemed to want a total market failure."
  },
  {
    "word": "Buffoon",
    "meaning": "a silly person who tries to be humorous but comes across as foolish",
    "examples_0": "Since you are making a buffoon of yourself, you should go sit quietly in a corner before you embarrass me further!",
    "examples_1": "I wonder when my thirty-year-old son will stop acting like a buffoon and begin to take life seriously."
  },
  {
    "word": "Buffoonery",
    "meaning": "silly behavior or habits",
    "examples_0": "Jim got suspended because he failed to realize school was not the place to display a clown?s buffoonery.",
    "examples_1": "Working together, the two comics were able to turn their buffoonery into a half-hour comedy show."
  },
  {
    "word": "Bugle",
    "meaning": "a small brass instrument that resembles a trumpet and is usually sounded before an announcement",
    "examples_0": "Each call from the brass bugle had a different meaning for the recruits who knew the signals well.",
    "examples_1": "Similar to the trumpet, the keyed bugle is a brass instrument but is smaller in size."
  },
  {
    "word": "Bulbous",
    "meaning": "having the shape of or resembling a bulb; bloated",
    "examples_0": "The round, bulbous plants seemed to bloom on every corner of the street.",
    "examples_1": "Bulging out of his head, the irate customer?s bulbous eyes frightened the clerk."
  },
  {
    "word": "Bulge",
    "meaning": "a rounded bump or swelling that juts outward on a surface",
    "examples_0": "The bulge of the man?s muscle showed through his fitted t-shirt.",
    "examples_1": "Maternity clothes were needed since her current duds barely covered the bulge of her belly."
  },
  {
    "word": "Bulk",
    "meaning": "the larger part of something",
    "examples_0": "The bulk of the leftover food will go to the food pantry, but some will have to be thrown away.",
    "examples_1": "Because a bulk of her money would be used to pay her bills, Karen knew she would have to watch her spending this month."
  },
  {
    "word": "Bulky",
    "meaning": "large and heavily built or shaped",
    "examples_0": "The bulky package was much too large to be placed in the small mailbox.",
    "examples_1": "Big and bulky, the bride?s dress barely fit inside the luxurious limousine."
  },
  {
    "word": "Bulletin",
    "meaning": "a newsletter or memo that generally announces important information",
    "examples_0": "The community news bulletin listed garage sales, events, and other important information for the neighborhood.",
    "examples_1": "The charity organization mailed out their monthly bulletin and listed where all of the funds raised were spent."
  },
  {
    "word": "Bulwark",
    "meaning": "an object that acts as a shield",
    "examples_0": "Vaccines act as a bulwark against many childhood diseases.",
    "examples_1": "When the ruler travelled around his territory, his guards accompanied him as a bulwark from enemy attack."
  },
  {
    "word": "Bumbling",
    "meaning": "acting or moving about in a confused manner",
    "examples_0": "The drunk man was bumbling around the bar, knocking over tables and bumping into other patrons every few seconds.",
    "examples_1": "Some people find it funny to watch animals on painkillers bumbling around the house, since they can barely control their movements."
  },
  {
    "word": "Bumfuzzle",
    "meaning": "to confuse someone",
    "examples_0": "In an attempt to bumfuzzle his mother, Tony hid her keys in the microwave and pretended to know nothing about it.",
    "examples_1": "The twists and turns in the corn maze were confusing enough to bumfuzzle any of the fall party guests."
  },
  {
    "word": "Bummer",
    "meaning": "something that is disappointing",
    "examples_0": "Not getting the job was a bit of a bummer, but I?m hopeful that I will snag one soon.",
    "examples_1": "The hurricane hitting during our vacation was a big bummer that caused us to have to cancel the whole trip."
  },
  {
    "word": "Bumptious",
    "meaning": "confident in an annoying manner",
    "examples_0": "While Rick is very intelligent, he would be more likable if he were not so bumptious about his educational background.",
    "examples_1": "My coworker is so bumptious and overbearing that people try and avoid her at lunch."
  },
  {
    "word": "Bundle",
    "meaning": "a group of objects held together by wrapping or tying",
    "examples_0": "Newspapers are delivered to stores in a bundle.",
    "examples_1": ""
  },
  {
    "word": "Bundle",
    "meaning": "a group of something tied or joined together",
    "examples_0": "Before they could start a fire, the campers had to pile up a bundle of sticks in the middle of the rocks.",
    "examples_1": "The newspaper boy still had a whole bundle of papers to pass out before lunchtime."
  },
  {
    "word": "Bungalow",
    "meaning": "a small, one-story house with a front porch and a low-pitched roof",
    "examples_0": "The couple slept in a small bungalow that was built on top of the clear Caribbean Sea.",
    "examples_1": "Mr. Hatchets? thatched roof bungalow was barely big enough for he and his wife."
  },
  {
    "word": "Bungle",
    "meaning": "to clumsily perform a task",
    "examples_0": "Because the police department is comprised of idiots, it will probably bungle the simple case.",
    "examples_1": "My boss will fire me if I bungle this project."
  },
  {
    "word": "Bunkum",
    "meaning": "something that is foolish, ridiculous, and makes no sense",
    "examples_0": "The doomsday extremist spouted bunkum about how the world would end in seven days when the ozone layer spontaneously combusted.",
    "examples_1": "Many people think that global warming is complete bunkum, but scientists have numerous statistics to back up their assertion."
  },
  {
    "word": "Buoy",
    "meaning": "a float in water that is used to mark something",
    "examples_0": "To alert boaters of the hazard ahead, a small buoy was used to mark the sandbar near the surface.",
    "examples_1": "You can be a human buoy, floating in the water by wearing your life jacket."
  },
  {
    "word": "Buoyant",
    "meaning": "joyful and self-assured",
    "examples_0": "With a great deal of confidence, the buoyant model strolled down the runway.",
    "examples_1": "When I talked to my doctor, he was buoyant about my weight loss under the new diet."
  },
  {
    "word": "Burden",
    "meaning": "a heavy load",
    "examples_0": "Finding he had cancer, he tried to shoulder the burden alone and keep the news from his friends.",
    "examples_1": "Lying can be a heavy burden to carry, often making it difficult to keep stories straight."
  },
  {
    "word": "Burden",
    "meaning": "a problem or inconvenience",
    "examples_0": "Babysitting for my neighbors had become a burden when they wanted me to work over 40 hours a week while going to school.",
    "examples_1": "My mother didn?t want to be a burden on her children during her old age, so she decided to live in a nursing home."
  },
  {
    "word": "Burdensome",
    "meaning": "tough to fulfill or carry out",
    "examples_0": "After accepting several jobs, Lily realized it was burdensome for her to try to juggle all of those jobs.",
    "examples_1": "Once Carol?s co-worker quit, the job was a burdensome chore for Carol to keep up with it."
  },
  {
    "word": "Bureau",
    "meaning": "an agency or governmental department",
    "examples_0": "Although it is their job, officials at the labor bureau refuse to support worker rights.",
    "examples_1": "After a federal investigation, the bureau agreed to become more transparent with agency spending."
  },
  {
    "word": "Bureaucracy",
    "meaning": "a method of business or government in which red tape processes are used to delay action",
    "examples_0": "The bureaucracy of the legislative government is delaying the passage of much needed educational funding.",
    "examples_1": "In the waiting room, we were given numerous documents to complete as part of the hospital's pretreatment bureaucracy."
  },
  {
    "word": "Bureaucratic",
    "meaning": "associated with a lengthy and tiresome process for performing a task",
    "examples_0": "Because of bureaucratic red tape, it will be months before I receive my passport.",
    "examples_1": "Bureaucratic mistakes allowed a wrongly imprisoned man to stay in jail for over three months."
  },
  {
    "word": "Burgeon",
    "meaning": "to grow and expand rapidly",
    "examples_0": "As car prices go down, car dealers are expecting sales to burgeon.",
    "examples_1": "Because Janice is pregnant with triplets, everyone is expecting her stomach to burgeon quickly."
  },
  {
    "word": "Burglar",
    "meaning": "a robber or thief that enters a building illegally to steal",
    "examples_0": "The burglar isn?t known for stealing jewels or money, but hijacking hamburgers and french fries.",
    "examples_1": "One burglar broke in through a window while a second thief entered through the back door."
  },
  {
    "word": "Burglary",
    "meaning": "illegal entry into a building or vehicle with the intention of stealing",
    "examples_0": "Because he had been convicted of burglary before, Nick was the prime suspect in this hotel break-in.",
    "examples_1": "Another burglary string has taken hold of the area, with vehicles being broken into all over the city."
  },
  {
    "word": "Burial",
    "meaning": "the act or ceremonial practice of placing something (usually a dead body) underground",
    "examples_0": "Before the burial ceremony, grave diggers dug out a space for the coffin.",
    "examples_1": "Helen?s daughters dressed her up in her finest gown and prepared the hearse for her burial."
  },
  {
    "word": "Burlap",
    "meaning": "coarse, plain-woven fabric used for bagging, furniture, and rugs",
    "examples_0": "Burlap bags are being woven to hold potatoes and produce to be sold at the market.",
    "examples_1": "Oyster collectors fill hundreds of heavy burlap sacks on a good day and a handful on a difficult one."
  },
  {
    "word": "Burlesque",
    "meaning": "a stage production or literary piece that uses excessive exaggeration or comedic imitation to ridicule something or someone",
    "examples_0": "The burlesque war film depicts our president as a kid playing with toy soldiers.",
    "examples_1": "In the burlesque essay, the animals portray exaggerated versions of some of society?s elite."
  },
  {
    "word": "Burly",
    "meaning": "large, strong and heavy",
    "examples_0": "When he attempted an escape, a burly police officer had to forcefully restrain the suspect.",
    "examples_1": "The lumberjack?s burly frame took up the entire doorway."
  },
  {
    "word": "Burnish",
    "meaning": "to polish; to make smooth or shiny",
    "examples_0": "Richard is forever attempting to burnish his reputation so that he can advance his position within our company.",
    "examples_1": "I applied car polish to my Porsche repeatedly, making sure to burnish it to perfection."
  },
  {
    "word": "Burnt",
    "meaning": "seared; scorched",
    "examples_0": "My siblings think it is disgusting that I prefer my meat burnt and overcooked on the grill.",
    "examples_1": "In the Native American version of Cinderella, the girl?s fair skin was burnt by her evil sister who used fire cinders to scorch her."
  },
  {
    "word": "Burrow",
    "meaning": "to dig in order to make a hole or tunnel",
    "examples_0": "The rabbit tried to burrow himself down in the ground so that the fox wouldn?t catch him.",
    "examples_1": "Some animals, like the mole, like to burrow down underground to make their nest."
  },
  {
    "word": "Burst",
    "meaning": "to explode suddenly",
    "examples_0": "Rocks falling down during the landslide burst apart, breaking into a million pieces.",
    "examples_1": "My stomach is so full, it feels as if it is about to burst."
  },
  {
    "word": "Bury",
    "meaning": "to cover completely, typically with dirt or some other earthy substance as an act of hiding or putting to rest",
    "examples_0": "Dogs like to bury their bones and toys in the yard.",
    "examples_1": "All of their family and friends headed to the cemetery to bury her father."
  },
  {
    "word": "Bushel",
    "meaning": "a measure of capacity equal to 8 gallons, used for dry goods",
    "examples_0": "The bushel of oats would yield enough for many bowls of cereal.",
    "examples_1": "Once the small gardener harvested his grains, he produced a bushel of wheat."
  },
  {
    "word": "Busily",
    "meaning": "hurriedly, in a very active way",
    "examples_0": "The servants hurried through the kitchen, busily preparing for the king?s feast.",
    "examples_1": "Two and full of energy, Amber moves busily around the playroom."
  },
  {
    "word": "Business",
    "meaning": "the activity of buying and selling goods and services, especially as one?s living",
    "examples_0": "When the real estate market crashed, the business of selling homes came to a creeping halt.",
    "examples_1": "Because business is booming, Jerry can invest more money back into his product line."
  },
  {
    "word": "Bust",
    "meaning": "a sculpture or statue of a person?s head, shoulders, or chest",
    "examples_0": "The artist created the bust to show how beautiful the woman?s face was.",
    "examples_1": "A bust showing Caesar from the shoulders up will be displayed in the statue section of the museum."
  },
  {
    "word": "Buster",
    "meaning": "something used to break something else apart",
    "examples_0": "The laundry spray is a grease buster that can break up even the toughest stains.",
    "examples_1": "A master at getting horses to do what he wants, the buster was able to break the will of any stallion."
  },
  {
    "word": "Bustle",
    "meaning": "to move in a noisy or hurried manner",
    "examples_0": "On Valentine?s Day men bustle about the store trying to find last minute gifts.",
    "examples_1": "Jane was running late so she had to bustle to reach her office on time."
  },
  {
    "word": "Busybody",
    "meaning": "a person who is always in other people?s business, meddling and starting trouble",
    "examples_0": "The busybody next door is always snooping on the neighbors and trying to figure out what they are doing.",
    "examples_1": "An old busybody, Mirna, goes around the office telling other people?s business and gossiping with others."
  },
  {
    "word": "Buttress",
    "meaning": "",
    "examples_0": "For over two centuries, the U.S. Constitution has been a buttress for the government.",
    "examples_1": "Claudio?s professor told him he needed to do some more research to find data to be a buttress for his theory."
  },
  {
    "word": "Buxom",
    "meaning": "describing a full-figured female with an ample bosom",
    "examples_0": "Because Gail is a buxom woman, she has to custom order her bras.",
    "examples_1": "The men applaud loudly when the buxom stripper removes her blouse."
  },
  {
    "word": "Buy",
    "meaning": "obtain in exchange for payment",
    "examples_0": "She went to the mall to buy a new dress for her interview.",
    "examples_1": "The single mother winced every time she went to the store to buy groceries."
  },
  {
    "word": "Buzz",
    "meaning": "a low hiss with a ?z? sound",
    "examples_0": "At first I didn?t hear the buzz from the bees until I got closer to the bee hive around the corner.",
    "examples_1": "When there was a buzz coming from the car?s engine, the car?s owner described to the mechanic that his car had a snake sound coming from the engine."
  },
  {
    "word": "Buzzard",
    "meaning": "a hawk-like bird of prey that soars high with wide wings and a round tail",
    "examples_0": "The buzzard circled around the dead deer carcass and zoomed in to snatch some of the meat with his talons.",
    "examples_1": "Like other birds of prey, the plundering buzzard enjoys preying on small animals."
  },
  {
    "word": "Buzzkill",
    "meaning": "a person or thing that stops others from enjoying themselves",
    "examples_0": "Taylor?s constant talk about religion and other depressing subjects made him a total office buzzkill.",
    "examples_1": "Jason really liked Emma at first, but her low-self esteem and nagging ended up being a buzzkill when they went out."
  },
  {
    "word": "By-product",
    "meaning": "a secondary product or result that's produced in the making or doing of something else",
    "examples_0": "Dorothy was told that a by-product of her pregnancy was nausea and vomiting, but that it would subside after her first trimester.",
    "examples_1": "My dad views democracy as a by-product of freedom and that it cannot thrive without meeting certain conditions."
  },
  {
    "word": "Bygone",
    "meaning": "associated with an earlier period of time",
    "examples_0": "These days getting married before having a baby appears to be the concept of a bygone era.",
    "examples_1": "When Jane put on her vintage dress, she looked like a woman from the bygone 1940s."
  },
  {
    "word": "Bypass",
    "meaning": "to go around something",
    "examples_0": "While driving home, I decided to bypass the construction work and take a different route.",
    "examples_1": "If you are on a diet, you should bypass the bread and have a salad instead."
  },
  {
    "word": "Bystander",
    "meaning": "a person who is present during a situation or event but not directly involved",
    "examples_0": "A bystander witnessed the wreck and called the police to assist.",
    "examples_1": "Without a bystander to confirm his story, it was the man?s word against the officers."
  },
  {
    "word": "Byzantine",
    "meaning": "complex; hard to comprehend",
    "examples_0": "Because the plot was revealed in a byzantine manner, it was difficult to understand.",
    "examples_1": "I was totally confused after listening to the byzantine recording."
  }
]