[
  {
    "word": "Dabble",
    "meaning": "to casually participate or have an interest in an activity",
    "examples_0": "The man touted his professional bowling skills but his wife revealed that they only dabble in the sport occasionally.",
    "examples_1": "Although I dabble in several sports, I do not consider myself a master of any."
  },
  {
    "word": "Dachshund",
    "meaning": "a breed of dog also referred to as a ?weenie dog? because of its short legs and long body",
    "examples_0": "The long-bodied dachshund wagged its tail as it stretched out in the noon-day sun.",
    "examples_1": "Because the dachshund puppy has short little legs, it?s hard for him to get his stretched body onto the bed."
  },
  {
    "word": "Daedal",
    "meaning": "created in a complex or intricate way",
    "examples_0": "As he played the daedal melody with perfection, the musician surprised the crowd.",
    "examples_1": "Staring up at the daedal structure, the man was in awe of the complex structure."
  },
  {
    "word": "Daft",
    "meaning": "stupid, ridiculous, or silly",
    "examples_0": "The daft article is full of errors, and does not belong in our journal.",
    "examples_1": "Eric is a daft old man who is always mumbling senseless things."
  },
  {
    "word": "Dagger",
    "meaning": "a short weapon with a blade and a handle",
    "examples_0": "The sharp handle of the warrior?s dagger was carved out of pure ivory.",
    "examples_1": "Plunging the dagger into the animal?s abdomen, the hunter succeeded in securing dinner."
  },
  {
    "word": "Daily",
    "meaning": "every day",
    "examples_0": "Dentists recommend that you floss your teeth daily.",
    "examples_1": "The political analyst made a habit to read the major newspapers daily to stay informed."
  },
  {
    "word": "Daimyo",
    "meaning": "ancient Japanese feudal lords who the samurai served under",
    "examples_0": "The descendent of an ancient daimyo, the Japanese boy was proud that to come from a powerful, land-owning family.",
    "examples_1": "Each daimyo in ancient Japan was responsible for running great estates that stretched over great distances."
  },
  {
    "word": "Dainty",
    "meaning": "delicately small and pretty",
    "examples_0": "Our newborn girl clasps her long dainty fingers in a tight fist.",
    "examples_1": "The dainty precious tea cups were so beautiful to behold."
  },
  {
    "word": "Dais",
    "meaning": "an elevated platform used as a stage",
    "examples_0": "The mayor and the governor will sit on the dais until it is time for them to speak.",
    "examples_1": "When the principal calls your name, you should walk across the dais and accept your diploma."
  },
  {
    "word": "Dale",
    "meaning": "a broad valley",
    "examples_0": "Living in a dale at the bottom of the Appalachian Mountains, the poor hermit was cut off from the rest of society.",
    "examples_1": "A low dale rested at the bottom of the foothill, serving as a resting place for tired climbers."
  },
  {
    "word": "Dalliance",
    "meaning": "a relationship, usually romantic or sexual, that is taken lightly",
    "examples_0": "Since Jill and Frank were both married to other people, their workplace dalliance did not last very long.",
    "examples_1": "Teenagers have shallow hearts so it is not surprising that they enter into one dalliance after another."
  },
  {
    "word": "Dally",
    "meaning": "to do something slowly",
    "examples_0": "They fired the guard because he would dally about, wasting his time.",
    "examples_1": "You won?t succeed if you dally away your time."
  },
  {
    "word": "Damage",
    "meaning": "to impair the soundness, goodness or value of; to harm or cause destruction",
    "examples_0": "The recent hurricane left visible damage to houses across the state.",
    "examples_1": ""
  },
  {
    "word": "Damnation",
    "meaning": "the act of something being doomed",
    "examples_0": "When the criminal was sentenced to death, the life of the criminal would lead to his damnation.",
    "examples_1": "In order to make the cult members fear for their lives, the leader would say that their lives would lead to damnation if they left the cult."
  },
  {
    "word": "Damp",
    "meaning": "slightly wet",
    "examples_0": "There is a big difference in damp and soaking, nearly as large as the difference between hot and on fire.",
    "examples_1": "There was a bit of misty fog out this morning, but only enough to make my clothes feel a little damp when I came back inside."
  },
  {
    "word": "Dampen",
    "meaning": "to make something slightly wet",
    "examples_0": "It rained just enough to dampen the ground, but the grass dried up quickly.",
    "examples_1": "The men walked with umbrellas so that the plopping drops of rain wouldn?t dampen their suits."
  },
  {
    "word": "Damper",
    "meaning": "someone or something that has a depressing effect on people",
    "examples_0": "Bill has always been a damper, bringing down the mood with his pessimism and angst.",
    "examples_1": "The bad weather that was going to keep us from going on our filed trip was a real damper, essentially ruining everything."
  },
  {
    "word": "Damsel",
    "meaning": "a young, unmarried woman",
    "examples_0": "Seeing the damsel in distress, the knight swooped in and saved her from the fire-breathing dragon.",
    "examples_1": "Because the damsel was still unmarried, her parents refused to let her go to town without a male family member."
  },
  {
    "word": "Dance",
    "meaning": "to sway around in a rhythm usually to music",
    "examples_0": "When the DJ started to play the music, the couples decided to dance to it by twirling and moving to the beat of the music.",
    "examples_1": "Carol clasped Pete?s hand and put her hand on his shoulder so the two could dance around the ballroom."
  },
  {
    "word": "Dandle",
    "meaning": "to move up and down on one?s knee or in one?s arms, in affectionate play, as an infant",
    "examples_0": "Once Uncle Claude saw his two-year old nephew, he began to dandle him on his knee.",
    "examples_1": "It always seems like grandmothers do the same things when they see their grandchildren like squeeze their cheeks and dandle them on their laps."
  },
  {
    "word": "Dandy",
    "meaning": "quality of being really great or awesome",
    "examples_0": "They played a dandy game of golf and finished with almost perfect scores.",
    "examples_1": "The espresso is just dandy at the Italian restaurant."
  },
  {
    "word": "Dangerous",
    "meaning": "potentially life-threatening or will cause harm",
    "examples_0": "Children are told that it?s dangerous to cross the road without looking for cars first.",
    "examples_1": "Stunt doubles are hired to perform dangerous actions in a movie that are too risky for the main actors."
  },
  {
    "word": "Dangle",
    "meaning": "to droop freely",
    "examples_0": "Since her long earrings dangle down to the middle of her neck, the woman was constantly getting them caught in her long hair.",
    "examples_1": "While the dog trotted proudly to the front door with his prize, the mouse would dangle by his tail from the dog?s mouth."
  },
  {
    "word": "Dank",
    "meaning": "chilly and damp in an unlikable way",
    "examples_0": "After the flooding, the house was so dank we moved into a hotel for a few weeks.",
    "examples_1": "The basement is dank because of the power outage and the leaky pipes."
  },
  {
    "word": "Dapper",
    "meaning": "neat in appearance, usually referring to a male",
    "examples_0": "In the roaring twenties, all of the dapper men took a great deal of care with their appearance.",
    "examples_1": "The mother dressed her son in his most dapper attire for the family reunion."
  },
  {
    "word": "Dapple",
    "meaning": "marked with spots or round patches",
    "examples_0": "The dapple pony had several light-colored spots on his dark body.",
    "examples_1": "A dapple of light fell across the girl?s face as she stepped into the sunlight."
  },
  {
    "word": "Daring",
    "meaning": "to describe someone who is ready to take risks, bold, or venturesome.",
    "examples_0": "Bold and daring, Harriet Tubman helped over 300 slaves escape to freedom through the Underground Railroad.",
    "examples_1": "Knowing that no one had succeeded before, the daring Wright brothers made history by inventing, building, and flying the world?s first successful airplane."
  },
  {
    "word": "Dark horse",
    "meaning": "a little known competitor that unexpectedly wins",
    "examples_0": "Like a dark horse, the knight came out of nowhere and won the joust.",
    "examples_1": "A dark horse, one minute the boxer was a nobody and the next he was a champion."
  },
  {
    "word": "Dart",
    "meaning": "to dash or rush for something or in a certain direction",
    "examples_0": "When Martin felt like he was about to vomit, he decided to dart for the bathroom so he wouldn?t throw up on his bedroom floor.",
    "examples_1": "As the gun shots ring out, the men dart for cover by jumping behind any barrier that might protect them from the bullets."
  },
  {
    "word": "Dash",
    "meaning": "to run somewhere in a hurry",
    "examples_0": "Tristan was able to dash through the crowd, moving so quickly that she wasn?t late for her meeting.",
    "examples_1": "If Kim wants to make her flight on time, she will need to dash to the airport as fast as possible."
  },
  {
    "word": "Dashiki",
    "meaning": "a colorful decorative tunic originating from Africa",
    "examples_0": "When the cultural festival presented Ethiopian dancers dressed in a dashiki and equally vibrant pants, they grabbed everyone?s attention in the audience.",
    "examples_1": "Since the fashion designer was displaying her ethnic line of clothing, the model walked down the runway wearing a vivid patterned dress similar to a dashiki but longer in length."
  },
  {
    "word": "Dashing",
    "meaning": "attractive in a manly sense",
    "examples_0": "The dashing rogue that rescued me was handsome, strong, and clever, and I fell for him almost immediately.",
    "examples_1": "A dashing man is usually one that embodies everything people consider to be manly, from good looks to personality."
  },
  {
    "word": "Dastardly",
    "meaning": "wicked, evil, and cruel",
    "examples_0": "The counterfeiter?s dastardly scam was perfected to such a degree that it took decades for the FBI to track him down.",
    "examples_1": "The trial exposed the dastardly methods utilized by the mob to acquire huge sums of money."
  },
  {
    "word": "Data",
    "meaning": "statistics that are gathered from research and organized into a usable form",
    "examples_0": "The government collects demographic data through the use of census forms.",
    "examples_1": "After the lab is complete, the technician will put the data into a report."
  },
  {
    "word": "Database",
    "meaning": "a collection of data usually organized and stored in a computer system for easy access",
    "examples_0": "The DEA has a database that lists known drug syndicates and their associates.",
    "examples_1": "Fingerprints are scanned and stored in a virtual database that is only accessible to law enforcement and other government officials."
  },
  {
    "word": "Datum",
    "meaning": "a piece of information",
    "examples_0": "While conducting my study, I needed one more piece of datum to prove my theory.",
    "examples_1": "Each datum contributed to revealing the answer to a problem the people faced."
  },
  {
    "word": "Daub",
    "meaning": "to coat or smear a substance on a surface",
    "examples_0": "My mom screamed at me when I began to daub my bread with too much cream cheese.",
    "examples_1": "I suspected that the prankster would daub my door handle with Vaseline because he has done so in the past."
  },
  {
    "word": "Daunting",
    "meaning": "a task that appears challenging",
    "examples_0": "As I looked up the mountain, I knew it would be a daunting feat to reach the peak.",
    "examples_1": "Jane is so shy she finds it daunting to go to a party."
  },
  {
    "word": "Dauntless",
    "meaning": "fearless, bold, or courageous",
    "examples_0": "The dauntless knight decided to do battle with the dragon within its own lair, fearing neither its flame nor its fang.",
    "examples_1": "A dauntless general decided to press the attack even though the odds were not in his favor, and his boldness earned his faction a major victory."
  },
  {
    "word": "Dawdle",
    "meaning": "to waste time by moving slowly",
    "examples_0": "If I do not monitor my daughter in the mall, she will dawdle there all day long.",
    "examples_1": "Teenagers will often dawdle when doing chores they hate."
  },
  {
    "word": "Dawn",
    "meaning": "the start of the morning light just before sunrise; daybreak",
    "examples_0": "I stayed up until dawn waiting for Craig to walk through the door, but he never did.",
    "examples_1": "I love to sit out on the patio at dawn and watch the rising of the sun."
  },
  {
    "word": "Daze",
    "meaning": "a state of stunned confusion and a lack of clarity",
    "examples_0": "In a daze, I wandered through the hallways of the hospital, bumping into everyone that passed me by.",
    "examples_1": "After hearing that her father had been killed in combat, Jackie walked around in a daze."
  },
  {
    "word": "Dazzling",
    "meaning": "very stunning and amazing",
    "examples_0": "As the dazzling model walked down the runway, everyone was looking at the beautiful woman instead of the clothing.",
    "examples_1": "With a dazzling diamond ring on her finger looking so beautiful and expensive, the woman?s friends believed her husband was rich."
  },
  {
    "word": "De facto",
    "meaning": "in use regardless of actual status",
    "examples_0": "Although Jim and Sarah have never married, they consider their thirty-year relationship to be a de facto marriage.",
    "examples_1": "The wife is usually the de facto head of the household."
  },
  {
    "word": "De riguer",
    "meaning": "required by etiquette or current fashion",
    "examples_0": "If you want to be a clown, a big red nose is de riguer.",
    "examples_1": "Although many people think it is wrong, have a tiny frame is de riguer if you wish to be a model."
  },
  {
    "word": "Deadline",
    "meaning": "the latest time or date by which something should be finished or turned in",
    "examples_0": "Pushing to meet the latest deadline, the editor worked late into the night on the story.",
    "examples_1": "With the Christmas deadline getting closer, the store manager decided to hire seasonal help to aid the team in meeting its goal."
  },
  {
    "word": "Deadlock",
    "meaning": "an impasse caused by conflict between two sides",
    "examples_0": "Because of a voting deadlock, the council cannot make a decision on the business permit.",
    "examples_1": "The mediator will help the opposing parties end the deadlock so the contract can be signed."
  },
  {
    "word": "Deadpan",
    "meaning": "showing no feeling or emotion",
    "examples_0": "The waitress?s deadpan expression made her appear cold to her customers.",
    "examples_1": "Giving a deadpan look, the stone-cold teacher never showed emotion during the first few weeks of school."
  },
  {
    "word": "Deafening",
    "meaning": "used to describe a sound that is so loud that it drowns out all other sound",
    "examples_0": "As the bomb went off, deafening noise and eye-clouding smoke filled the city.",
    "examples_1": "The deafening screams of the war victims is all that could be heard throughout the night."
  },
  {
    "word": "Dealt",
    "meaning": "simple past tense of deal; take action with respect of someone",
    "examples_0": "As the Police officer dealt with the driver, his partner chased the passenger who ran.",
    "examples_1": ""
  },
  {
    "word": "Dearth",
    "meaning": "a scarcity or lack of something",
    "examples_0": "Because there was a dearth of evidence, the district attorney had to drop the charges.",
    "examples_1": "The test scores revealed a dearth of comprehension."
  },
  {
    "word": "Debacle",
    "meaning": "a disaster or a great failure",
    "examples_0": "When the movie was released, it was called a debacle by the critics.",
    "examples_1": "If you want to look at the country?s problems, start with the debacle of the healthcare system."
  },
  {
    "word": "Debar",
    "meaning": "to formally refuse or not allow a person to do something",
    "examples_0": "After causing a lot of chaos outside of the meeting, the committee?s president decided to debar the businessmen from attending the meeting.",
    "examples_1": "Once the scandal was broken about the principal, the superintendent decided to debar the principal from entering the school."
  },
  {
    "word": "Debase",
    "meaning": "to reduce in character or quality",
    "examples_0": "The politician tried to debase his rival?s good reputation by spreading false rumors about him.",
    "examples_1": "As part of his stock manipulation, the company owner tried to debase the stock so people would quickly sell it."
  },
  {
    "word": "Debatable",
    "meaning": "questionable; open for discussion or dispute",
    "examples_0": "The car was priced at fifteen thousand, but the eager salesman assured us that it was debatable.",
    "examples_1": "Crossing her arms firmly, my mother informed my sister that her punishment for sneaking out was not debatable."
  },
  {
    "word": "Debate",
    "meaning": "a discussion of a particular subject in which people express different opinions",
    "examples_0": "My philosophical friends and I loved to debate art and music over coffee.",
    "examples_1": "We watched the presidential debate as part of a class assignment."
  },
  {
    "word": "Debauch",
    "meaning": "a stint of extreme enjoyment involving pleasures of a carnal nature",
    "examples_0": "On the night of his graduation, Jake engaged in an alcoholic debauch and ended up in the emergency room.",
    "examples_1": "Amy?s bachelorette party is going to be her last debauch before she becomes an old married woman."
  },
  {
    "word": "Debauchee",
    "meaning": "a person who lives a reckless and self-indulgent lifestyle",
    "examples_0": "The debauchee spent most of his days getting drunk in a rundown hotel room.",
    "examples_1": "Reckless by nature, the debauchee lived for the moment and never cared about others."
  },
  {
    "word": "Debauchery",
    "meaning": "extreme indulgence in sensual behaviors, such as careless drinking and promiscuity",
    "examples_0": "How can you go to church every Sunday and still engage in debauchery?",
    "examples_1": "Give me a bachelor party without debauchery, and I?ll show you a boring evening!"
  },
  {
    "word": "Debenture",
    "meaning": "a document admitting to owing money usually used with big corporations",
    "examples_0": "After publicizing the debenture, it became known to the country that this large company was obligated to pay large sums of money back to the lending institution.",
    "examples_1": "When the money was lent, lawyers drew up the debenture to be signed by all parties representing the financially struggling business and the bank."
  },
  {
    "word": "Debilitate",
    "meaning": "to weaken",
    "examples_0": "Cancer can quickly debilitate an otherwise healthy person.",
    "examples_1": "Determined to continue forward, he would not let the injury debilitate him."
  },
  {
    "word": "Debility",
    "meaning": "a state of physical or mental weakness",
    "examples_0": "My father?s debility kept him from taking long walks like he used to love to do.",
    "examples_1": "Her debility was due to an illness she caught while overseas."
  },
  {
    "word": "Debonair",
    "meaning": "confident and stylish; suave",
    "examples_0": "Everyone is excited about the idea of the handsome athlete playing a debonair spy in the new movie.",
    "examples_1": "On the day of his wedding, my brother looked debonair in his tuxedo."
  },
  {
    "word": "Debrief",
    "meaning": "to ask questions in order to extract evidence",
    "examples_0": "When the fight ended at school, the principal needed to debrief each eyewitness to get an idea of which student started the fight.",
    "examples_1": "In the courtroom, the prosecutor would debrief each witness on the stand in order to get their information stated about the defendant?s whereabouts in front of the jury."
  },
  {
    "word": "Debris",
    "meaning": "leftover pieces from something that is broken or destroyed",
    "examples_0": "The street cleaners will remove the debris left behind by the car accident.",
    "examples_1": "Upon inspection, the plumber realized some type of debris was preventing the water in the hose from reaching the washing machine."
  },
  {
    "word": "Debt",
    "meaning": "financial liabilities or obligations",
    "examples_0": "It looked as if filing for bankruptcy would be the only option for the business that was drowning in debt.",
    "examples_1": "One way to reduce debt is by paying more than the minimum monthly credit card payment."
  },
  {
    "word": "Debtor",
    "meaning": "a person who owes money to someone else",
    "examples_0": "Instead of paying back what he owed, the debtor filed bankruptcy on his debt.",
    "examples_1": "The creditor hired a collection company to hound the debtor into paying his medical bills."
  },
  {
    "word": "Debug",
    "meaning": "the process of identifying and removing errors from something, especially electronics",
    "examples_0": "A specialist was called out to debug the school?s software and to get things up and running again.",
    "examples_1": "Because of his high-level computer skills, it was easy for Benji to learn to debug and clear error codes."
  },
  {
    "word": "Debunk",
    "meaning": "to reveal the inaccuracies associated with a belief",
    "examples_0": "My attempts to debunk my young daughter?s belief in Santa Claus only ended with her crying for days.",
    "examples_1": "If the president conducts a number of town hall conversations, he believes he can debunk the myths about his healthcare proposal."
  },
  {
    "word": "Debut",
    "meaning": "the first public showing or appearance",
    "examples_0": "The piano prodigy made his musical debut when he was only three years old.",
    "examples_1": "At an early age, the award-winning actress made her theatrical debut in New York City."
  },
  {
    "word": "Debutante",
    "meaning": "a young upper-class woman who makes her first formal appearance in society",
    "examples_0": "The debutante teenager spent an enormous amount of money on a dress that she planned to wear only at her first appearance.",
    "examples_1": "Jessica entered the debutante program that trains upper-class young ladies who intend to make it in the fashion industry."
  },
  {
    "word": "Decade",
    "meaning": "a span of ten years",
    "examples_0": "Robert taught at a University in Colorado for a decade before leaving to teach elsewhere.",
    "examples_1": ""
  },
  {
    "word": "Decadence",
    "meaning": "state of moral or artistic decline or deterioration",
    "examples_0": "The gold trimmings in the celebrity?s bathroom are nothing but sheer decadence.",
    "examples_1": "While the church leaders are not opposed to a little self-indulgence now and then, they are opposed to a lifetime of decadence."
  },
  {
    "word": "Decant",
    "meaning": "to move one fluid or liquid from one container to another",
    "examples_0": "After asking the waiter for him to refill my glass, he took the large pitcher of iced tea to decant it from his pitcher into my glass.",
    "examples_1": "It was quite difficult to decant perfume from its original bottle into the beautiful vessel without smelling up the whole room."
  },
  {
    "word": "Decathlon",
    "meaning": "an athletic contest consisting of ten events",
    "examples_0": "I practice sprinting, running and jumping so that I can compete in the decathlon.",
    "examples_1": "Randy received a trophy at the Olympic decathlon after winning each of the ten different events."
  },
  {
    "word": "Decay",
    "meaning": "to rot or break down",
    "examples_0": "Frank loves to impress everyone with his knowledge of the rise and decay of the Roman Empire.",
    "examples_1": "After years of decay, the shoreline became so ugly that people started to avoid it entirely."
  },
  {
    "word": "Deceased",
    "meaning": "no longer alive",
    "examples_0": "Pretending to be deceased, Anthony laid silently in a pool of blood not daring to make a sound.",
    "examples_1": "The deceased relative did not leave a will, so the heirs fought over the inheritance in court."
  },
  {
    "word": "Deceitful",
    "meaning": "dishonest or untruthful in actions or words",
    "examples_0": "The lying city council was deceitful when telling the residents that the mayor hadn?t stolen the money.",
    "examples_1": "Deceitful and dishonest, the little girl continued to deny she had taken the cookie from the jar."
  },
  {
    "word": "Deceive",
    "meaning": "to mislead or trick",
    "examples_0": "The married man tried to deceive the women at the bar by taking off his wedding band.",
    "examples_1": "Because I sought to deceive my mother by printing my own report card, I was grounded for two months."
  },
  {
    "word": "Decelerate",
    "meaning": "to slow down or reduce the speed of something",
    "examples_0": "As the speedometer reached 100 miles per hour, the frightened passenger begged the driver to decelerate.",
    "examples_1": "The speeding man tried to decelerate when he saw the police officer parked beside the road."
  },
  {
    "word": "Decency",
    "meaning": "the attribute of being proper",
    "examples_0": "My neighbor has no sense of decency and often walks around naked in his backyard.",
    "examples_1": "When you are invited to dinner, decency requires you to bring a dish or a bottle of wine as a contribution."
  },
  {
    "word": "Decent",
    "meaning": "modest or proper",
    "examples_0": "Searching for a decent prom dress was difficult since most of the gowns showed way too much skin.",
    "examples_1": "Oliver?s mother hoped that he would bring home a decent girl who was respectable and had wholesome values."
  },
  {
    "word": "Deception",
    "meaning": "the act of lying, misleading or tricking someone",
    "examples_0": "I was warned beforehand that the lawyer would use deception to obtain a confession on the witness stand.",
    "examples_1": "Eric?s deception was impossible to detect, due to the training he received from the CIA."
  },
  {
    "word": "Deceptive",
    "meaning": "misleading",
    "examples_0": "The deceptive woman led me to believe that she was divorced when in fact she was married with children.",
    "examples_1": "The winds lightened up shortly before the storm hit, creating a deceptive appearance of calm."
  },
  {
    "word": "Decibel",
    "meaning": "a common measure of sound intensity",
    "examples_0": "The low decibel of the sound indicated that the noise could not have been louder than a low humming.",
    "examples_1": "Once the decibel was determined, it was proven that no one could hear the sound."
  },
  {
    "word": "Decide",
    "meaning": "to resolve or settle a problem or dispute",
    "examples_0": "When my wife can?t decide what to make for dinner, we order take out.",
    "examples_1": ""
  },
  {
    "word": "Deciduous",
    "meaning": "falling off because it is temporary",
    "examples_0": "During the fall, the deciduous shrubs in my yard will release their leaves.",
    "examples_1": "The baby?s deciduous teeth will start to fall out soon."
  },
  {
    "word": "Decimate",
    "meaning": "to destroy or greatly decrease in size or number",
    "examples_0": "It is likely the category five hurricane will decimate the small beach town.",
    "examples_1": "If the troops cross over the border, they will try to decimate the capital city."
  },
  {
    "word": "Decipher",
    "meaning": "to read something that appears impossible to be read",
    "examples_0": "There was no way I could decipher my doctor?s handwriting.",
    "examples_1": "When teenagers text, they use secret codes most parents cannot decipher."
  },
  {
    "word": "Decision",
    "meaning": "a choice made after thinking about it and considering options",
    "examples_0": "Wendy couldn?t make a dinner decision, so her husband ordered pizza.",
    "examples_1": "The couple?s choice to divorce was a hard decision for their children to accept."
  },
  {
    "word": "Decisive",
    "meaning": "resolving a problem",
    "examples_0": "When the soldier saw twice as many of their reinforcements coming over the bridge to help them fight the enemy, that was the decisive moment that he knew the war was over.",
    "examples_1": "Even though three players got injured, a decisive point in the game came as my star player scored four times in a row."
  },
  {
    "word": "Decisively",
    "meaning": "in a decisive manner",
    "examples_0": "In the capacity of my assignment the requirements are that I must be able to act decisively, without second guessing my decisions.",
    "examples_1": "As a trained nurse, I am able to react decisively in emergency situations."
  },
  {
    "word": "Declaim",
    "meaning": "to say something in a loud, passionate way",
    "examples_0": "The love-struck newlywed would declaim his love for his bride on the peak of the highest mountain top.",
    "examples_1": "Even though the defendant tried to declare her independence through a loud and passionate speech, few people believed she was innocent."
  },
  {
    "word": "Declaration",
    "meaning": "an important statement or announcement",
    "examples_0": "The king made a declaration that anyone who does not pay taxes will have their head chopped off.",
    "examples_1": "The Declaration of Independence formally announced that the thirteen American colonies regarded themselves as newly independent states."
  },
  {
    "word": "Declare",
    "meaning": "to make an official statement",
    "examples_0": "People speculate the candidate will declare an end to his campaign because of the massive drop in his poll numbers.",
    "examples_1": "If the king?s knights do not win the next battle, his majesty is sure to to declare the surrender of his realm."
  },
  {
    "word": "Declination",
    "meaning": "a formal refusal of something",
    "examples_0": "While I appreciated the invite I received to the fancy ball, I had other plans that night and had no choice but to offer a declination in response.",
    "examples_1": "Since it is rude to not respond to an invite, you should always give some sort of formal declination if you are invited to something you cannot attend."
  },
  {
    "word": "Decline",
    "meaning": "to move downwards, to fall, to drop",
    "examples_0": "A crack in the water tower is causing the water level to decline.",
    "examples_1": "The decline in homicides is due to better gun control."
  },
  {
    "word": "Declivity",
    "meaning": "downward slope",
    "examples_0": "Grandma has a hard time walking from her house to the lake due to her street?s slight declivity.",
    "examples_1": "There is a sudden declivity immediately after that left turn, making that segment of roadway deadly."
  },
  {
    "word": "Decode",
    "meaning": "to convert from an encrypted form to ordinary language",
    "examples_0": "The colonel wanted Schonberger to learn how to decode military letters for communication purposes.",
    "examples_1": ""
  },
  {
    "word": "Decomposition",
    "meaning": "the state or process of decaying or rotting",
    "examples_0": "We learned that decomposition is the process of breaking down organic substances into simpler forms of matter.",
    "examples_1": "After ripping off a leaf from a branch in my front yard, I placed it in my room to monitor the process of decomposition."
  },
  {
    "word": "Decorous",
    "meaning": "proper in behavior",
    "examples_0": "The director of the finishing school is a decorous woman known for her perfect social skills.",
    "examples_1": "When Bill walked away from a fight in church, he behaved in a decorous manner."
  },
  {
    "word": "Decorum",
    "meaning": "conduct that is appropriate and illustrates a person is well-mannered",
    "examples_0": "Although Kelly was upset she did not win the contest, she maintained decorum and congratulated the winner.",
    "examples_1": "Not understanding decorum at a formal dinner, Jake ate his salad with his dinner fork."
  },
  {
    "word": "Decoy",
    "meaning": "a person or object meant to lure something to danger",
    "examples_0": "Tony uses a worm decoy to bait fish.",
    "examples_1": "We caught a deer, using a decoy to trick it into the cage."
  },
  {
    "word": "Decrease",
    "meaning": "to become or make something become smaller in size, amount, or degree",
    "examples_0": "If he wants to save money for his trip, Christian will need to decrease the amount of money he spends during the week.",
    "examples_1": "If the homeowners decrease the price of the home by a few thousand dollars, they might be able to sell it."
  },
  {
    "word": "Decree",
    "meaning": "an official order issued by a legal authority",
    "examples_0": "The queen issued a royal decree which stopped people from visiting the royal gardens during the holidays.",
    "examples_1": "According to the court?s decree, all suspects can meet their accusers in court."
  },
  {
    "word": "Decrepit",
    "meaning": "beat-up from wear or age",
    "examples_0": "Because the decrepit building is such an eyesore, it is being demolished in a week.",
    "examples_1": "The decrepit car refused to start."
  },
  {
    "word": "Decry",
    "meaning": "to denounce as damaging or bad",
    "examples_0": "The liberal news media is constantly trying to decry the efforts of the country?s conservative president.",
    "examples_1": "After the immigration bill was passed, the racist groups started to decry the features of the act."
  },
  {
    "word": "Dedication",
    "meaning": "hard work and effort",
    "examples_0": "Josh displayed remarkable dedication to his job by working around the clock to meet his deadlines.",
    "examples_1": "As the president of a large corporation, Jeff must act with dedication and integrity to be successful."
  },
  {
    "word": "Deduce",
    "meaning": "to form a conclusion using logical reasoning",
    "examples_0": "By counting backwards, the clerk was able to deduce the correct change to give back to the customer.",
    "examples_1": "As soon as the police saw the planted evidence, they were able to deduce the homeowner had faked the robbery."
  },
  {
    "word": "Deduct",
    "meaning": "to subtract or take away from the total",
    "examples_0": "We must deduct our expenses from our sales to determine our profit.",
    "examples_1": "There is no way to deduct all of the incidentals without going in the red."
  },
  {
    "word": "Deductible",
    "meaning": "the amount of money an individual pays for expenses before his insurance plan begins to pay",
    "examples_0": "After the car accident, the insuree had to pay a five-hundred-dollar deductible to get his car fixed.",
    "examples_1": "Every year, I must pay a thousand-dollar deductible before my health insurance company will pay for any of my medications."
  },
  {
    "word": "Deed",
    "meaning": "an action or effort",
    "examples_0": "After doing a good deed for his grandmother, John was rewarded with a pat on the back.",
    "examples_1": "The hero was honored for his brave deed after saving several children from a burning building."
  },
  {
    "word": "Deem",
    "meaning": "to view in a particular manner",
    "examples_0": "The principal will probably deem the boy?s behavior as upsetting and worthy of a suspension.",
    "examples_1": "Because I am still running a very high temperature, the doctor does not deem me fit to leave the hospital."
  },
  {
    "word": "Deep-rooted",
    "meaning": "deeply implanted or established",
    "examples_0": "The woman?s deep-rooted hatred for her neighbor had started when she was just a child.",
    "examples_1": "Because of her deep-rooted belief?s the woman refused to believe other gods existed."
  },
  {
    "word": "Deep",
    "meaning": "extending far down from the surface",
    "examples_0": "The ocean is so deep that huge boats have been able to sink to the bottom, never to be seen again.",
    "examples_1": "After running off of the road, the vehicle careened into a seemingly bottomless ditch that was several feet deep."
  },
  {
    "word": "Deface",
    "meaning": "to damage or disfigure something, especially a surface",
    "examples_0": "They used spray paint to deface the professor?s portrait.",
    "examples_1": "If unguarded, thugs will deface the monument."
  },
  {
    "word": "Defamation",
    "meaning": "harming a person?s reputation by saying or writing things that are not true",
    "examples_0": "The newspaper was sued for defamation after publishing lies about a celebrity.",
    "examples_1": "In a defamation trial, the plaintiff must prove his or her reputation was actually harmed by a statement."
  },
  {
    "word": "Defamatory",
    "meaning": "something that is damaging to one?s reputation",
    "examples_0": "The politician?s defamatory comments were untrue but still ruined his opponent?s standing in the community.",
    "examples_1": "Gretchen threatened to sue the author over the slanderous and defamatory comments she made about Gretchen."
  },
  {
    "word": "Default",
    "meaning": "to be unsuccessful at satisfying a commitment",
    "examples_0": "The bank will repossess your car if you default on your loan payments.",
    "examples_1": "According to my religious grandmother, you default on your commitment to God when you file for divorce."
  },
  {
    "word": "Delectable",
    "meaning": "tasting delicious",
    "examples_0": "When you go to a five-star restaurant, you should expect nothing but a delectable meal that exceeds your expectations.",
    "examples_1": "I could not stop eating the delectable dish."
  },
  {
    "word": "Delectation",
    "meaning": "pleasure; enjoyment",
    "examples_0": "For your delectation, a spread of delicious appetizers will be served throughout the cocktail hour.",
    "examples_1": "A playlist of popular music was put together for the party guest?s delectation."
  },
  {
    "word": "Delegate",
    "meaning": "to give tasks or responsibilities to others",
    "examples_0": "Because Janice cannot do all of the tasks, she has to learn to delegate work to her employees.",
    "examples_1": "The manager will delegate many of his duties to the new assistant manager."
  },
  {
    "word": "Delete",
    "meaning": "to remove, get rid of or erase, especially written, printed or data",
    "examples_0": "Users are advised to update their antivirus software and delete any suspicious emails without opening them.",
    "examples_1": ""
  },
  {
    "word": "Deleterious",
    "meaning": "harmful",
    "examples_0": "Because I know alcohol is deleterious, I rarely drink more than one glass of wine.",
    "examples_1": "The overpopulation of large snakes in the forest is deleterious to the wild rat population."
  },
  {
    "word": "Deletion",
    "meaning": "the obliteration or omission of information",
    "examples_0": "Once I noticed the deletion of the file on the computer, I worried because I knew I could never get the file back.",
    "examples_1": "Since I did not purchase the goods that were stated on my credit card bill, I demanded a deletion of the cost from my bill."
  },
  {
    "word": "Deliberate",
    "meaning": "to seriously contemplate",
    "examples_0": "We need to deliberate our rest stops before we make hotel reservations for the road trip.",
    "examples_1": "During the teacher?s meeting, we were asked to deliberate our testing goals for the school year."
  },
  {
    "word": "Deliberation",
    "meaning": "a thorough consideration",
    "examples_0": "After only one hour of deliberation, the jury came back with a guilty verdict.",
    "examples_1": "I cannot give the proposal the deliberation it deserves because I am facing a tight deadline."
  },
  {
    "word": "Delicacy",
    "meaning": "a food that is expensive and/or specific to a region or culture",
    "examples_0": "Caviar is considered a delicacy because only the rich can afford to eat it.",
    "examples_1": "Eating rotten sharks that have fermented for over a year is a cultural delicacy in Iceland."
  },
  {
    "word": "Delicate",
    "meaning": "weakly fragile; frail",
    "examples_0": "The delicate flower was broken at the stem during the first storm of the season.",
    "examples_1": "Because she was so delicate, the girl?s parents didn?t want her playing contact sports."
  },
  {
    "word": "Delicious",
    "meaning": "tasty; yummy",
    "examples_0": "The chef crafted delicious recipes that tasted not only amazing but also looked extraordinary.",
    "examples_1": "Although my parent?s think that Grandmother?s stew is the most delicious dish, I prefer her yummy peach cobbler."
  },
  {
    "word": "Delight",
    "meaning": "a strong feeling of happiness or pleasure",
    "examples_0": "Both of our excited parents delight in the fact that a new baby will be born soon.",
    "examples_1": "I realize that killing others during combat is part of being a soldier, but I don?t relish or delight in that fact."
  },
  {
    "word": "Delighted",
    "meaning": "greatly pleased",
    "examples_0": "We were truly delighted to see our grandparents at the family reunion this year.",
    "examples_1": "After searching for hours, I was delighted to find my missing earrings."
  },
  {
    "word": "Delightful",
    "meaning": "pleasant; enjoyable",
    "examples_0": "The newlyweds had a delightful dinner and have enjoyed every moment of their honeymoon.",
    "examples_1": "Listening to my daughters? beautiful singing voices is always a delightful experience."
  },
  {
    "word": "Delimit",
    "meaning": "to measure or set physical boundaries",
    "examples_0": "After the conflict broke out in Yugoslavia, world leaders came together to delimit boundaries and break the region into individual countries.",
    "examples_1": "Napoleon sent out stealthy scouts to delimit the scope of the areas he wished to conquer and estimate the number of soldiers necessary to succeed."
  },
  {
    "word": "Delineate",
    "meaning": "to clearly describe or portray something",
    "examples_0": "Before I began to plant my seeds, I will delineate the rows of my garden to make sure every vegetable grows in a precise line.",
    "examples_1": "Jason put a fence up to delineate his property from his neighbor?s."
  },
  {
    "word": "Delinquency",
    "meaning": "failure to pay a debt that is owed",
    "examples_0": "A delinquency on the student?s account meant that he still owed lunch money from last year.",
    "examples_1": "Rising delinquency rates on credit cards means that more and more people are unable to pay their bills."
  },
  {
    "word": "Delinquent",
    "meaning": "late in paying what is owed or past due",
    "examples_0": "With so many bills delinquent, Kevin had to look for a second job to help him earn enough to catch up.",
    "examples_1": "Without a way to come up with the delinquent mortgage payments, the couple have no choice but to give up their home."
  },
  {
    "word": "Deliquesce",
    "meaning": "to melt and disappear",
    "examples_0": "I bet the sidewalk is so hot that the ice cube will deliquesce the moment it touches it.",
    "examples_1": "Because the ground is too warm, the snow will deliquesce as soon as it hits the ground."
  },
  {
    "word": "Delirious",
    "meaning": "not able to speak or think clearly especially because of mental confusion or illness",
    "examples_0": "When my little sister caught the flu, she became delirious from the fever.",
    "examples_1": "Delirious with grief, my friend could barely speak at her dad?s funeral."
  },
  {
    "word": "Delirium",
    "meaning": "a condition of extreme happiness and excitement",
    "examples_0": "As soon as the young girl saw all of her birthday presents, she leaped in delirium.",
    "examples_1": "Jane was in delirium when she received her long-awaited wedding proposal."
  },
  {
    "word": "Deliver",
    "meaning": "bring and hand over a letter, parcel, or ordered goods to the proper recipient or address",
    "examples_0": "The eager young girl looked stared out the window, anxiously waiting for the mailman to deliver her birthday present.",
    "examples_1": "She didn?t want to deliver pizza for the rest of her life, but for now she made decent money and it paid for college."
  },
  {
    "word": "Deliverance",
    "meaning": "usually asked or prayed help or saving from a dangerous situation",
    "examples_0": "The woman prayed for deliverance from her rude mother in law.",
    "examples_1": "The passengers on the sinking ship hoped for deliverance from certain death by a rescue crew."
  },
  {
    "word": "Delivery",
    "meaning": "something taken to a person or place by someone else",
    "examples_0": "The truck driver made a delivery of boxes to the back of the building.",
    "examples_1": "Every Monday, a delivery of flowers is sent to the office?s front desk."
  },
  {
    "word": "Delta",
    "meaning": "triangular land that was created when a large stream divided and then emptied into the ocean",
    "examples_0": "While flying close to the shore of the Pacific Ocean, Sarah noticed the squiggly lines of the main river that led to the delta.",
    "examples_1": "Fish from the local rivers will frequently make their way to the ocean through the way of the delta."
  },
  {
    "word": "Delude",
    "meaning": "to manipulate someone?s judgment",
    "examples_0": "The cult leader was able to easily delude the innocent girl into believing he was a god.",
    "examples_1": "If the pimp can delude the teenager into thinking her parents no longer love her, he will be able to lead her into a life of prostitution."
  },
  {
    "word": "Deluge",
    "meaning": "a large number of things occurring in the same instance",
    "examples_0": "After a deluge of tornadoes, most of the homes in the town were destroyed.",
    "examples_1": "The noted physician received a deluge of awards for his work in AIDS research."
  },
  {
    "word": "Delusion",
    "meaning": "a false idea or a belief that is not true",
    "examples_0": "It was heartbreaking to witness my ailing grandmother?s delusion that her deceased husband was alive.",
    "examples_1": "Though she is popular, my classmate is under the delusion that everyone likes her."
  },
  {
    "word": "Delusional",
    "meaning": "suffering from or characterized by delusions",
    "examples_0": "She held a delusional belief that the sky turned black at night, when it is always blue.",
    "examples_1": "My sister is delusional because she thinks that every guy has a crush on her."
  },
  {
    "word": "Delusive",
    "meaning": "false or misleading",
    "examples_0": "The delusive ad made it seem that the senator had did things she had not.",
    "examples_1": "Because he wanted patients to come back, the lying doctor gave them delusive information."
  },
  {
    "word": "Delve",
    "meaning": "to search thoroughly and carefully for information",
    "examples_0": "We had many books to delve into during our research for school.",
    "examples_1": "Because she was planning a trip, the woman began to delve into a search for plane tickets."
  },
  {
    "word": "Demagogue",
    "meaning": "a political leader who tries to influence people by making emotional speeches",
    "examples_0": "Todd wrote an excellent paper describing Hitler as a demagogue.",
    "examples_1": "The agitators were led by an angry demagogue whose mission was to overthrow the government."
  },
  {
    "word": "Demand",
    "meaning": "to command or insist that someone do something",
    "examples_0": "The teachers demand that we do our homework, so we make sure to complete it on time.",
    "examples_1": "When their food was almost an hour late, the customers began to demand their money back."
  },
  {
    "word": "Demanded",
    "meaning": "commanded or insisted that someone do something",
    "examples_0": "The upset customer demanded to see the manager after the clerk was rude to her at the counter.",
    "examples_1": "In the kitchen, the bossy cook demanded that the staff speed up their work."
  },
  {
    "word": "Demanding",
    "meaning": "an attitude of expecting or making others meet high standards or expectations",
    "examples_0": "The General is an extremely demanding commander, but only because he knows his troops are capable of exemplary performance.",
    "examples_1": "The young Prince?s father was extremely demanding, and it seemed that no matter what he did he could not please the King."
  },
  {
    "word": "Demarcate",
    "meaning": "to mark the limits or boundaries of something",
    "examples_0": "She was convinced that the school?s administration should demarcate social studies grades from science grades.",
    "examples_1": "The fence was put in place to demarcate one piece of property from the next."
  },
  {
    "word": "Demean",
    "meaning": "to make someone feel inferior",
    "examples_0": "The plantation owner took away the slaves? given names in order to demean them.",
    "examples_1": "When my ex-husband drinks too many beers, he will often try and demean me by pointing out my weaknesses."
  },
  {
    "word": "Demeanor",
    "meaning": "an individual?s displayed behavior",
    "examples_0": "Jack?s disruptive demeanor got him kicked out of school for a week.",
    "examples_1": "When Helen is working as a hostage negotiator, she always has such a calm demeanor."
  },
  {
    "word": "Demented",
    "meaning": "mental instability that drives strange behavior spurred by extreme emotions",
    "examples_0": "Kaia was heartbroken when she found out her grandfather was demented and would soon lose all memory of her.",
    "examples_1": "After his demented wife purposely tried to burn their house down, he had her committed to a psychiatric ward."
  },
  {
    "word": "Dementia",
    "meaning": "progressive decline in cognitive function due to damage or disease in the brain",
    "examples_0": "Diagnosed as dementia, Maureen now had a name for the forgetfulness that made her life so difficult.",
    "examples_1": "Because of his dementia, the man could no longer remember how to do daily tasks."
  },
  {
    "word": "Demerit",
    "meaning": "the negative aspects of something",
    "examples_0": "This idea has both a merit and a demerit to it, but I haven?t decided whether or not the benefit is greater than the cost.",
    "examples_1": "My partner proposed a plan for our current predicament, but I decided that the demerit was too costly compared to the benefit of it."
  },
  {
    "word": "Demesne",
    "meaning": "land attached to a manor that was used by the lord and not the peasants (workers)",
    "examples_0": "Staring out at his demesne, the lord of the castle was in awe of all the land that he had acquired.",
    "examples_1": "The lord decided to rent out his demesne in an attempt to get even more money from the peasants."
  },
  {
    "word": "Demise",
    "meaning": "the end of a period or lifespan",
    "examples_0": "My mother?s demise occurred unexpectedly in a traffic accident.",
    "examples_1": "Since Jim was so young, everyone was stunned by his heart attack and sudden demise."
  },
  {
    "word": "Democracy",
    "meaning": "a government by the people where the majority rules",
    "examples_0": "If you are opposed to democracy, you do not believe every individual has a voice.",
    "examples_1": "Without democracy, one person could tell billions of people what to do."
  },
  {
    "word": "Democrat",
    "meaning": "a supporter of democratic government",
    "examples_0": "Even though I am a Republican, I am technically a democrat to the rest of the world because I support a democratic system of government.",
    "examples_1": "If you support a system where people have the right to vote on their leaders, you are a democrat because of the system of government you support."
  },
  {
    "word": "Demography",
    "meaning": "the study of human inhabitants and how their populations vary over time",
    "examples_0": "As the factories closed and people relocated, the demography of the town changed.",
    "examples_1": "Deaths caused by drinking polluted water have had a negative impact on the demography of the third world nation."
  },
  {
    "word": "Demolish",
    "meaning": "to destroy something, usually by tearing it down",
    "examples_0": "Protesters chained themselves to the old church in an attempt to stop the construction crew from being able to demolish it.",
    "examples_1": "The city has threatened to demolish the couple?s run-down home if they didn?t clean the place up."
  },
  {
    "word": "Demonic",
    "meaning": "to act or be controlled by a wicked spirit usually causing evil",
    "examples_0": "As the priest entered the room to conduct the exorcism, he truly felt the demonic presence creating an eerie feeling.",
    "examples_1": "During the horror movie, the demonic doll would punish the family by throwing knives at them."
  },
  {
    "word": "Demonize",
    "meaning": "to portray something or someone as evil or wicked",
    "examples_0": "In divorce court, the bitter wife tried to demonize her ex and pain him in a bad light to the judge.",
    "examples_1": "Although some people demonize psychic readings as evil, others think it?s okay to try and predict the future."
  },
  {
    "word": "Demonstrable",
    "meaning": "able to be verified or proven",
    "examples_0": "Whether you believe in gravity or not is irrelevant, because the force is demonstrable and best shown by dropping anything, like an apple...or an apple iPhone.",
    "examples_1": "Though the company has demonstrable results to show the product works, many people still think it is a scam."
  },
  {
    "word": "Demonstrate",
    "meaning": "to prove something by showing examples",
    "examples_0": "The basketball player hopes to demonstrate his skill during tryouts, so he can make the team this year.",
    "examples_1": "During his final, the medical student had to demonstrate his ability to draw blood from a patient."
  },
  {
    "word": "Demonstrative",
    "meaning": "openly affectionate",
    "examples_0": "Because Susan was raised in a family that was far from demonstrative, she is not comfortable sharing her emotions.",
    "examples_1": "Everyone at the table was uncomfortable when the demonstrative couple would not stop kissing during Christmas dinner."
  },
  {
    "word": "Demoralize",
    "meaning": "to cause someone to lose hope or confidence",
    "examples_0": "The rebels tried their best to demoralize their captive and cause him to give up hope of a rescue.",
    "examples_1": "My boss isn?t encouraging and seems to demoralize the whole office with her critical complaining."
  },
  {
    "word": "Demote",
    "meaning": "someone who is transferred to a lower position or rank",
    "examples_0": "An employer who has lost confidence in the ability of an employee may demote him.",
    "examples_1": ""
  },
  {
    "word": "Demur",
    "meaning": "to object or protest to something",
    "examples_0": "Because the DA decided to demur the low bond, it was set at a higher fee.",
    "examples_1": "I wanted to stand up and demur but decided against objecting to the marriage."
  },
  {
    "word": "Demure",
    "meaning": "shy and modest; reserved",
    "examples_0": "My sister is too outgoing for anyone to ever accuse her of being demure.",
    "examples_1": "While Helen is quite demure in her job as a librarian, at night she becomes a wild karaoke queen."
  },
  {
    "word": "Denial",
    "meaning": "a statement that something is not true",
    "examples_0": "The suspect?s denial of the crime convinced many people that he hadn?t robbed the store.",
    "examples_1": "The husband?s denial of the affair tricked his wife into thinking he was faithful."
  },
  {
    "word": "Denigrate",
    "meaning": "to assault someone?s character or reputation",
    "examples_0": "On the talk show, the mean host usually tries to denigrate her guests by reminding them of their misdeeds.",
    "examples_1": "You should not denigrate other people unless you want individuals to attack your reputation in retaliation."
  },
  {
    "word": "Denizen",
    "meaning": "a person, animal, or plant that lives in or often is found in a particular place or region",
    "examples_0": "My husband is a denizen of the sand who practically lives at the beach.",
    "examples_1": "Since my husband has lived in Georgia all his life, he is a denizen of the state."
  },
  {
    "word": "Denomination",
    "meaning": "an autonomous branch of the Christian church, such as Baptist, Protestant, etc.",
    "examples_0": "Even though I am part of a different denomination than my Uncle, we still believe roughly the same religious doctrine, and our church branches only have very minor differences.",
    "examples_1": "When it comes to religion, a new denomination is often formed when part of a church secedes from the main body because they disagree over a specific ideal or belief."
  },
  {
    "word": "Denotation",
    "meaning": "the literal meaning of a word",
    "examples_0": "While the word ?rock? has come to describe a certain form of music, its literal denotation refers only to actual stone.",
    "examples_1": "Certain words have come to mean different things in today?s society, but the denotation of those words still means the same thing as they did in the past."
  },
  {
    "word": "Denote",
    "meaning": "to point out something",
    "examples_0": "If you get lost, look for the two red flags that denote the hotel entrance.",
    "examples_1": "The colored stickers on your desks denote your team during the scavenger hunt."
  },
  {
    "word": "Denouement",
    "meaning": "the ending of a literary work, musical composition, or a sequence of actions",
    "examples_0": "The film ended with a denouement that left the audience speechless.",
    "examples_1": "Because the book?s denouement left some unanswered questions, the author is currently writing a sequel."
  },
  {
    "word": "Denounce",
    "meaning": "to criticize harshly and publicly",
    "examples_0": "The dictator made a speech to denounce the actions of his enemies.",
    "examples_1": "Are you really surprised that the victim?s family is going to denounce the killer?s not-guilty verdict?"
  },
  {
    "word": "Dense",
    "meaning": "crowded together; packed",
    "examples_0": "The forest was so dense we could barely walk between the trees.",
    "examples_1": "As we walked through the jungle, we had to cut our way through the dense vegetation."
  },
  {
    "word": "Density",
    "meaning": "how compact or concrete something is",
    "examples_0": "The high density city has a lot of people jampacked into one space.",
    "examples_1": "Although the object looked like it would float, its concrete density caused it to sink quickly."
  },
  {
    "word": "Dental",
    "meaning": "relating to the teeth",
    "examples_0": "The dental office is running a special where you get a free teeth cleaning and 20 percent off any other tooth-related services.",
    "examples_1": "Dental decay can be caused by eating too many sweets and not brushing your teeth afterward."
  },
  {
    "word": "Dentifrice",
    "meaning": "a paste, powder, liquid, or other preparation for cleaning the teeth",
    "examples_0": "The dentist urged that selecting the right dentifrice is important for dental health.",
    "examples_1": "Without dentifrice on her toothbrush, the girl was not able to clean her teeth correctly."
  },
  {
    "word": "Denunciation",
    "meaning": "an announcement or statement that is shared openly to criticize a thing or a person",
    "examples_0": "The minister?s denunciation of his ex-wife during the service came as a surprise to his congregation.",
    "examples_1": "During the press conference, the civil rights leader made a denunciation about brutal police tactics."
  },
  {
    "word": "Deny",
    "meaning": "to say that something is not true",
    "examples_0": "The traffic officer will definitely give you a ticket if you lie and deny that you were speeding.",
    "examples_1": "My boss continues to deny that he owes me money and refuses to give me the rest of my pay."
  },
  {
    "word": "Depart",
    "meaning": "to leave; exit",
    "examples_0": "The train will depart from the station at exactly twelve o?clock.",
    "examples_1": "Unable to watch her son depart for war, the grieving mother turned away from the bus."
  },
  {
    "word": "Department",
    "meaning": "a division or sector of a larger organization such as a government agency",
    "examples_0": "Emma transferred to a different department within the same company.",
    "examples_1": "Part of the federal government, the department of health recommends that all children receive their vaccines."
  },
  {
    "word": "Departure",
    "meaning": "leaving; parting",
    "examples_0": "Crying at the gate, the soldier?s wife could barely watch his departure.",
    "examples_1": "The departure time on Saturday is different than the time the bus leaves on Sunday."
  },
  {
    "word": "Dependable",
    "meaning": "able to be depended on",
    "examples_0": "Although I do not trust mechanics, I am happy to use Chris because of how dependable he is.",
    "examples_1": "During the football game the dependable receiver kept on dropping passes, making the coach to throw his hands up in despair."
  },
  {
    "word": "Dependence",
    "meaning": "the attribute of relying on someone or something else",
    "examples_0": "As a teenager, I have a dependence on my parents to take care of and provide for me, though that will change when I am an adult.",
    "examples_1": "A young baby has great dependence on its parents, as it is too young to care for itself and will die without care."
  },
  {
    "word": "Dependency",
    "meaning": "a state of reliance or dependence on something else",
    "examples_0": "The colonists? dependency on Native Americans meant they would starve without their help.",
    "examples_1": "Because of his dependency on illegal drugs, the man felt he could not live without them."
  },
  {
    "word": "Dependent variable",
    "meaning": "the event expected to change during a science experiment",
    "examples_0": "During the candle burning experiment, the height of the candle is the dependent variable.",
    "examples_1": "Looking at the dependent variable, the students observed how high the plants had grown after adding different amounts of water."
  },
  {
    "word": "Dependent",
    "meaning": "needful; reliant on something or someone else",
    "examples_0": "Our kitten will not be placed in a new home until she is no longer dependent on her mother for milk.",
    "examples_1": "Because she was still dependent on her parents for financial help, the young woman allowed them to claim her on their tax return."
  },
  {
    "word": "Depict",
    "meaning": "to describe in words or pictures",
    "examples_0": "The drawings on the cave walls depict the lives of the earliest men on the planet.",
    "examples_1": "In your poem, you should use words to depict a teenage girl?s heartache."
  },
  {
    "word": "Deplete",
    "meaning": "to exhaust the supply",
    "examples_0": "The company will be in ruins if we deplete our financial resources.",
    "examples_1": "When we continually cut down forests, we are choosing to deplete one of our greatest resources."
  },
  {
    "word": "Deplorable",
    "meaning": "bad enough to deserve censure",
    "examples_0": "John?s deplorable behavior is going to get him arrested one day.",
    "examples_1": "When I saw the pictures of the dead women and children, I could think of no reason for such a deplorable act."
  },
  {
    "word": "Deplore",
    "meaning": "to express displeasure",
    "examples_0": "Teachers deplore student behaviors that distract from lectures.",
    "examples_1": "If you deplore the environmental practices of the company, you should not purchase their products."
  },
  {
    "word": "Deploy",
    "meaning": "to make ready for use or combat",
    "examples_0": "The police officer hoped he would not have to deploy his weapon.",
    "examples_1": "To help end the dictator?s rule, the United Nations will deploy troops to the small island country."
  },
  {
    "word": "Depone",
    "meaning": "to swear in a court that the testimony, statement, or evidence given is the absolute truth",
    "examples_0": "Witnesses to a crime are asked to depone in front of a judge and jury that their statement is true.",
    "examples_1": "Forensic scientists are often asked to depone that their evidence is accurate under threat of arrest."
  },
  {
    "word": "Deport",
    "meaning": "to evict, especially from a country",
    "examples_0": "The immigration system threatened to deport my Venezuelan maid.",
    "examples_1": "The man filed for citizenship as a means to avoid a possible forced deport."
  },
  {
    "word": "Deportation",
    "meaning": "the act of removing a foreigner out of a country",
    "examples_0": "Due to the father?s criminal behavior, his whole family faced deportation to Brazil.",
    "examples_1": "The president believes in the deportation of all undocumented aliens living in the country."
  },
  {
    "word": "Deportment",
    "meaning": "the way in which one carries oneself",
    "examples_0": "The homeless woman always held her head high and walked with the deportment of a princess.",
    "examples_1": "When I was a kid, my mother was constantly reminding me to sit up straight and mind my deportment."
  },
  {
    "word": "Depose",
    "meaning": "to forcefully take a position away from a person",
    "examples_0": "A coalition of countries is trying to depose the island dictator.",
    "examples_1": "Working together the princes hope to depose their father and assume power."
  },
  {
    "word": "Deposit",
    "meaning": "to set down or place someone or something in a particular place",
    "examples_0": "The woman stopped by the bank to deposit her paycheck in her account.",
    "examples_1": "Birds deposit their eggs in a high nest away from hungry predators."
  },
  {
    "word": "Deposition",
    "meaning": "the rejection of an individual from an office",
    "examples_0": "After the deposition of the president, the vice-president was asked to lead the country.",
    "examples_1": "The deposition created a vacancy on the school board."
  },
  {
    "word": "Depot",
    "meaning": "a storehouse or warehouse where large quantities of food or supplies are stored",
    "examples_0": "Tons of pallets with bulk supplies were sent to the depot to be hoarded for winter.",
    "examples_1": "The train depot was filled with building materials that were delivered by the incoming trains."
  },
  {
    "word": "Depravity",
    "meaning": "moral corruption; wickedness",
    "examples_0": "Although Linda was raised in a religious household, she now lives a life filled with depravity.",
    "examples_1": "That kind of depravity will get you arrested for public indecency!"
  },
  {
    "word": "Deprecate",
    "meaning": "to criticize or express disapproval",
    "examples_0": "Unfortunately my mother-in-law?s urge to deprecate me is stronger than her urge to inspire me.",
    "examples_1": "Coach Jones is a good coach because he does not deprecate his players even when they make mistakes."
  },
  {
    "word": "Deprecatory",
    "meaning": "belittling, critical",
    "examples_0": "Although he claimed it was all in fun, the man?s deprecatory comments were hurtful to those they ridiculed.",
    "examples_1": "The man?s deprecatory remarks about his wife?s weight led her to be depressed and insecure."
  },
  {
    "word": "Depreciate",
    "meaning": "to drop in value or worth over a period of time",
    "examples_0": "The new car starts to depreciate in value as soon as it is driven off the lot.",
    "examples_1": "Because John was not financially savvy, he blew most of his lottery winnings on items that seemed to depreciate quickly."
  },
  {
    "word": "Depreciation",
    "meaning": "the decline in value of assets",
    "examples_0": "The depreciation of a new vehicle is very high when it rolls off of the dealer?s lot.",
    "examples_1": "Although I wanted to sell my china cabinet, I changed my mind when I found out how little it was worth due to its depreciation."
  },
  {
    "word": "Depredation",
    "meaning": "damage or destruction",
    "examples_0": "The hurricane left much depredation in the city.",
    "examples_1": "Because of depredation caused by hungry wolves, many chicken farmers are losing large sums of money."
  },
  {
    "word": "Depressant",
    "meaning": "a substance that causes you to feel sad or despondent",
    "examples_0": "Because alcohol is a depressant, it can cause those who drink it to become sad and withdrawn.",
    "examples_1": "Michael?s therapist explained that negative thoughts could serve as a depressant and cause him to become gloomy and anxious."
  },
  {
    "word": "Depressed",
    "meaning": "feeling extremely sad and unhappy",
    "examples_0": "The depressed mother decided to talk to a counselor about her feelings of unhappiness.",
    "examples_1": "Because she is so depressed, Barbara cries in her bed all day long."
  },
  {
    "word": "Depression",
    "meaning": "a state of mind producing serious, long-term lowering of enjoyment of life; period of unhappiness",
    "examples_0": "A small number of people suffer from depression so severe that they may need to be admitted to the hospital.",
    "examples_1": ""
  },
  {
    "word": "Depression",
    "meaning": "a mood disorder characterized by low self-esteem, feelings of sadness, and a general loss of interest in things",
    "examples_0": "After falling into a deep depression, Gina went to the doctor to ask for help with her extremely somber mood.",
    "examples_1": "Because his sister stayed in bed all day and wouldn?t stop crying, Lenny was sure she was suffering from depression."
  },
  {
    "word": "Deprivation",
    "meaning": "the lack of something which is viewed as necessary",
    "examples_0": "After a couple of days of sleep deprivation, I become really grouchy.",
    "examples_1": "The child was incredibly pale after enduring light depravation while locked in a basement."
  },
  {
    "word": "Deprive",
    "meaning": "to take something away (and keep it away); deny someone of something",
    "examples_0": "Max is a racist who wants to deprive black people from their right to vote on election day.",
    "examples_1": "If implemented, the President?s crazy plan will deprive seniors of adequate healthcare."
  },
  {
    "word": "Deprived",
    "meaning": "going without things that are required for a healthy or happy existence",
    "examples_0": "If the plant is deprived of water, it will die.",
    "examples_1": "Jane fell asleep while driving because she had been deprived of sleep for nearly two days."
  },
  {
    "word": "Depth",
    "meaning": "how deep something is as measured from top to bottom",
    "examples_0": "The depth of the lake hasn?t been measured, but the water seems very shallow.",
    "examples_1": "Measuring the depth of the ocean, scientists hope they can find out more about what lies below."
  },
  {
    "word": "Deputation",
    "meaning": "a body of individuals sent to speak for a group or nation",
    "examples_0": "Carl was a member of the deputation of local businessmen who attended the state tourism convention.",
    "examples_1": "When selecting a deputation to speak to the principal about our event proposal, we should choose our best students."
  },
  {
    "word": "Deputize",
    "meaning": "to make someone a deputy a second in command or assistant who usually takes charge when his or her superior is absent",
    "examples_0": "The sheriff made the decision to deputize lieutenant McDaniel so that he could run the jail in his place.",
    "examples_1": "Because he is so busy, the mayor will need to deputize someone to handle his important in-office business."
  },
  {
    "word": "Deracinate",
    "meaning": "to pull up and move from a location or environment",
    "examples_0": "When the careless neighbor failed to pay his rent for months, the landlord would immediately deracinate them even if it made them homeless.",
    "examples_1": "Many refugees would deracinate from their war-torn hometown because they waited until the last minute to leave."
  },
  {
    "word": "Derail",
    "meaning": "to come off the tracks",
    "examples_0": "Since significant damage was done to the tracks, the train would derail if it passed over the damage.",
    "examples_1": "McIntosh Railroad will be responsible for the injuries when any of trains derail on their tracks."
  },
  {
    "word": "Derange",
    "meaning": "to cause someone to go insane or to cause disorder in something",
    "examples_0": "Being stranded on a tiny island surrounded by sharks would derange anyone.",
    "examples_1": "We feared that our sailboat would derange due to Fred?s nonstop tinkering with the motor."
  },
  {
    "word": "Deranged",
    "meaning": "disturbed or upset, especially mentally",
    "examples_0": "The deranged gunman started shooting wildly into the mall while shouting violent and hateful curses.",
    "examples_1": "I opened the door to find a deranged looking beggar staring back at me with a menacing look in his eyes that scared me to death."
  },
  {
    "word": "Derelict",
    "meaning": "in bad shape as a result of neglect",
    "examples_0": "Out of fear for my safety, I chose not to walk inside of the derelict barn.",
    "examples_1": "Our small town has a large number of derelict buildings that need to be demolished."
  },
  {
    "word": "Dereliction",
    "meaning": "the neglect or disregard for something or someone",
    "examples_0": "Riots brought about the dereliction of looters who could care less about the shop owners when they vandalized their stores.",
    "examples_1": "Due to the dereliction in the performance of her duties, the nanny was fired because she would go to parties instead of watching the baby."
  },
  {
    "word": "Deride",
    "meaning": "to subject to bitter ridicule",
    "examples_0": "The movie critic took every opportunity to deride the A-list actor for making the awful film.",
    "examples_1": "When I am a parent, I will not deride my children and make them feel worthless."
  },
  {
    "word": "Derision",
    "meaning": "Severe mocking and ridiculing of someone",
    "examples_0": "The kids erupted in derision when a handicapped man entered in the classroom.",
    "examples_1": "His stance on gun control drew derision from the pacifists."
  },
  {
    "word": "Derisively",
    "meaning": "in a mocking and demeaning manner",
    "examples_0": "The bullies laughed derisively at the boy as he presented his project.",
    "examples_1": "When she didn?t win, my jealous competitor congratulated me derisively."
  },
  {
    "word": "Derisory",
    "meaning": "laughably small or inadequate",
    "examples_0": "The company's derisory offer of a 1 percent pay rise has been overwhelmingly rejected by the workforce, who are demanding a rise of 3 percent.",
    "examples_1": ""
  },
  {
    "word": "Derivation",
    "meaning": "the origin from which something is developed",
    "examples_0": "The word doesn?t have a specific derivation, but it probably comes from a French phrase.",
    "examples_1": "People wondered about the derivation of the painting, but its origin is unknown."
  },
  {
    "word": "Derivative",
    "meaning": "an object or idea that is produced from something else",
    "examples_0": "The new antibiotic is listed as a derivative of penicillin because it was produced from a penicillin base.",
    "examples_1": "When Anna named her children Breanna and Brent, she gave them both names that were a derivative of her mother?s name, Brenda."
  },
  {
    "word": "Derive",
    "meaning": "to acquire from something else",
    "examples_0": "It is impossible to derive the correct answer without the proper formula.",
    "examples_1": "In our small town, most of the citizens derive their income from manufacturing jobs."
  },
  {
    "word": "Dermatology",
    "meaning": "the health division involving skin and its problems",
    "examples_0": "Instead of seeing my general practitioner, I knew I needed someone who practiced dermatology to treat my skin rash.",
    "examples_1": "It seems right that a center for dermatology would be built next to a sunscreen store due to helping people take care of their skin."
  },
  {
    "word": "Dermis",
    "meaning": "the middle skin layer where nerve endings, blood vessels, hair follicles, and other biological structures are found",
    "examples_0": "The nurse injected the medication into the dermis that lies beneath the top layer of skin.",
    "examples_1": "Below the upper layer of skin, the dermis contains the blood vessels that nourish the skin cells."
  },
  {
    "word": "Derogate",
    "meaning": "to offend or criticize a person or thing",
    "examples_0": "The critic didn't mean to derogate the author, only his poorly written novel.",
    "examples_1": "If you don't want to derogate the locals during your travels, you should avoid being an obnoxious tourist."
  },
  {
    "word": "Derogatory",
    "meaning": "conveying a poor opinion of something or someone",
    "examples_0": "The public criticized the basketball team owner after he made derogatory remarks about minorities.",
    "examples_1": "To a mentally disabled person, the term ?retarded? is viewed as a derogatory word."
  },
  {
    "word": "Derring-do",
    "meaning": "acts that depend upon courage or bravery",
    "examples_0": "The soldier received a medal of valor for his derring-do on the battlefield.",
    "examples_1": "When the man rushed into the burning house to save the old woman?s cat, he performed nothing but an act of derring-do."
  },
  {
    "word": "Desalination",
    "meaning": "process of removing salt from sea water in order to make drinking water",
    "examples_0": "The water needed desalination before it could be considered safe to drink.",
    "examples_1": "The scientists were working on the desalination of the ocean water."
  },
  {
    "word": "Descant",
    "meaning": "to talk for a long time",
    "examples_0": "I never have any desire to descant with anyone about anything, since I prefer to keep my conversations short and sweet.",
    "examples_1": "A debate almost always requires you to descant with an opponent for a long time, since explaining a point of view can rarely be done quickly."
  },
  {
    "word": "Descend",
    "meaning": "to move down from a higher area",
    "examples_0": "After checking out the crime scene, the detective realized the burglar had to descend from the balcony by way of a climbing rope.",
    "examples_1": "In the teen movie, the heartthrob watches his true love descend the majestic staircase."
  },
  {
    "word": "Descendant",
    "meaning": "descending from a biological ancestor",
    "examples_0": "As a descendant of Abraham Lincoln, I feel the need to act in a noble way that would make my forbearer proud.",
    "examples_1": "Shawn claims that he is a direct descendant of Alexander the Great, although everyone knows that he is bluffing."
  },
  {
    "word": "Descent",
    "meaning": "an action of moving downward",
    "examples_0": "The plane?s descent was so fast that my ears popped.",
    "examples_1": "The descent into the coal mines was taken by elevator."
  },
  {
    "word": "Describe",
    "meaning": "to describe and object or event either out loud or in writing",
    "examples_0": "When asked to describe her father, the girl thought of the words ?funny? and ?kind?.",
    "examples_1": "The witness was able to describe exactly what the robber looked like at the scene of the crime."
  },
  {
    "word": "Description",
    "meaning": "an account or narrative",
    "examples_0": "The detailed description of the product was listed incorrectly on the label.",
    "examples_1": "A description of the suspect was given by an eye-witness and sketched out."
  },
  {
    "word": "Descry",
    "meaning": "to catch sight of",
    "examples_0": "After conducting experiments for several years, the scientist was able to descry the cause of the disease.",
    "examples_1": "Using the binoculars, I hoped to descry what the criminals were doing in the woods."
  },
  {
    "word": "Desecrate",
    "meaning": "to treat a sacred place or object with disrespect",
    "examples_0": "Do not desecrate the temple by speaking loudly during your visit.",
    "examples_1": "Having a party in a cemetery at night is one way to desecrate the resting place of the dead."
  },
  {
    "word": "Desensitized",
    "meaning": "made less responsive or less sensitive",
    "examples_0": "Children can become desensitized to aggression when they play violent videogames.",
    "examples_1": "Because Tom and Helen use a lot of profanity at home, their children have become desensitized to swearing."
  },
  {
    "word": "Desert",
    "meaning": "a dry, bare area of land, especially one with little water or plants",
    "examples_0": "My aunt's house has no grass because she lives in a desert region.",
    "examples_1": "Summers are very hot and dry when you live in a desert area."
  },
  {
    "word": "Deserted",
    "meaning": "abandoned, without people",
    "examples_0": "It was a strong clue that the restaurant either had poor service or terrible food since it looked deserted.",
    "examples_1": "The movie, ?Jaws,? instilled a fear in beachgoers which left many beaches deserted."
  },
  {
    "word": "Desertification",
    "meaning": "the process of rich soil becoming dry and bare due to erosion, lack of water or overuse of the land",
    "examples_0": "After fifty years of farming, the farmer had to relocate to land with more fertile soil because of the desertification of his former plot of land.",
    "examples_1": "Dust blew away from the fields due to the desertification of it based on the years of drought in the area."
  },
  {
    "word": "Deserve",
    "meaning": "to be worthy or fit for something, often a reward or punishment",
    "examples_0": "The students deserve an A for the amazing project they made out of popsicle sticks.",
    "examples_1": "Although the excellent worker might deserve a pay raise, his tightwad boss refuses to give him extra money."
  },
  {
    "word": "Deserve",
    "meaning": "to have earned something because of actions or qualities",
    "examples_0": "The criminal might deserve to go to jail, but the judge had mercy on him.",
    "examples_1": "After being good at school all week, the twins deserve a prize for their good behavior."
  },
  {
    "word": "Desiccated",
    "meaning": "dried out; lifeless",
    "examples_0": "The professional soccer player became desiccated after being in a car accident that left him in a coma.",
    "examples_1": "Without water, the crops quickly became desiccated."
  },
  {
    "word": "Desideratum",
    "meaning": "a wished-for or desired thing",
    "examples_0": "A desideratum when car shopping is price.",
    "examples_1": "A desideratum for the role of teacher was certification in English."
  },
  {
    "word": "Design",
    "meaning": "a plan to make, or sketch plans for something",
    "examples_0": "We will hire an architect to design our new kitchen to include more cabinet space and a larger pantry.",
    "examples_1": ""
  },
  {
    "word": "Designate",
    "meaning": "appointed; chosen",
    "examples_0": "We made sure to designate a sober driver, because we knew that by the end of the night everyone would be stone drunk.",
    "examples_1": "Make sure to designate a place to meetup in case of a fire, so all family members know where to find each other."
  },
  {
    "word": "Desirable",
    "meaning": "worth getting or having; wanted by most people",
    "examples_0": "The most desirable item in the vending machine was cookies.",
    "examples_1": "Because she had a pleasant demeanor, she was a desirable friend."
  },
  {
    "word": "Desire",
    "meaning": "a wish, a feeling of want",
    "examples_0": "I get a desire to slap Phil in the face when he starts to whine like a baby.",
    "examples_1": "Under interrogation, the robber admitted that his desire for expensive clothing led him to shoplift at Nordstrom."
  },
  {
    "word": "Desirous",
    "meaning": "wanting something very much",
    "examples_0": "After years of vocal lessons, Crystal was desirous to be a famous singer.",
    "examples_1": "?I would be desirous of an interview to discuss my skills with you,? the job applicant stated to the human resources manager."
  },
  {
    "word": "Desist",
    "meaning": "to stop doing something",
    "examples_0": "The document from the court orders the magazine to desist from publishing false stories about the actor.",
    "examples_1": "Because of the copyright violation, my lawyer sent a cease and desist letter to the company that was publishing my work without permission."
  },
  {
    "word": "Desolate",
    "meaning": "empty; without life",
    "examples_0": "Since the anchor stores closed, the shopping center has become a desolate wasteland.",
    "examples_1": "The farmer hopes the fertilizer will moisturize the soil in the desolate field so he can grow crops."
  },
  {
    "word": "Despair",
    "meaning": "",
    "examples_0": "Helpless and alone, the prisoner of war fell victim to a deep despair.",
    "examples_1": "His loneliness and despair had reached new highs, driving him to commit suicide."
  },
  {
    "word": "Desperate",
    "meaning": "a feeling of hopelessness in which someone is willing to try the impossible to solve a problem",
    "examples_0": "In a desperate attempt to win the battle, the general ordered his troops to charge at the fortified enemy position with their inferior numbers.",
    "examples_1": "With little money and nowhere to stay, the man was desperate for work and willing to do anything to make some money."
  },
  {
    "word": "Desperation",
    "meaning": "being so overwhelmed by a feeling that you feel compelled to act in a rash or crazed way",
    "examples_0": "Juliet?s desperation to be with Romeo inspired her to make the terrible decision to fake her death.",
    "examples_1": "The starving family?s desperation for food forced them to steal bread from the market."
  },
  {
    "word": "Despicable",
    "meaning": "worthy of intense dislike",
    "examples_0": "The despicable man was disliked by everyone in his neighborhood.",
    "examples_1": "When Mack was convicted of the despicable crime of murder, his wife was so embarrassed she divorced him."
  },
  {
    "word": "Despise",
    "meaning": "to look upon with disdain",
    "examples_0": "Because I despise the taste of white milk, I never drink it.",
    "examples_1": "If you despise your situation in life, you should work to alter the things you dislike."
  },
  {
    "word": "Despite",
    "meaning": "disgust; hatred",
    "examples_0": "Since the old man did not trust modern conveniences, he looked at the mobile phone with despite.",
    "examples_1": "The racist woman felt despite for anyone of a different race."
  },
  {
    "word": "Despondency",
    "meaning": "a condition in which one has no hope",
    "examples_0": "My therapist is helping me deal with the despondency I feel when I recall my abusive childhood.",
    "examples_1": "When my husband died, I lived in a state of despondency for over a year."
  },
  {
    "word": "Despondent",
    "meaning": "very sad and without hope",
    "examples_0": "Marilyn was despondent after her husband of fifty years died.",
    "examples_1": "How can I help but be despondent after losing my job?"
  },
  {
    "word": "Despot",
    "meaning": "a brutal ruler who controls everything",
    "examples_0": "Once the despot killed his parents, he was able to run the country with an iron fist.",
    "examples_1": "The despot has decided to control all television stations in his nation."
  },
  {
    "word": "Despotic",
    "meaning": "associated with or typical of a tyrant",
    "examples_0": "Many employees have resigned in order to escape the rule of their despotic manager.",
    "examples_1": "Under orders from the despotic ruler, citizens were denied the freedom of speech."
  },
  {
    "word": "Despotism",
    "meaning": "a type of government in which one individual or group governs with complete authority, usually in a harsh manner",
    "examples_0": "The only way to end despotism is by removing the ruthless king from the throne.",
    "examples_1": "Since the family endured torture under the dictator?s despotism, they hoped to immigrate to another country."
  },
  {
    "word": "Destination",
    "meaning": "the place that something or someone is going to",
    "examples_0": "The final destination of our vacation was the Hawaiian islands.",
    "examples_1": "The kids were excited when they found out an amusement park was the family's destination."
  },
  {
    "word": "Destine",
    "meaning": "to intend for something to fulfill a certain purpose",
    "examples_0": "When you create something, you destine it for a certain goal, a certain role that it was primarily designed to fulfill.",
    "examples_1": "A company destines a product for a particular purpose during the design phase, gearing it to be as efficient as it can in performing that purpose."
  },
  {
    "word": "Destiny",
    "meaning": "what's meant to be; fixed order of things; a power that determines your future",
    "examples_0": "I believe that my destiny has been so arranged from the beginning, and that there is a higher force at play.",
    "examples_1": "Leaders have the ability to alter the destiny of millions, which is why elections ought to be taken seriously."
  },
  {
    "word": "Destitute",
    "meaning": "utterly lacking",
    "examples_0": "Even though I grew up in a destitute family, it did not stop me from attending an Ivy League school",
    "examples_1": "The heiress could think of nothing worse than being destitute."
  },
  {
    "word": "Destroy",
    "meaning": "to damage something to the point that it cannot be used or doesn?t exist",
    "examples_0": "Using a shredder to destroy the document, the clerk left no trace of the private information.",
    "examples_1": "The hurricane managed to destroy all the houses that once stood near the shore."
  },
  {
    "word": "Destruction",
    "meaning": "demolition and damage",
    "examples_0": "After the tornado struck the small town, the destruction became evident with the houses being flattened to the ground.",
    "examples_1": "During ancient history, many civilizations were attacked by their enemies causing destruction leaving behind ruined buildings."
  },
  {
    "word": "Dictate",
    "meaning": "to set rules or give directions that must be followed",
    "examples_0": "Customs dictate women should be served before men during formal meals.",
    "examples_1": "Because Matt is a controlling man, he tries to dictate his wife?s every move."
  },
  {
    "word": "Dictation",
    "meaning": "the act of reciting information that will later be published in some manner",
    "examples_0": "A court stenographer knows a great deal about dictation because he or she must record every word spoken in court.",
    "examples_1": "If you go to school to become a medical transcriptionist, your job will involve typing a medical professional?s dictation tapes."
  },
  {
    "word": "Dictator",
    "meaning": "a ruler who wields absolute authority over his country and holds and/or abuses an extraordinary amount of personal power",
    "examples_0": "Often a dictator has many followers because of their dynamic and controlling personality.",
    "examples_1": "My mom is like a dictator because her rules are strict and her punishments are harsh."
  },
  {
    "word": "Dictatorial",
    "meaning": "having a tendency to tell people what to do in a way that is like a dictator",
    "examples_0": "The dictatorial boss constantly shouted orders at his nervous employees.",
    "examples_1": "Yelling ?Cut!? the dictatorial director spent most of his time telling actors what to do on stage."
  },
  {
    "word": "Dictatorship",
    "meaning": "a form of government in which one person has total power",
    "examples_0": "There is no freedom when living in a dictatorship.",
    "examples_1": "Joseph Stalin is infamous for his terror-filled dictatorship in the Soviet Union."
  },
  {
    "word": "Diction",
    "meaning": "the way in which a person speaks or writes",
    "examples_0": "The writer?s diction is characterized by short simple sentences that are easily understood.",
    "examples_1": "When Ed reads the evening news on air, his diction is so nonchalant he sounds as though he is not concerned about the state of the world."
  },
  {
    "word": "Dictionary",
    "meaning": "a book that lists words and their meanings",
    "examples_0": "The teacher urged the students to use the dictionary to look up any words that they didn?t know the meaning of.",
    "examples_1": "Although he thought he knew the definition of the word ?trial,? the ESL learner used a dictionary to check it?s meaning."
  },
  {
    "word": "Dictum",
    "meaning": "a statement or well-known remark that expresses an important idea or rule",
    "examples_0": "As Sarah waited in the unemployment line, she recognized the truth of the dictum, ?last hired; first fired?.",
    "examples_1": "My suspicious aunt is quick to remind us of the dictum that encourages us to keep our enemies close."
  },
  {
    "word": "Didactic",
    "meaning": "designed or intended to teach",
    "examples_0": "While the professor?s lectures were designed to be didactic, they only served to confuse the students.",
    "examples_1": "Although the fiction books are not meant to be didactic, they are quite informative."
  },
  {
    "word": "Die",
    "meaning": "to stop living",
    "examples_0": "The plants in my garden will wither and die without water.",
    "examples_1": "Doctor?s tried to keep the woman alive but she did die in the end."
  },
  {
    "word": "Diesel",
    "meaning": "an internal combustion engine in which heat produced by the compression of air in the cylinder is used to ignite the fuel",
    "examples_0": "Diesel fuel is different than regular gasoline because fuel is injected into compressed air, whereas with gasoline, fuel and air are mixed and then compressed.",
    "examples_1": "Diesel engines are more durable, perform at higher speeds, and have greater fuel economy because of the engine?s ability to convert fuel into heat and energy."
  },
  {
    "word": "Differ",
    "meaning": "to disagree or clash",
    "examples_0": "After discussing the dress code, the teacher?s opinion of wanting longer skirt requirements would differ from the students wanting to wear shorter skirts.",
    "examples_1": "If a mother?s decision to allow her kids to stay up past their bedtimes differ from her husband?s decisions, this will send mixed messages to the kids."
  },
  {
    "word": "Different",
    "meaning": "another; separate",
    "examples_0": "You should take a different path home since your usual route is blocked by traffic.",
    "examples_1": "I want to dye the top part of my dress a different color so that it will stand out on the runway."
  },
  {
    "word": "Differentiate",
    "meaning": "to identify as dissimilar",
    "examples_0": "The cashier told me a sticker would differentiate the regular cheeseburger from the cheeseburger without pickles.",
    "examples_1": "Although the newer model of the car costs more, I cannot see any features that differentiate it from last year?s model."
  },
  {
    "word": "Difficult",
    "meaning": "needing a significant amount of skill or ability to complete",
    "examples_0": "It is difficult to perform any sport at an Olympic level, as it requires years of practice and dedication to reach that level of skill.",
    "examples_1": "Archery is a difficult skill to master, especially now that bows are not the primary means of fighting at a distance."
  },
  {
    "word": "Diffidence",
    "meaning": "the state of being timid or shy; not confident",
    "examples_0": "You shouldn?t be so diffidence about your achievements when you?ve done very well.",
    "examples_1": ""
  },
  {
    "word": "Diffident",
    "meaning": "lacking confidence in one?s ability or self",
    "examples_0": "Because she felt unattractive, Mary was diffident and kept to herself at parties.",
    "examples_1": "Although he graduated in the top ten percent of his class, Jules is still diffident about his own intelligence."
  },
  {
    "word": "Diffraction",
    "meaning": "the process in which light waves are spread out by passing over an edge or a thin aperture",
    "examples_0": "The dispersion of light occurs through diffraction, when light passes through a narrow opening like the branches of a tree.",
    "examples_1": "When light goes through the leaves of the treetops, it goes through diffraction, spreading into a wider spectrum."
  },
  {
    "word": "Diffuse",
    "meaning": "to spread out over a large area",
    "examples_0": "They used the essential oils to diffuse fragrance throughout the entire room.",
    "examples_1": "The fan helped to diffuse cool air all around the sun room."
  },
  {
    "word": "Diffusion",
    "meaning": "spreading something from one place to another",
    "examples_0": "Diffusion of the lemon and lime in the air caused a citrusy aroma to move throughout the house.",
    "examples_1": "Diffusion of capitalism across the border changed the entire economy of the once struggling country."
  },
  {
    "word": "Dig",
    "meaning": "a jab or poke at someone in order to tease or get their attention",
    "examples_0": "When the young teenager continued to argue with the man, her mother gave a slight dig to her side in order for the teenager to stop talking.",
    "examples_1": "Standing frozen on stage in front of a large audience, Tom decided to give the actor a dig in his arm to let him know he needed to say the next line."
  },
  {
    "word": "Digest",
    "meaning": "to divide food down so that it can be soaked up into the body?s systems",
    "examples_0": "It is recommended to wait at least 20 minutes after eating to go swimming so that you have enough time to digest your food.",
    "examples_1": "After the boa constrictor consumed the pig, it took almost a week for the food to digest."
  },
  {
    "word": "Digestion",
    "meaning": "the method which divides the food down so that it can be used by the body?s systems",
    "examples_0": "Bacteria can develop within the stomach walls which results in the challenges of digestion.",
    "examples_1": "Digestion of raw vegetables may cause extreme gas or bloating due to its high amount of fiber."
  },
  {
    "word": "Digit",
    "meaning": "a finger on a hand",
    "examples_0": "If someone was stealing, barbaric tribes resorted to only cutting off their digit instead of their whole hand.",
    "examples_1": "The kindergartner was born with an extra digit which made it helpful for him to count to eleven."
  },
  {
    "word": "Digital",
    "meaning": "using numbers in numerical form for a specific function",
    "examples_0": "Young children find reading a digital clock much easier to read than an analog clock with its hands pointing to the numbers.",
    "examples_1": "Marathon runners may quickly look at their digital watches in order to determine the time as well as the distance they have traveled so far."
  },
  {
    "word": "Dignified",
    "meaning": "respectable",
    "examples_0": "She did not think it was dignified behavior for chaperones to dance at the prom.",
    "examples_1": "Because the mayor was a dignified man, you rarely saw him acting informally."
  },
  {
    "word": "Dignitaries",
    "meaning": "an official considered to be in high standing",
    "examples_0": "Dignitaries from twelve different countries filed into the assembly room at the world conference to discuss environmental concerns.",
    "examples_1": "When the former mayor passed away, many dignitaries and celebrities attended the funeral to show their respects."
  },
  {
    "word": "Dignity",
    "meaning": "a characteristic worthy of respect and esteem",
    "examples_0": "The first lady?s quiet dignity made her a media favorite.",
    "examples_1": "Even though the soldier saved many lives, his dignity would not allow him to accept a medal for doing his job."
  },
  {
    "word": "Digress",
    "meaning": "not staying on topic; to go off on a tangent",
    "examples_0": "Because abortion is difficult for me to talk about, I will digress from this topic.",
    "examples_1": "If you get emotional talking about your father, then you may digress."
  },
  {
    "word": "Digression",
    "meaning": "a temporary departure from the norm",
    "examples_0": "Playing football during the winter was a digression for the baseball star.",
    "examples_1": "When the fiction author wrote a biography on his favorite actor, he took a literary digression from his usual genre."
  },
  {
    "word": "Dike",
    "meaning": "a long wall built to prevent flooding from the sea",
    "examples_0": "The sea-port?s only hope is to build a long dike along the city to keep the flood water from taking over.",
    "examples_1": "Though there was no real dike being built, some workers brought sandbags to hold back the water."
  },
  {
    "word": "Dilapidated",
    "meaning": "rundown; in bad shape",
    "examples_0": "The dilapidated house on our street is sure to lower the property values of the homes in our neighborhood.",
    "examples_1": "After my husband breaks down the dilapidated shed in our backyard, he is going to build a playhouse for our children in the same area."
  },
  {
    "word": "Dilate",
    "meaning": "to cause to expand",
    "examples_0": "The doctor will repair the narrowed vessels by inserting a tube to dilate them.",
    "examples_1": "When Kim is shocked, her eyes dilate and become quite large."
  },
  {
    "word": "Dilatory",
    "meaning": "intended to cause delay",
    "examples_0": "My daughter used dilatory tactics to stay up past her bedtime.",
    "examples_1": "Because I was running late to the meeting, I asked my assistant to behave in a dilatory manner so I would have time to arrive."
  },
  {
    "word": "Dilemma",
    "meaning": "a situation in which you have to make a tough choice",
    "examples_0": "Marty?s dilemma was that he couldn?t decide what college to attend.",
    "examples_1": "Unsure if she should turn in her coworker for stealing, the cashier faced a moral dilemma."
  },
  {
    "word": "Dilettante",
    "meaning": "a person whose interest in an art or in an area of knowledge is not very serious",
    "examples_0": "When it comes to learning how to play the guitar, my daughter is a dilettante who will practice one day but not the next day.",
    "examples_1": "The veteran reporters viewed the new guy as a dilettante who would not take his job as seriously as they took their careers."
  },
  {
    "word": "Diligence",
    "meaning": "constant and consistent effort",
    "examples_0": "The researchers continue their diligence and are constantly looking for a cancer cure.",
    "examples_1": "Because he rarely comes to work, the diligence of the employee was questioned by his boss."
  },
  {
    "word": "Diligent",
    "meaning": "careful in carrying out tasks and duties",
    "examples_0": "The teacher believes the diligent students will check their answers.",
    "examples_1": "When Tara is tired, she is not a very diligent worker."
  },
  {
    "word": "Dimensional",
    "meaning": "related to measurements, especially, width, length, and height",
    "examples_0": "The three-dimensional object is a much longer than it is wide.",
    "examples_1": "When designing the dimensional aspects of the building, the engineer made sure to consider both length and height."
  },
  {
    "word": "Diminish",
    "meaning": "to become smaller or lessen",
    "examples_0": "The medicine caused my headache to diminish.",
    "examples_1": "They didn?t want to diminish my work, but they had decided to publish another article in the paper."
  },
  {
    "word": "Diminution",
    "meaning": "a lessening or reduction",
    "examples_0": "The diminution of military troops will leave our country more vulnerable to invasion.",
    "examples_1": "When the jobless rate decreases, there is usually a diminution in crime as well."
  },
  {
    "word": "Diminutive",
    "meaning": "very short or small",
    "examples_0": "Surrounded by tall skyscrapers, the three-story apartment building looked diminutive.",
    "examples_1": "My mother was a diminutive woman who still purchased clothes from the girls? department."
  },
  {
    "word": "Dimple",
    "meaning": "a small, natural indention in some part of the human body, especially the cheek",
    "examples_0": "When she smiles, a small dimple shows in the middle of Grace?s cheek.",
    "examples_1": "Pushing her finger into her brother?s dimple, Logan teased Scott about the small depression in his cheek."
  },
  {
    "word": "Din",
    "meaning": "a booming unpleasant racket",
    "examples_0": "The din from my neighbor?s party will probably keep me up all night.",
    "examples_1": "Because of the din caused by the chatty students, the teacher could not hear the afternoon announcements."
  },
  {
    "word": "Dingy",
    "meaning": "filthy, discolored, often dark or depressing",
    "examples_0": "Her dress was a dingy grey that was two sizes too big and could have used a wash.",
    "examples_1": "It wasn?t surprising that Catherine felt sad all the time when she lived in a room that was so dingy, dark, and depressing."
  },
  {
    "word": "Dinosaur",
    "meaning": "an (usually large) ancient reptile that lived millions of years ago",
    "examples_0": "The dinosaur bones were buried deep within the earth and painted a detailed picture of what life was like as a reptile years ago.",
    "examples_1": "Gigantic and strong, the meat-eating dinosaur ruled the reptile world during the Mesozoic Era."
  },
  {
    "word": "Dint",
    "meaning": "as a result of, by way of",
    "examples_0": "The candidate seems to have more influence by dint of money and not actual speaking ability.",
    "examples_1": "Priscilla was able to rise to the top by dint of education and a strong work ethic."
  },
  {
    "word": "Diorama",
    "meaning": "a small-scale scene using tangible figurines or modeling clay",
    "examples_0": "From the diorama, the children could see how the cavemen lived during prehistoric times depicting the cavemen, his shelter and the way he cooked his food.",
    "examples_1": "Using a shoebox, the teacher instructed her students to create a diorama of a Civil War battle using little plastic army men, clay and other art supplies."
  },
  {
    "word": "Diploid",
    "meaning": "of a cell, having two complete sets of chromosomes, one from each parent",
    "examples_0": "A diploid is a type of cell that contains two sets of chromosomes.",
    "examples_1": "Diploid cells reproduce through the process of mitosis."
  },
  {
    "word": "Diplomacy",
    "meaning": "the management of relationships between the governments of different countries",
    "examples_0": "My aunt was an ambassador who worked on the diplomacy between America and France.",
    "examples_1": "They were hopeful that diplomacy would help to avoid a war between the countries."
  },
  {
    "word": "Diplomatic",
    "meaning": "describes a way of dealing with people that are polite and tactful",
    "examples_0": "Because he isn?t very diplomatic, the politician often finds himself involved in verbal disputes.",
    "examples_1": "The salesman?s diplomatic nature helped him make solid deals with difficult clients."
  },
  {
    "word": "Dire",
    "meaning": "extremely pressing",
    "examples_0": "Because this is a dire emergency, we need medical assistance right away!",
    "examples_1": "The children in the third world country are very ill and in dire need of clean water."
  },
  {
    "word": "Direct Democracy",
    "meaning": "a type of government where the power lies directly in the hands of the people instead of representatives",
    "examples_0": "Those living in ancient Greece practiced Direct Democracy, meaning each person got a say in how the city-state was governed.",
    "examples_1": "Direct democracy allows every citizen the right to vote on important issues."
  },
  {
    "word": "Direct",
    "meaning": "to cause someone or something to move in a specific way or direction",
    "examples_0": "The stage manager began to direct the actors on where to stand on stage.",
    "examples_1": "A police officer was placed outside the school to direct traffic turning in and out of the driveway."
  },
  {
    "word": "Direct",
    "meaning": "to cause someone or something to move in a particular direction",
    "examples_0": "The movers asked the homeowners to direct them to the kitchen so that they could bring in the appliances.",
    "examples_1": "A police officer was placed in the middle of the intersection to direct traffic to the detour road."
  },
  {
    "word": "Directive",
    "meaning": "an order or change that comes from an authority figure typically in charge of a group of people",
    "examples_0": "The School Board created a new directive for all teachers to complete 300 hours of instruction for teaching a foreign language.",
    "examples_1": "A directive passed down from the CEO of the company demanded that all employees devote an hour of each work day to bringing in more customers."
  },
  {
    "word": "Directory",
    "meaning": "a list of names, telephone numbers, addresses, or other cataloged information",
    "examples_0": "When you call the office, you will be prompted to select an employee?s name from the directory.",
    "examples_1": "The store owner keeps a directory of all customer names and addresses in case he needs to reach them."
  },
  {
    "word": "Dirge",
    "meaning": "a sorrowful literary or musical composition that is used to honor a deceased person",
    "examples_0": "When Kim sang a dirge for her deceased father, she brought everyone to tears.",
    "examples_1": "My teenage daughter was bored by the music at the opera and referred to it as one long funeral dirge."
  },
  {
    "word": "Dirigible",
    "meaning": "something that is capable of being steered or directed",
    "examples_0": "All cars are dirigible in nature, capable of being steered or otherwise controlled by the driver.",
    "examples_1": "A dirigible spotlight is one that can be directed or steered to face different directions, instead of being fixed in place."
  },
  {
    "word": "Disabuse",
    "meaning": "to make aware of the truth",
    "examples_0": "If you wish to continue to believe that falsehood, I will not disabuse you by telling you the truth.",
    "examples_1": "It is my job as a teacher to disabuse students of the notion they can be successful without an education."
  },
  {
    "word": "Disadvantage",
    "meaning": "a drawback or obstacle",
    "examples_0": "One disadvantage of going to the beach on the holiday weekend is that the shores will be jam-packed with people.",
    "examples_1": "The short fighter?s height was a disadvantage when facing a six-foot opponent."
  },
  {
    "word": "Disaffected",
    "meaning": "rebellious and resentful, especially against authority",
    "examples_0": "The disaffected rebels rioted in the streets after the latest police involved killing.",
    "examples_1": "Severely disaffected students raged at campus authorities and were rebellious with attendance."
  },
  {
    "word": "Disagree",
    "meaning": "to hold or express a different opinion",
    "examples_0": "Kim and Emma disagree about which movie they should see, so they may go bowling instead.",
    "examples_1": "Though we disagree a lot, my wife and I refuse to argue in front of the children."
  },
  {
    "word": "Disagreeable",
    "meaning": "not nice, pleasant, or enjoyable in nature",
    "examples_0": "Mark is an overly disagreeable man, often patronizing others and just outright antagonizing the people he doesn?t like.",
    "examples_1": "If you always act disagreeable, it is unlikely that you will ever make very many friends since no one will want to be around you."
  },
  {
    "word": "Disagreement",
    "meaning": "an argument caused by people having differences of opinion",
    "examples_0": "A heated disagreement between the two friends caused them to stop speaking.",
    "examples_1": "Even though they had a disagreement over spending, the husband and wife refused to go to be upset."
  },
  {
    "word": "Disallow",
    "meaning": "to revoke or take away a privilege that was previously allowed",
    "examples_0": "Many parents disallow their children to participate in their favorite activities or hang out with their friends when they?re grounded.",
    "examples_1": "After finding out that the evidence was collected without a warrant, the judge was forced to disallow it from the court case."
  },
  {
    "word": "Disambiguate",
    "meaning": "to show the differences between two or more meanings clearly",
    "examples_0": "Punctuation in a sentence helps one disambiguate the meaning of each phrase.",
    "examples_1": "The student called on his professor to help him disambiguate the meaning between two lines in the poem."
  },
  {
    "word": "Disappear",
    "meaning": "to vanish; to cease to be visible",
    "examples_0": "With a blink of an eye, the magician was able to make the rabbit disappear from his hat.",
    "examples_1": "The teenage boys have such big appetites that the food seems to disappear as soon as their mother brings it into the house."
  },
  {
    "word": "Disappointed",
    "meaning": "saddened and upset because of a letdown",
    "examples_0": "The police disappointed that no witnesses came forward to talk to them about the crime.",
    "examples_1": "Even though he was disappointed that he didn?t make the basketball team, the boy vowed to try again next year."
  },
  {
    "word": "Disappointment",
    "meaning": "a feeling of unhappiness that occurs after something hoped for didn?t go as planned",
    "examples_0": "After she didn?t make the cheerleading team, Tatiana was filled with a feeling of disappointment.",
    "examples_1": "The saddened mother?s face was filled with disappointment when she found out her daughter had lied to her."
  },
  {
    "word": "Disapprobation",
    "meaning": "a demonstration of disapproval",
    "examples_0": "I lied about my failing grades because I did not want to experience my parents? disapprobation.",
    "examples_1": "When my teacher frowned while grading my test, I viewed her action as a type of disapprobation."
  },
  {
    "word": "Disapprove",
    "meaning": "to reject or refuse something",
    "examples_0": "When Sarah?s boyfriend came in to meet her parents, she knew they would instantly disapprove of him due to his many tattoos, obnoxious attitude and unemployment status.",
    "examples_1": "Since so many citizens disapprove of the country going to war, the country?s leader decided to give peace a chance."
  },
  {
    "word": "Disarmament",
    "meaning": "taking up or giving away military weapons",
    "examples_0": "The security council demanded full disarmament and that the group give up their weapons within twenty-four hours.",
    "examples_1": "After winning the war, disarmament of enemy weapons was the group?s top mission."
  },
  {
    "word": "Disarming",
    "meaning": "having the ability to decrease suspicions and fears",
    "examples_0": "Because Danny is a disarming man and can easily reduce buyer fears, he is a great car salesman.",
    "examples_1": "The disarming sound of the instrumental music put me at ease in the psychiatrist?s office."
  },
  {
    "word": "Disarray",
    "meaning": "in a state of disorder",
    "examples_0": "Since the toddler twins have been acting wildly today, my entire house is in disarray.",
    "examples_1": "During tax season, Hank?s desk is cluttered in disarray with hundreds of receipts."
  },
  {
    "word": "Disaster",
    "meaning": "an event that causes great damage or hardship",
    "examples_0": "The bride?s rainy wedding day was a disaster that started with missing rings and ended with a run-away groom.",
    "examples_1": "Police have determined that the horrible forest fire was caused by teenage boys who let a small fire spread into disaster."
  },
  {
    "word": "Disastrous",
    "meaning": "catastrophic; devastating",
    "examples_0": "The disastrous date ended with the woman running to the bathroom in tears and the man skipping out on the check.",
    "examples_1": "Even though the event seemed disastrous, there were a few happy moments before things went south."
  },
  {
    "word": "Disavow",
    "meaning": "refuse to own; reject",
    "examples_0": "When news of the band?s breakup surfaced, the manager had to disavow any part in the undoing.",
    "examples_1": "Her parents planned to disavow any knowledge that she was calling off the wedding."
  },
  {
    "word": "Disband",
    "meaning": "to separate or disperse permanently",
    "examples_0": "When the Musketeers did disband, there was very little safety in France because the men could only be productive as a group.",
    "examples_1": "After fighting ensued among many leaders in the sports club, it was only a matter of days before the club would disband and each teammate would find another team."
  },
  {
    "word": "Disbelief",
    "meaning": "the sentiment that comes with doubting an individual or thing",
    "examples_0": "It is obvious from the disbelief on Ellen?s face she does not believe her husband?s story about working late.",
    "examples_1": "When the police officer stared at me in disbelief, I knew he doubted my robbery claim."
  },
  {
    "word": "Disbelieve",
    "meaning": "to refuse or reject the belief or credence of something",
    "examples_0": "The proof provided by the research made it hard to disbelieve in climate change.",
    "examples_1": "Though many people think that aliens exist, I reserve the right to disbelieve it."
  },
  {
    "word": "Disburse",
    "meaning": "to pay out, expend; usually from a public fund or treasury",
    "examples_0": "The federal government said it was studying whether to disburse more relief funds to the state after the damage appears to be severe.",
    "examples_1": ""
  },
  {
    "word": "Discard",
    "meaning": "to throw something away because it is considered not valuable or needed",
    "examples_0": "Since I decided to discard all of my previous emails, I did not have the evidence stating that I loaned the woman money due to her admission in a June email.",
    "examples_1": "The man?s trash can was filling up quickly since he would discard all of his pieces of junk mail every day."
  },
  {
    "word": "Discern",
    "meaning": "to be able to see, recognize, understand, or decide something",
    "examples_0": "It was not difficult to discern that Ellen killed her husband for the million dollar life insurance policy.",
    "examples_1": "Because Bradley wore sun glasses, I could not discern whether or not his eyes were red."
  },
  {
    "word": "Discernible",
    "meaning": "noticeable",
    "examples_0": "High gas prices are expected to have a discernible effect on the number of road trips taken this summer.",
    "examples_1": "Even though Jane used makeup to cover the bruises on her face, the marks were discernible to me."
  },
  {
    "word": "Discernment",
    "meaning": "smart judgement",
    "examples_0": "My grandmother says she has the gift of discernment which helps her when she meets people for the first time.",
    "examples_1": "I used discernment to choose the candidate for whom I wanted vote."
  },
  {
    "word": "Discharge",
    "meaning": "to dismiss or terminate",
    "examples_0": "When the teenager was caught yelling at a customer, his boss decided to discharge the teenager?s employment.",
    "examples_1": "After being court-martialled, the outcome was to discharge the soldier from the armed forces since he was found guilty of treason."
  },
  {
    "word": "Disciple",
    "meaning": "a student or follower of a teacher or philosopher",
    "examples_0": "After seeing his resurrection, the disciple of Christ set out to spread his message throughout the land.",
    "examples_1": "A disciple of Jesus, Andrew was a fisherman who left his day job to follow Christ."
  },
  {
    "word": "Disciplinarian",
    "meaning": "a person who lives and governs by rules and strictly enforces them",
    "examples_0": "Her former military father was such a disciplinarian that he made everyone in the house wake up at 0500 and run three miles.",
    "examples_1": "The teacher was a firm disciplinarian who had clearly defined rules and consequences posted around the classroom."
  },
  {
    "word": "Disciplinary",
    "meaning": "concerned with making sure rules are followed and not broken",
    "examples_0": "Disciplinary action was taken by the principal after the student refused to listen to the teacher.",
    "examples_1": "A disciplinary board was charged with deciding if the nurse had broken a rule when giving unapproved medicine to the patient."
  },
  {
    "word": "Discipline",
    "meaning": "a learned behavior that enables the individual to have control over their actions",
    "examples_0": "Habitual runners have such strong discipline that they wake up everyday for their jog even when they're sick or vacationing.",
    "examples_1": "The dieting woman thought she had enough discipline to resist her favorite food but the freshly baked cookies were too tempting."
  },
  {
    "word": "Disclaim",
    "meaning": "to deny, as a claim; to refuse",
    "examples_0": "We cannot, in conscience, ignore these facts or disclaim responsibility after Steven found additional information.",
    "examples_1": ""
  },
  {
    "word": "Disclaimer",
    "meaning": "a statement that rejects responsibility",
    "examples_0": "Prescription drug commercials are mandated to issue a disclaimer, describing the drug's side effects.",
    "examples_1": "The \"picture enlarged to show detail\" disclaimer is printed on the cereal box to protect companies from potential lawsuits."
  },
  {
    "word": "Disclose",
    "meaning": "to reveal information; disclose",
    "examples_0": "During the interview, the would-be informant agreed to disclose what he knew about the crime.",
    "examples_1": "The protective attorney declined to disclose his client?s current location."
  },
  {
    "word": "Disclosure",
    "meaning": "the act of revealing something; making known",
    "examples_0": "There is urgency in the plaintiff gaining full disclosure of all relevant documents.",
    "examples_1": ""
  },
  {
    "word": "Discolor",
    "meaning": "to change or lose color",
    "examples_0": "Washing light laundry with dark may cause your clothes to discolor, completely ruining them.",
    "examples_1": ""
  },
  {
    "word": "Discombobulated",
    "meaning": "in a confused or bewildered condition",
    "examples_0": "I felt discombobulated after working twelve hours a day for seven straight days.",
    "examples_1": "When the student looked at the difficult test, she felt discombobulated."
  },
  {
    "word": "Discomfit",
    "meaning": "to make a person feel uncomfortable",
    "examples_0": "The manager?s mean look served to discomfit me during the interview.",
    "examples_1": "Because Ann does not like her mother-in-law, she tries to discomfit her when she visits."
  },
  {
    "word": "Discomfiture",
    "meaning": "a feeling of embarrassment or discomfort",
    "examples_0": "After he lost the election to his rival, a sense of discomfiture crept over the now embarrassed politician.",
    "examples_1": "The bullies seemed to enjoy other students? discomfiture and thrived in causing them embarrassment and discomfort."
  },
  {
    "word": "Discomfort",
    "meaning": "being bothered by something to the point that it causes pain or embarrassment",
    "examples_0": "Whenever Brielle caught her parents kissing she was filled with discomfort and quickly ran from the room.",
    "examples_1": "Mica?s discomfort with being on stage prevented his dreams of becoming a Broadway star from coming true."
  },
  {
    "word": "Disconcert",
    "meaning": "to upset, frustrate, or embarrass",
    "examples_0": "John would disconcert his parents by not coming home after school.",
    "examples_1": "She didn't tell her parents that she was failing math because she didn't want to disconcert them."
  },
  {
    "word": "Disconcerting",
    "meaning": "tending to cause discomfort, uneasiness or alarm; unsettling; troubling; upsetting.",
    "examples_0": "I found it very disconcerting to be in the wedding of my former boyfriend.",
    "examples_1": "As a middle school counselor, Mrs. Jackson became aware of a disconcerting trend among the students to repeat whatever was said by their teachers."
  },
  {
    "word": "Disconnect",
    "meaning": "break in an existing connection",
    "examples_0": "To be sure electrical appliances and devices won?t be damaged during an lightning storm, everyone should turn off then disconnect the power plugs.",
    "examples_1": ""
  },
  {
    "word": "Disconsolate",
    "meaning": "sad beyond comforting; inconsolable",
    "examples_0": "The little girl was so disconsolate after her puppy ran away that her parents put up posters all over the neighborhood.",
    "examples_1": "Anticipating that the prisoner would be disconsolate at receiving a life sentence, the judge decided to hand down the punishment in closed court."
  },
  {
    "word": "Discontent",
    "meaning": "unhappiness, not being at peace with a situation or circumstance",
    "examples_0": "Because of the increase in police related shootings, unhappiness and discontent spread through the city.",
    "examples_1": "Discontent filled the heart of the underpaid worker slaving away at her dead-end job."
  },
  {
    "word": "Discontinue",
    "meaning": "to stop doing or making something",
    "examples_0": "Nike decided to discontinue the new brand of shoes when sales didn?t reach expected levels.",
    "examples_1": "The florist will discontinue the sale tomorrow, so we should buy the marked down flowers today."
  },
  {
    "word": "Discord",
    "meaning": "tension or strife resulting from a lack of agreement",
    "examples_0": "Knowing that discord is destructive in the classroom, the teacher wanted to foster a sense of community among her students.",
    "examples_1": "There was discord amongst the members of the committee on how they should allot their funds."
  },
  {
    "word": "Discordant",
    "meaning": "harsh or unpleasant in sound",
    "examples_0": "Without proper guidance, the band produces discordant music that no one wants to hear.",
    "examples_1": "The frightened cat gave a discordant shriek and jumped on top of the table."
  },
  {
    "word": "Discount",
    "meaning": "a reduction of the usually price of an object or service",
    "examples_0": "The winter clothing is being offered with a discount since it now summertime.",
    "examples_1": "A discount is given on theme park tickets to members of the military and their family members."
  },
  {
    "word": "Discouraged",
    "meaning": "having lost confidence or hope",
    "examples_0": "The two dogs became discouraged from the dog biscuit rolling under the couch.",
    "examples_1": "Discouraged Timmy lost the race and pouted near the finish line."
  },
  {
    "word": "Discourse",
    "meaning": "written or spoken communication or debate",
    "examples_0": "The discourse between the two candidates has not been friendly.",
    "examples_1": "Stranded on the deserted island, the castaway longed for discourse with another human being."
  },
  {
    "word": "Discourteous",
    "meaning": "rude; impolite",
    "examples_0": "Although she considers herself a straight-shooter, my aunt?s blunt tone often comes across as rude and discourteous.",
    "examples_1": "Constantly yelling and screaming, my discourteous neighbor is obnoxiously rude."
  },
  {
    "word": "Discovery",
    "meaning": "the finding, locating, or uncovering of something",
    "examples_0": "The discovery of gold led many people to travel to Texas by wagon.",
    "examples_1": "After the scientist?s discovery, people were cured of the deadly disease."
  },
  {
    "word": "Discredit",
    "meaning": "to harm the good reputation",
    "examples_0": "The way Leonard responded to the customer was a discredit to the company?s service policy.",
    "examples_1": "During the divorce, he did some pretty terrible things to bring discredit upon his wife."
  },
  {
    "word": "Discreet",
    "meaning": "not attracting attention; being careful about what one says or does to avoid embarrassing or upsetting others",
    "examples_0": "Hoping to avoid detection, the shoplifter tried to be discreet while walking through the store.",
    "examples_1": "The married politician wanted to keep his affair discreet and hidden."
  },
  {
    "word": "Discrepancy",
    "meaning": "a difference or inconsistency especially between things that should be the same",
    "examples_0": "A discrepancy in the financial reports is the reason for the audit.",
    "examples_1": "Because of a discrepancy in the witness? testimony, the defense attorney has asked the judge to drop the charges against his client."
  },
  {
    "word": "Discrete",
    "meaning": "separate; distinct; individual",
    "examples_0": "Brown and white rice are two discrete varieties.",
    "examples_1": "Though the average person might just call them red, both amber and burgundy are discrete colors."
  },
  {
    "word": "Dispassionate",
    "meaning": "not being affected by or showing feelings",
    "examples_0": "The dispassionate father watched television while his son cried on the floor.",
    "examples_1": "When the dispassionate students were informed of their teacher?s death, they acted as if nothing in their lives had changed."
  },
  {
    "word": "Dispatch",
    "meaning": "to quickly send off an individual or thing",
    "examples_0": "According to the terms of the app, the computer will dispatch a vehicle to collect us within thirty seconds.",
    "examples_1": "The president has plans to dispatch rescuers to locate those stranded by the hurricane."
  },
  {
    "word": "Dispel",
    "meaning": "to cause to depart or be broken apart",
    "examples_0": "The flowers from my husband do not dispel the fact I believe he is cheating on me.",
    "examples_1": "When the president made his speech about the state of the country?s security, he hoped his words would dispel public fears."
  },
  {
    "word": "Dispensation",
    "meaning": "immunity from a law or rule",
    "examples_0": "In our church, women who have abortions are not given a dispensation of forgiveness.",
    "examples_1": "How much did the car manufacturer have to pay in order to receive special dispensation to build on sacred land?"
  },
  {
    "word": "Dispense",
    "meaning": "distribute, or give out",
    "examples_0": "Every pharmacist must accurately dispense the medicine into the proper containers in order for no one to get sick.",
    "examples_1": "At the poker table, the dealer will dispense five cards to each person at the beginning of each round."
  },
  {
    "word": "Disperse",
    "meaning": "to spread out",
    "examples_0": "As soon as the last bell rings, students disperse out of the building and head to their buses.",
    "examples_1": "Remember to only spray a little perfume or the fragrance will disperse throughout the house and irritate my sinuses."
  },
  {
    "word": "Dispirited",
    "meaning": "having lost all hope; disheartened",
    "examples_0": "After losing the final game of the season, the once excited team was now sad and dispirited.",
    "examples_1": "Dispirited protesters quietly boarded buses for home once their rally was shut down by the police."
  },
  {
    "word": "Displace",
    "meaning": "to forcibly move people from their homeland, or to move someone or something",
    "examples_0": "The destructive fire would displace many people from their homes.",
    "examples_1": "His goal was to displace the current operating system and introduce a new computer program to take its place."
  },
  {
    "word": "Displacement",
    "meaning": "the condition of being moved to another location",
    "examples_0": "The involuntary displacement of the Native American Indians was a tragic incident that ended the lives of many people.",
    "examples_1": "During erosion, natural forces trigger soil displacement."
  },
  {
    "word": "Display",
    "meaning": "to actively exhibit something much like in a museum",
    "examples_0": "Museums display artwork from hundreds of years ago.",
    "examples_1": "Bookstores display bestsellers and new releases on shelves at the front of the store."
  },
  {
    "word": "Displease",
    "meaning": "to dissatisfy or annoy someone",
    "examples_0": "The new anti-racism laws are sure to displease all the racists in this country.",
    "examples_1": "If the politician?s views displease you, then you shouldn?t vote for him."
  },
  {
    "word": "Displeasure",
    "meaning": "feeling of being displeased or annoyed with someone or something",
    "examples_0": "The irate couple got up to leave in disgust, and the woman barked her displeasure at the waiter.",
    "examples_1": ""
  },
  {
    "word": "Disposable income",
    "meaning": "money that is left over after all debt/bills are paid",
    "examples_0": "After paying his bills, Alfie spends all of his disposable income on new clothes and eating out.",
    "examples_1": "Because she has very little disposable income, Claire rarely has extra money after she covers her monthly expenses."
  },
  {
    "word": "Disposable",
    "meaning": "easily expendable and then throw away",
    "examples_0": "Because you can't bring shaving equipment on a plane, many travelers buy disposable razors for the duration of their trip.",
    "examples_1": "The new mom went through thousands of disposable diapers before her baby's 1st birthday."
  },
  {
    "word": "Dispose",
    "meaning": "to toss out or give to another individual",
    "examples_0": "I need to dispose of the broken blender and buy a new one.",
    "examples_1": "How did the killer dispose of the body?"
  },
  {
    "word": "Disposition",
    "meaning": "the way that someone normally thinks and behaves",
    "examples_0": "Even though the old man appeared grumpy, he really had a pleasant disposition.",
    "examples_1": "His gloomy disposition aside, Jeremy is a very nice person."
  },
  {
    "word": "Dispossess",
    "meaning": "to deprive someone of the possession of land, especially by evicting them",
    "examples_0": "Once the real estate investor neglected to pay his property taxes, the government took action to dispossess his land.",
    "examples_1": "In order to pay for the loan on a note, the bank decided to dispossess the family from the house."
  },
  {
    "word": "Disproportionate",
    "meaning": "not in proportion; unfair in size",
    "examples_0": "With a disproportionate number of students and staff, the small school scrambled to fit everyone in a classroom.",
    "examples_1": "The company is hiring female workers to balance the disproportionate number of male employees in its workforce."
  },
  {
    "word": "Disprove",
    "meaning": "to prove that something is not true",
    "examples_0": "Many brilliant scientists in the past had to work to disprove the widely held notions of the public in their lifetimes, such as the shape of the world or what the universe revolves around.",
    "examples_1": "In an attempt to disprove the lies of my rival, I searched for evidence that would support what I knew to be true."
  },
  {
    "word": "Disputation",
    "meaning": "a quarrel or disagreement",
    "examples_0": "In order to avoid a disputation about money, Amy handed her credit card to her husband.",
    "examples_1": "The two rivals ruined the party when they started a disputation that led to a large fight."
  },
  {
    "word": "Disputatious",
    "meaning": "taking pleasure in arguments",
    "examples_0": "Because Ashley is a disputatious person, she is a huge asset to the debate team.",
    "examples_1": "John?s disputatious personality makes him a great lawyer."
  },
  {
    "word": "Dispute",
    "meaning": "to contest or argue about something",
    "examples_0": "When I saw unauthorized charges on my credit card, I called the bank to dispute the amounts.",
    "examples_1": "How can you dispute the fact you ate my slice of cake when you have frosting on your face?"
  },
  {
    "word": "Disqualify",
    "meaning": "to make someone ineligible for something (such as a prize) because of an offense",
    "examples_0": "When they found the runner had used illegal drugs, the committee members decided to disqualify him from the race.",
    "examples_1": "The soldier?s illness would disqualify him from serving for the next term."
  },
  {
    "word": "Disquiet",
    "meaning": "a feeling of worry and anxiety",
    "examples_0": "The novel is a tense thriller that will disquiet the reader.",
    "examples_1": "Bodies were scattered everywhere, adding to my disquiet."
  },
  {
    "word": "Disquietude",
    "meaning": "a condition of worry or concern",
    "examples_0": "The little boy listened in disquietude as his parents argued in the kitchen.",
    "examples_1": "Because the workers are concerned about possible layoffs, they are feeling a great deal of disquietude."
  },
  {
    "word": "Disquisition",
    "meaning": "a long or elaborate essay or discussion on a particular subject",
    "examples_0": "The history student's disquisition was a forty page long manifesto about the benefits of communism.",
    "examples_1": "She was so obsessed with Harry Potter that she penned an elaborate disquisition on why Hermione Granger should have been the main character."
  },
  {
    "word": "Disregard",
    "meaning": "to ignore or dismiss something",
    "examples_0": "If you disregard the red light at an intersection and keep driving you are not only breaking the law but also endangering your life.",
    "examples_1": "You should never disregard warning labels and signs, because these are usually put in place to keep you safe from hazards."
  },
  {
    "word": "Disreputable",
    "meaning": "not worthy of respect",
    "examples_0": "The mob associates decided to kill the disreputable informant.",
    "examples_1": "When the disreputable man ran for political office, he received less than one percent of the votes."
  },
  {
    "word": "Disrepute",
    "meaning": "the status of being untrustworthy or dishonorable",
    "examples_0": "Once the college fell into disrepute because of the hazing scandal, its number of applicants declined.",
    "examples_1": "The country club?s racism landed it in disrepute and caused the golf association to remove the establishment from its tour list."
  },
  {
    "word": "Disrespect",
    "meaning": "to show a lack of respect to someone or something",
    "examples_0": "This bill shows the government's disrespect for basic human rights and established legal principles.",
    "examples_1": ""
  },
  {
    "word": "Disrupt",
    "meaning": "to interrupt something by causing a problem or disturbance",
    "examples_0": "The jealous younger sibling attempted to disrupt his brother?s birthday party by throwing a tantrum to place the attention on him instead.",
    "examples_1": "The best way to disrupt the thought process of someone who is focusing is to force a sudden and unexpected disturbance upon them."
  },
  {
    "word": "Dissatisfaction",
    "meaning": "a state or feeling in which one is not happy or content",
    "examples_0": "The public?s dissatisfaction continued to governor sunk the state?s economy.",
    "examples_1": "Dissatisfaction set in when the family realized they wouldn?t be able to go to the beach."
  },
  {
    "word": "Dissatisfied",
    "meaning": "not happy or content",
    "examples_0": "Dissatisfied with the restaurant service, the man asked the terrible waitress if he could speak to her manager.",
    "examples_1": "The dissatisfied customer was unhappy with her new haircut."
  },
  {
    "word": "Dissect",
    "meaning": "to cut open and examine",
    "examples_0": "Cutting into it with a knife, the biologist began to dissect the animal to look for disease.",
    "examples_1": "The botanist used a blade to dissect and study part of the withering plant."
  },
  {
    "word": "Dissemble",
    "meaning": "to disguise or conceal behind a false appearance",
    "examples_0": "Her plan was to dissemble her intentions from her husband so she could successfully plan him a surprise party.",
    "examples_1": "Rather than answer the reporter?s questions directly, the politician chose to dissemble his responses."
  },
  {
    "word": "Disseminate",
    "meaning": "to scatter or spread widely",
    "examples_0": "With encyclopedias in every classroom, we will disseminate a wealth of information to all students.",
    "examples_1": "After the presidential election, it would not take long for the media to disseminate the results to living rooms around the world."
  },
  {
    "word": "Dissension",
    "meaning": "a disagreement that leads to arguing and discord",
    "examples_0": "Dissension was growing between the two political parties as more scandals came out through the media.",
    "examples_1": "Because he bought a new boat without telling his wife, dissension brewed in the once happy household."
  },
  {
    "word": "Dissent",
    "meaning": "to differ in opinion",
    "examples_0": "More than likely, my father will dissent with the idea I am old enough to set my own curfew.",
    "examples_1": "The union is going to dissent with management?s offer of a small pay increase."
  },
  {
    "word": "Dissentient",
    "meaning": "opposing the majority",
    "examples_0": "Dissentient voices opposed all of those in congress that supported the bill.",
    "examples_1": "Though several dissentient home owners opposed the building of the mall, most of the people welcomed it."
  },
  {
    "word": "Disservice",
    "meaning": "an ill turn or injury",
    "examples_0": "She has done a great disservice to her cause by suggesting that violence is justifiable.",
    "examples_1": ""
  },
  {
    "word": "Dissident",
    "meaning": "a person who opposes the current political structure, group or laws; one who disagrees",
    "examples_0": "Charlie?s family members were devout Catholics, while he was considered dissident for not identifying with the religion.",
    "examples_1": "The dissident was jailed for refusing to obey the law."
  },
  {
    "word": "Dissimilar",
    "meaning": "not alike; having nothing in common",
    "examples_0": "Although they have the same parents, the brother and sister are dissimilar in look and personality.",
    "examples_1": "Students were asked to sort the dissimilar shapes into a pile away from the circles."
  },
  {
    "word": "Dissimulation",
    "meaning": "the action of covering the truth",
    "examples_0": "Many anti-government groups believe the president is always conducting acts of dissimulation to deceive the public.",
    "examples_1": "When I took my mother?s car without permission, I refilled the gas tank and left the car exactly as I found it as part of my dissimulation to avoid being caught."
  },
  {
    "word": "Dissipate",
    "meaning": "to drive away",
    "examples_0": "According to meteorologists, the storm will dissipate after a few hours and make way for the sunshine.",
    "examples_1": "Jason won the lottery and then watched all of his money dissipate after marrying a gold-digger who only cared about shopping."
  },
  {
    "word": "Dissociate",
    "meaning": "to distance or detach someone or something from a group",
    "examples_0": "When Beverly?s friends started to get into trouble with drugs and alcohol, she decided to dissociate from them and find nicer friends.",
    "examples_1": "Right after Kevin?s mother died, his friends worried that he would dissociate from his feelings so he wouldn?t feel sad about her death."
  },
  {
    "word": "Dissolute",
    "meaning": "given to immoral behavior",
    "examples_0": "My cousin is a dissolute woman who likes to irritate her religious parents by performing immoral deeds.",
    "examples_1": "When I was young, I was rather dissolute and only hung out with people who got into trouble for behaving improperly."
  },
  {
    "word": "Dissolve",
    "meaning": "to liquefy; melt into a fluid",
    "examples_0": "Sugar will dissolve quickly in a hot cup of coffee.",
    "examples_1": ""
  },
  {
    "word": "Dissonance",
    "meaning": "a lack of agreement; generally between what one believes and how one acts",
    "examples_0": "His cruel abuse showed a dissonance with his loving words.",
    "examples_1": "If Congress can explain the dissonance between their promises and their actual results, the public would be happy to hear the explanation."
  },
  {
    "word": "Dissuade",
    "meaning": "to convince an individual to not try or complete something",
    "examples_0": "Jealous people will always try to dissuade you from trying to be successful.",
    "examples_1": "When the car dealer saw I was trying to leave without purchasing a car, he tried to dissuade me from leaving the lot."
  },
  {
    "word": "Distal",
    "meaning": "something that is distant from something else",
    "examples_0": "The paramedics were concerned with their patient?s distal pulse because there was a lot of time between beats.",
    "examples_1": "Volts of electricity entered at the top of the man?s head and flowed through the body exiting at a distal point at the tip of the man?s big toe."
  },
  {
    "word": "Distance",
    "meaning": "an amount of physical space between two things",
    "examples_0": "The distance between Earth and the Moon is considerable for us to consider, even though it is almost nothing compared to the true vastness of space.",
    "examples_1": "A mile is a measurement of distance that denotes five thousand two hundred and eighty feet, from the start of the mile to the end of it."
  },
  {
    "word": "Distant",
    "meaning": "far enough away to be out of immediate reach",
    "examples_0": "I wanted to change the channel, but the remote was just distant enough that I would have to get up to grab it, and I didn?t want to move.",
    "examples_1": "My father and I have been distant from one another for several years now, never speaking to each other and unsure of who should make the first move."
  },
  {
    "word": "Distant",
    "meaning": "far away from each other physically or in time",
    "examples_0": "The most distant celestial body from the Sun in our solar system is Pluto, a dwarf planet at the farthest reaches of our immediate space.",
    "examples_1": "No one is sure how long it will be before humans can travel into deep space, but I imagine that day is quite distant from where we are now."
  },
  {
    "word": "Distaste",
    "meaning": "dislike or mild disdain for something",
    "examples_0": "I have a mild distaste for anything bitter, but I would certainly eat those foods if I were hungry enough.",
    "examples_1": "Ever since I was a child, I always had a great distaste for bananas, as I cannot stand their texture or their taste."
  },
  {
    "word": "Distasteful",
    "meaning": "unpleasant or offensive; causing dislike",
    "examples_0": "Donning a distasteful outfit, the protester?s offensive garb made many people upset.",
    "examples_1": "The candidate?s distasteful T.V. ad was used to bring down his opponent, but he ended up making himself look bad."
  },
  {
    "word": "Distemper",
    "meaning": "an infectious viral disease found in animals, especially dogs",
    "examples_0": "The puppy was vaccinated for distemper and several other viral respiratory diseases.",
    "examples_1": "During a vet exam, the dog was diagnosed with distemper and quarantined to prevent spread to other animals."
  },
  {
    "word": "Distend",
    "meaning": "to become larger from internal pressure",
    "examples_0": "The hernia caused his stomach to distend from organ misplacement.",
    "examples_1": "The excess food consumption made her stomach distend from bloat."
  },
  {
    "word": "Distill",
    "meaning": "to extract out the essential meaning or most important pieces of something",
    "examples_0": "Though he didn?t know some of the words, the reader was able to distill most of what the author was saying.",
    "examples_1": "Working through over 500 tips, detectives tried to distill the most crucial information from the reports."
  },
  {
    "word": "Distinct",
    "meaning": "different in an obvious way",
    "examples_0": "Everyone?s DNA is distinct and unique.",
    "examples_1": "Because of the chef?s distinct cooking style, his food is easily identified in a taste test."
  },
  {
    "word": "Distinction",
    "meaning": "a clear difference or contrast between similar people or things",
    "examples_0": "Although they are identical twins, there is a noticeable distinction between the colors of their hair.",
    "examples_1": "Andy aced the interview, but his boss soon realized there is a distinction in what Andy says and what he does."
  },
  {
    "word": "Distinctive",
    "meaning": "specifying as unique, special or characteristic",
    "examples_0": "The only distinctive quality of this job candidate was his ability to speak to clients calmly because his clerical skills were a mess.",
    "examples_1": "In the middle-income subdivision, the distinctive house at the end of the main street could not be missed by anyone traveling through the neighborhood since it was a mansion."
  },
  {
    "word": "Distinctness",
    "meaning": "being easily distinguishable from other things due to particular attributes",
    "examples_0": "People have distinctness about them, possessing traits in both appearance and personality that set them apart from one another.",
    "examples_1": "What really sets different cars and trucks apart from each other is the distinctness of their aesthetic design, since they all bear the same practical function."
  },
  {
    "word": "Distinguish",
    "meaning": "to recognize something or someone as being unique",
    "examples_0": "A police detective often finds himself in the position of having to distinguish between a lie and a truth.",
    "examples_1": "Unfortunately the witness could not distinguish her attacker in the photo lineup."
  },
  {
    "word": "Distinguishable",
    "meaning": "being able to clearly see or hear something from within a whole and recognize it as different",
    "examples_0": "The fuzzy words on the page were only distinguishable after Mike put on his glasses.",
    "examples_1": "The teacher instructed the student to rewrite his letters until they were distinguishable from scribbles."
  },
  {
    "word": "Distinguished",
    "meaning": "describing something that is noteworthy or otherwise significant for some reason",
    "examples_0": "The General is a distinguished officer, having performed admirably in two wars and being directly responsible for victory in three major battles.",
    "examples_1": "The Dodge Ram is a distinguished truck because it has been the face of reliable towing vehicles for several decades."
  },
  {
    "word": "Distort",
    "meaning": "to bring something out of shape or to misrepresent",
    "examples_0": "My friend had an app on her phone that would distort our faces in amusing ways.",
    "examples_1": "The funhouse mirror was designed to distort the visage of anyone who stood in front of it."
  },
  {
    "word": "Distortion",
    "meaning": "an irregularity or abnormality in the shape or perception of something",
    "examples_0": "After getting hit by a flashbang, the victim suffers severe distortion in their ability to both hear and see.",
    "examples_1": "You may experience a bit of visual distortion if you get up too quickly after lying down for an extended period of time."
  },
  {
    "word": "Distract",
    "meaning": "to misdirect attention from one focus to another usually as an act of deception",
    "examples_0": "During the Trojan War, a great wooden horse was sent to distract the soldiers and allow the enemy Greeks to enter Troy and win the war.",
    "examples_1": "Some argue that fidget spinners help some students and other claim that the toys only distract students from their learning."
  },
  {
    "word": "Distraught",
    "meaning": "so upset that one cannot behave normally",
    "examples_0": "When my father died, I was so distraught I dropped out of school.",
    "examples_1": "Jerry became distraught when his wife approached him with divorce papers."
  },
  {
    "word": "Distress",
    "meaning": "physical or mental anguish",
    "examples_0": "The anxiety attack left me in a bit of distress.",
    "examples_1": "When the boat caught on fire, the captain issued a distress call."
  },
  {
    "word": "Distribute",
    "meaning": "to divide into portions and dispense",
    "examples_0": "Churches often distribute pamphlets to invite people to attend their Sunday service.",
    "examples_1": ""
  },
  {
    "word": "Distribution",
    "meaning": "the provision of goods and materials to multiple recipients",
    "examples_0": "Multiple people won the contest held by the state, but they would have to wait for the prize distribution to take place a month later.",
    "examples_1": "The teacher will often assign a student to distribution duty, perhaps considering the passing out of papers the least a student could do to assist them."
  },
  {
    "word": "Distributive",
    "meaning": "related to the act of giving or spreading out",
    "examples_0": "The distributive center is in charge of getting all of the products made at the factory out and into the stores.",
    "examples_1": "Because of the distributive consequences of the man?s actions, many people in his family were hurt."
  },
  {
    "word": "District",
    "meaning": "an area of a country or a city",
    "examples_0": "Moving to a new district, it was difficult for the student to adjust to his new school.",
    "examples_1": "Because we live in different areas, my parents vote in one district and I cast my ballot in another."
  },
  {
    "word": "Distrust",
    "meaning": "doubt in the ability to trust someone or something",
    "examples_0": "I have always had a strong distrust for politicians, as they never seem to follow through on the promises they make to the public.",
    "examples_1": "For some reason my little brother has also borne a mild distrust of aircraft, even though airplanes are by far the safest vehicle for travel."
  },
  {
    "word": "Disturb",
    "meaning": "to bother or concern someone",
    "examples_0": "The sight of all the violence that was taking place during the riots served to disturb my mother, who was always a bit on the nave side.",
    "examples_1": "If you really want to disturb someone, you will probably have to do something that they really detest or hate."
  },
  {
    "word": "Ditch",
    "meaning": "to get rid of something",
    "examples_0": "Michael was willing to ditch his baseball cap and jeans for a wedding day suit.",
    "examples_1": "The bride and groom decided to ditch the vow tradition and recited a poem instead."
  },
  {
    "word": "Dither",
    "meaning": "to hesitate or be indecisive",
    "examples_0": "Terry tends to dither when someone asks him where to have lunch, as he is never able to decide on a restaurant.",
    "examples_1": "Because they dither and dally all afternoon, the children rarely finish their homework."
  },
  {
    "word": "Ditto",
    "meaning": "that which was stated before, the aforesaid, the above, the same, likewise",
    "examples_0": "When I took notes for class, I used ditto marks to show repetition.",
    "examples_1": "To show that he agreed, my friend said, ?ditto.?"
  },
  {
    "word": "Ditto",
    "meaning": "a word or mark used to agree with something said or to avoid repeating something",
    "examples_0": "?Ditto,? said Alex when agreeing with his friend that strawberry pie is the best kind.",
    "examples_1": "Although he agreed, the shy man only whispered ?ditto? after hearing what his outspoken coworker had to say."
  },
  {
    "word": "Diurnal",
    "meaning": "energetic during the daylight hours",
    "examples_0": "Because bats are not active during the day, they are not diurnal creatures.",
    "examples_1": "John found it hard to work a diurnal job after being on the night shift for fifteen years."
  },
  {
    "word": "Diverge",
    "meaning": "to separate into different directions",
    "examples_0": "The interstate began to diverge into two exit ramps.",
    "examples_1": "She dropped the bowl and watched as glass shards started to diverge on the kitchen floor."
  },
  {
    "word": "Divergence",
    "meaning": "the process or state of separating",
    "examples_0": "The married couple is currently in a state of divergence, going through the divorce process so they can legally separate.",
    "examples_1": "An intersection in a road is a point of divergence in which drivers can separate from the path they have been taking until that point."
  },
  {
    "word": "Divergent",
    "meaning": "different from each other or growing further apart",
    "examples_0": "There were also divergent attitudes towards industrialization in China and Japan.",
    "examples_1": ""
  },
  {
    "word": "Diverse",
    "meaning": "composed of different people or features",
    "examples_0": "The restaurant has a diverse menu that includes entrees from all over the world.",
    "examples_1": "In our culturally diverse neighborhood, people of many races live together in peace."
  },
  {
    "word": "Diversify",
    "meaning": "to make something less uniform by adding different things to it",
    "examples_0": "Many producers attempt to diversify their films by casting actors of many different nationalities in them.",
    "examples_1": "In an attempt to diversify my breakfast, I decided to cook some bacon to go with my toast and eggs."
  },
  {
    "word": "Diversion",
    "meaning": "a distraction or turning from another activity",
    "examples_0": "Soldiers often use a diversion tactic, like a small attack away from their target, to sneak up on the enemy.",
    "examples_1": "Melissa took a diversion from her normal afternoon workout and decided to go to the movies instead."
  },
  {
    "word": "Diversity",
    "meaning": "an assortment of different types",
    "examples_0": "As a teacher, Bridgett has to deal with a large amount of diversity in her inner city classroom.",
    "examples_1": "The chocolate box contains a diversity of flavors."
  },
  {
    "word": "Divert",
    "meaning": "to shift from one thing or another or to distract someone",
    "examples_0": "I decided to divert the conversation away from the topic of politics.",
    "examples_1": "The thieves knew to divert the shopkeeper?s attention so they could steal the items."
  },
  {
    "word": "Divest",
    "meaning": "to deprive of or strip away",
    "examples_0": "Divest yourself from the company of evil men or you will learn to mimic their ways.",
    "examples_1": "Under the new deal, the company agreed to divest itself of half its revenues, so they could distribute it among their creditors."
  },
  {
    "word": "Divide",
    "meaning": "to split or separate something into two or more parts or groups",
    "examples_0": "I am in love with books and have to divide my day into house chores, time to write and time to read.",
    "examples_1": ""
  },
  {
    "word": "Dowdy",
    "meaning": "unstylish, especially in reference to apparel",
    "examples_0": "The clothes I was wearing were apparently too dowdy for the popular kids to acknowledge them, but I really didn?t care for their sense of style.",
    "examples_1": "If you are going to a dance or similar event, you should wear something fashionable instead of something dowdy."
  },
  {
    "word": "Downcast",
    "meaning": "feeling sad, depressed, or despondent",
    "examples_0": "My daughter was extremely downcast when she couldn?t get ice cream, but I promised her we would go to the park later.",
    "examples_1": "I was feeling downcast after I learned that I had made an F on my math test, especially since I believed I had done better than that."
  },
  {
    "word": "Downfall",
    "meaning": "a loss of power or prestige",
    "examples_0": "The downfall of the Soviet Union was likely due to the unhappiness that they brewed in the hearts of their own people.",
    "examples_1": "A serious scandal will quickly lead to the downfall of a political figure, especially if it makes people lose their respect for them."
  },
  {
    "word": "Downgrade",
    "meaning": "to reduce in rank or importance",
    "examples_0": "After many years alone, the aging single was forced to downgrade her expectations.",
    "examples_1": "Because of rising costs, the family was required to downgrade their insurance coverage."
  },
  {
    "word": "Downgrading",
    "meaning": "reducing something to a lower rank, level, or grade",
    "examples_0": "Since he no longer needs the program for school, the student is thinking of downgrading his account to the free version.",
    "examples_1": "As the hurricane begins to calm, the storm team will be downgrading the system from a 3 to a 2."
  },
  {
    "word": "Downhill",
    "meaning": "toward the bottom of something",
    "examples_0": "The ball rolled downhill from the top of the slope to the bottom of the mound.",
    "examples_1": "Sleds aren?t much fun if you can?t sit on top of some type of hill and ride them straight down."
  },
  {
    "word": "Downpour",
    "meaning": "sudden, heavy rainfall",
    "examples_0": "Because her windshield wipers were broken, Beth had to pull over until the downpour stopped.",
    "examples_1": "Dark clouds filled the sky and before long, a downpour began."
  },
  {
    "word": "Downright",
    "meaning": "complete or total",
    "examples_0": "There has been so much downright terrible things happening in the world lately that some people are afraid to even leave their homes.",
    "examples_1": "My friend has been downright miserable due to the flu that she has been struck with, forcing her to stay in bed."
  },
  {
    "word": "Downsize",
    "meaning": "to make something smaller or lessen",
    "examples_0": "When we downsize into a smaller house this fall, we will have to get rid of a lot of our extra furniture.",
    "examples_1": "The company will have to downsize to less than 100 stores if it wants to avoid bankruptcy and shutting down altogether."
  },
  {
    "word": "Downtrodden",
    "meaning": "oppressed; exploited.",
    "examples_0": "Hanging his head low, the downtrodden slave felt as if his life was without meaning.",
    "examples_1": "Browbeaten and downtrodden, the citizens were ruled by a power-crazed dictator."
  },
  {
    "word": "Downturn",
    "meaning": "a decline in business or the economy",
    "examples_0": "A downturn in the real estate market made it really difficult for realtors to sell houses.",
    "examples_1": "An economic downturn caused people to stop spending, which led several downtown shops to close."
  },
  {
    "word": "Dowry",
    "meaning": "property or payment given at time of marriage",
    "examples_0": "Part of her dowry included land that her father would give her husband.",
    "examples_1": "Her marriage prospects were looking grim because she didn?t have a sizeable dowry."
  },
  {
    "word": "Doxology",
    "meaning": "a Christian hymn or verse",
    "examples_0": "The doxology at the end of the Catholic prayer was chanted by the patrons.",
    "examples_1": "Memorizing the doxology, the man felt closer to God since he could recite the hymn at any time."
  },
  {
    "word": "Doyen",
    "meaning": "a man who serves as an expert as the senior member of a group",
    "examples_0": "The doyen of the group joined the Boy Scouts of America before any of the other members.",
    "examples_1": "As the group?s doyen, the leader was able to advise the newbies of the rights and wrongs."
  },
  {
    "word": "Doze",
    "meaning": "to nap lightly",
    "examples_0": "The wife always joked that her deep-sleeping husband could doze in the middle of a hurricane.",
    "examples_1": "After days of no sleep, the fatigued man began to doze off in his recliner."
  },
  {
    "word": "Dozen",
    "meaning": "a quantity of twelve",
    "examples_0": "A dozen donuts were served to the twelve breakfast guests.",
    "examples_1": "A dozen women showed up to the luncheon, but only ten ate after two invitees had left early."
  },
  {
    "word": "Drab",
    "meaning": "dull; lacking brightness or enthusiasm",
    "examples_0": "Somber and drab, the gloomy hospital room made the depressed patient even sadder.",
    "examples_1": "A bright scarf lightened the mood and improved the CEO?s drab outfit."
  },
  {
    "word": "Draconian",
    "meaning": "harsh and cruel",
    "examples_0": "Giving someone a life sentence for stealing a loaf of bread is a draconian consequence.",
    "examples_1": "To many, capital punishment is a draconian practice."
  },
  {
    "word": "Draft",
    "meaning": "a first version of something written or drawn",
    "examples_0": "Before I submit my final article, I need to edit my draft.",
    "examples_1": "The blueprint draft has been sketched but the official copy isn?t finished."
  },
  {
    "word": "Drag",
    "meaning": "to pull someone or something often roughly and through or across an area",
    "examples_0": "The soccer players drag the heavy duffle bags into the locker room.",
    "examples_1": "Campers drag their sleeping bags and tents for miles through the thick forest until they reach their campground."
  },
  {
    "word": "Dragnet",
    "meaning": "a police set-up put in place to catch a criminal",
    "examples_0": "Concealing his badge, the officer prepared the dragnet for the citywide drug sting.",
    "examples_1": "The law enforcement sting included a dragnet aimed at capturing human traffickers."
  },
  {
    "word": "Dragoon",
    "meaning": "a British soldier mounted on horseback",
    "examples_0": "Training of the British dragoon included lessons in horse-riding as well as fighting while mounted.",
    "examples_1": "Grasping the Prussian flag, the British dragoon was able to defend himself while riding away from combat."
  },
  {
    "word": "Drastic",
    "meaning": "extreme or severe",
    "examples_0": "She was so brokenhearted after the breakup that she considered taking drastic measures to win him back.",
    "examples_1": "After he lost the game, his drastic reaction was to punch a wall."
  },
  {
    "word": "Drat",
    "meaning": "an expression used when one wants to express irritation or annoyance",
    "examples_0": "?Oh, drat!? Harriet exclaimed when she realized she had left her wallet at home.",
    "examples_1": "?Double drat and darn it,? Claire complained after finding out she didn?t get the job."
  },
  {
    "word": "Draught",
    "meaning": "a current of air",
    "examples_0": "Since Billy didn?t shut the glass door completely, his mom could feel a small draught.",
    "examples_1": "The old mansion was beautiful in architectural design, but the owners experienced discomfort due to the creaks and a cool draught felt in each room."
  },
  {
    "word": "Drawback",
    "meaning": "a disadvantage or downside",
    "examples_0": "The cruise to the Bahamas offered many perks, but the overall price was still a drawback.",
    "examples_1": "Selling the house included the drawback of having to find and hire a realtor."
  },
  {
    "word": "Drawl",
    "meaning": "a type of accent branded by slow and drawn out speaking that is usually related to the southern United States",
    "examples_0": "The old banjo player?s songs seemed to go on and on as he picked and sang along in a Southern drawl.",
    "examples_1": "?Yawl come back now,? the woman called in a drawl that was as sugary as it was country."
  },
  {
    "word": "Drawn",
    "meaning": "showing wear from being overworked or not cared for",
    "examples_0": "The student?s once healthy face looked drawn after several late-night study sessions.",
    "examples_1": "Haggard and worn, the homeless man?s drawn appearance represented years of neglect."
  },
  {
    "word": "Dread",
    "meaning": "a feeling of intense fear and anxiety",
    "examples_0": "The extremely shy speaker was filled with dread as she stepped in front of the microphone.",
    "examples_1": "Dread crept into the woman?s throat as she spotted a shadowy figure at the opposite end of the dark alley."
  },
  {
    "word": "Dreadful",
    "meaning": "extremely terrible or awful",
    "examples_0": "The dreadful heat beat down on the farmhands, making their day?s work even more grueling.",
    "examples_1": "A dreadful noise filled the halls of the insane asylum as the patients cried out for help."
  },
  {
    "word": "Dreamt",
    "meaning": "imagined or fantasized about something or someone",
    "examples_0": "The love-sick man dreamt about the day he would finally marry his true love.",
    "examples_1": "I had dreamt about winning the lottery but never thought it would actually happen."
  },
  {
    "word": "Dreary",
    "meaning": "cheerless, bleak, and dull",
    "examples_0": "The rainy weather was putting me in a dreary mood.",
    "examples_1": "After the death of my grandmother, I was in a dreary mood for weeks."
  },
  {
    "word": "Dreck",
    "meaning": "flimsy or cheaply made",
    "examples_0": "Bargain hunters are always looking for products that are low in price but not dreck or of low quality.",
    "examples_1": "Thinking she got a good deal, the shopper was upset to learn that the brush she purchased was dreck and broke quickly."
  },
  {
    "word": "Dredge",
    "meaning": "a huge, power shovel used to remove dirt and other debris from a channel or riverbed",
    "examples_0": "The workers used the dredge to remove sediment from the shallow sea.",
    "examples_1": "The channel was not navigable until a dredge was used to remove a large slab of concrete."
  },
  {
    "word": "Dregs",
    "meaning": "the least wanted parts or persons",
    "examples_0": "People who think homeless people are the dregs of society do not realize they could be down-and-out too.",
    "examples_1": "In the cafeteria the popular girls always sit far apart from the people they consider to be the school dregs."
  },
  {
    "word": "Drench",
    "meaning": "to cover abundantly",
    "examples_0": "Everyone gasped as my little sister used ketchup to drench every piece of food on her plate.",
    "examples_1": "I watched in horror as the spewing liquid continued to drench every inch of the brand new carpet."
  },
  {
    "word": "Drift off",
    "meaning": "to fall asleep slowly",
    "examples_0": "I had just started to drift off to sleep when I heard the doorbell.",
    "examples_1": ""
  },
  {
    "word": "Dungeon",
    "meaning": "an underground prison, usually of a castle",
    "examples_0": "The king?s dank and chilly dungeon kept the most notorious offenders in the city.",
    "examples_1": "Without a dungeon to place the captive in, the soldiers took turns keeping watch of a makeshift cell."
  },
  {
    "word": "Dunnage",
    "meaning": "a person's belongings, especially those brought on board ship",
    "examples_0": "Loading the dunnage on the ship was a tough job since the passenger had packed for a three month stay.",
    "examples_1": "There was minimal space for dunnage under the bus, so the passenger packed as much as she could in her carry-on bag."
  },
  {
    "word": "Duo",
    "meaning": "a pair or couple, usually associated with one another",
    "examples_0": "Minnie and Mickey Mouse are the most famous duo in Disney history.",
    "examples_1": "The dynamic duo, Batman and Robin, worked together to defeat the criminals in Gotham City."
  },
  {
    "word": "Dupe",
    "meaning": "to deliberately mislead someone or the person who is easily used or tricked",
    "examples_0": "My brother is a schemer who is always trying to dupe people out of their money.",
    "examples_1": "Because Bill does whatever his friends tell him to do, he is the perfect dupe to act as a getaway driver."
  },
  {
    "word": "Duplex",
    "meaning": "a house divided into two separate apartments",
    "examples_0": "Both sides of the duplex are currently being rented.",
    "examples_1": "Aside from the wall in the middle, the duplex apartments shared everything."
  },
  {
    "word": "Duplicate",
    "meaning": "an exact copy of an original",
    "examples_0": "The man?s duplicate license replaced the original that he lost.",
    "examples_1": "A duplicate copy of the infant?s birth certificate was requested by his parents."
  },
  {
    "word": "Duplicity",
    "meaning": "dishonest behavior that is intended to trick someone",
    "examples_0": "Most politicians use duplicity to deceive voters just long enough to get their votes.",
    "examples_1": "Although the swindler used duplicity to trick his victims, he never physically harmed anyone."
  },
  {
    "word": "Durable",
    "meaning": "able to stay in good condition, withstand wear and damage; strong",
    "examples_0": "The plate was made of durable plastic and didn?t break when accidentally dropped.",
    "examples_1": "The couple was searching for a durable car that would last years."
  },
  {
    "word": "Duration",
    "meaning": "the time period in which something occurs",
    "examples_0": "The total duration of the film is 180 minutes.",
    "examples_1": "Our field trip ended early since the duration of the movie was much shorter than expected."
  },
  {
    "word": "Duress",
    "meaning": "force or threats meant to make someone do something",
    "examples_0": "The judge overturned the case because the defendant?s attorney proved that his client?s confession had been given under duress.",
    "examples_1": "The vet said Scampi was licking her nose because she was stressed out, but I didn?t think she had been under any duress."
  },
  {
    "word": "Dusk",
    "meaning": "the darkest part of the evening",
    "examples_0": "The boy?s mother warned him that he must be back inside before the streetlights came on at dusk.",
    "examples_1": "I enjoyed watching the sunset go down, but left the park right before dusk."
  },
  {
    "word": "Dutiful",
    "meaning": "responsible; devoted",
    "examples_0": "A dutiful daughter will care for her parents in times of difficulty.",
    "examples_1": "As a dutiful soldier, the man served his country with pride."
  },
  {
    "word": "Dutifully",
    "meaning": "performing responsibilities as expected",
    "examples_0": "The Navy Seaman dutifully painted the ship gray as required by the military.",
    "examples_1": "Knowing how much he loves to eat, the wife dutifully cooked three meals a day."
  },
  {
    "word": "Duty",
    "meaning": "a responsibility or obligation",
    "examples_0": "As an American, it is your duty to vote on Election Day.",
    "examples_1": "The lifeguard?s duty was to keep the swimmers safe."
  },
  {
    "word": "Dwarf",
    "meaning": "a mythical creature that is short in stature",
    "examples_0": "Without a step stool, it was difficult for the dwarf to get anything done around the cabin.",
    "examples_1": "Each dwarf took a keen liking to Snow White."
  },
  {
    "word": "Dwell",
    "meaning": "to live in a specific place",
    "examples_0": "The migrant worker did not intend to dwell in the rural town for very long.",
    "examples_1": "There was no way for the homeowner to dwell the roach infested house."
  },
  {
    "word": "Dweller",
    "meaning": "a person who lives in a particular place",
    "examples_0": "The apartment manager offered the dweller a month of rent free living in exchange of a new lease signing.",
    "examples_1": "Without a dweller, the house was empty for several months."
  },
  {
    "word": "Dwelling",
    "meaning": "a place where people live",
    "examples_0": "An adobe dwelling was made from dirt and other organic materials.",
    "examples_1": "Without materials to build a more stable dwelling, the natives settled on teepees."
  },
  {
    "word": "Edema",
    "meaning": "an increase in the size of an area of a person?s body due to excess fluid",
    "examples_0": "Once the pain was too much to bear due to Kevin?s edema, he was admitted to the hospital to drain the water pooling under his skin.",
    "examples_1": "It became apparent that Sally might be suffering from edema considering her right hand was much larger than her left."
  }
]